{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Cellulose (35-40%), Hemicellulose (25-30%), Lignin (15-20%), Ash (5-10%), Moisture (5-10%)",
      "key_specs": "Corn stover is an agricultural residue consisting of the leaves, stalks, and cobs of maize plants. It is typically collected post-harvest and may require pretreatment to reduce lignin content and increase accessibility of cellulose and hemicellulose.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "3-Hydroxy butyrolactone",
      "composition": "C4H6O2",
      "key_specs": "3-Hydroxy butyrolactone is a high-purity chemical intermediate used in the synthesis of pharmaceuticals and biodegradable polymers. Commercial production requires a purity of over 99%.",
      "volumetric_scale": "10,000 metric tons per year"
    }
  ],
  "unit_operations": {
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The pretreatment unit operation is designed to prepare the corn stover for subsequent processing by breaking down its lignocellulosic structure. This involves a combination of mechanical, chemical, and/or thermal treatments to reduce the lignin content and increase the accessibility of cellulose and hemicellulose. Common methods include steam explosion, acid hydrolysis, or alkaline treatment. The goal is to disrupt the complex matrix of cellulose, hemicellulose, and lignin, making the carbohydrates more accessible for enzymatic hydrolysis.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover",
        "Pretreatment Chemical Agents"
      ],
      "output_streams": [
        "Pretreated Biomass"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Reduction of lignin content to enhance accessibility of cellulose and hemicellulose",
            "component": "Lignin",
            "extractionRate": 0.5
          }
        ]
      },
      "additional_info": "Pretreatment is crucial for efficient downstream processing and can significantly impact the overall process economics."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass undergoes enzymatic hydrolysis to convert cellulose and hemicellulose into fermentable sugars. Enzymes such as cellulases and hemicellulases are used to catalyze the breakdown of polysaccharides into monosaccharides like glucose and xylose. This step is critical for maximizing sugar yield, which directly influences the efficiency of the subsequent fermentation process.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Enzymatic hydrolysis of cellulose into glucose using cellulase enzymes.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.9
          },
          {
            "description": "Enzymatic hydrolysis of hemicellulose into xylose using hemicellulase enzymes.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.8
          }
        ]
      },
      "additional_info": "The choice of enzymes and their loading rates are critical factors affecting the cost and efficiency of this step."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The fermentation unit operation involves converting the sugar solution into 3-hydroxybutyric acid (3-HBA) using a microbial culture. Specific strains of bacteria or yeast are employed to ferment the sugars, primarily glucose and xylose, into 3-HBA. This bioconversion process is optimized for yield and productivity, requiring careful control of fermentation conditions such as pH, temperature, and nutrient supply.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Sugar Solution",
        "Microbial Culture",
        "Nutrient Solution"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The fermentation process converts glucose into 3-Hydroxybutyric Acid using microbial culture under anaerobic conditions.",
            "inputComponent": "Glucose",
            "outputComponent": "3-Hydroxybutyric Acid",
            "conversionRate": 0.6
          },
          {
            "description": "The fermentation process converts xylose into 3-Hydroxybutyric Acid using specific strains of bacteria.",
            "inputComponent": "Xylose",
            "outputComponent": "3-Hydroxybutyric Acid",
            "conversionRate": 0.5
          }
        ]
      },
      "additional_info": "The selection of microbial strains and optimization of fermentation conditions are key to achieving high yields of 3-HBA."
    },
    "product_recovery": {
      "unit_operation_id": "product_recovery",
      "name": "Product Recovery",
      "description": "This unit operation focuses on the separation and purification of 3-hydroxybutyric acid from the fermentation broth. Techniques such as centrifugation, filtration, and solvent extraction are employed to isolate 3-HBA from the complex mixture. The goal is to achieve a high-purity intermediate suitable for further chemical conversion into 3-hydroxy butyrolactone.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Purified 3-Hydroxybutyric Acid",
        "Waste Stream"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Centrifugation to separate microbial biomass from the liquid phase containing 3-HBA and residual sugars.",
            "component": "3-Hydroxybutyric Acid",
            "extractionRate": 0.95
          },
          {
            "description": "Filtration to remove suspended solids and some impurities post-centrifugation.",
            "component": "Residual Sugars",
            "extractionRate": 0.05
          },
          {
            "description": "Solvent extraction to selectively extract 3-HBA from the remaining liquid.",
            "component": "Microbial Biomass",
            "extractionRate": 0.01
          }
        ]
      },
      "additional_info": "Efficient recovery and purification are essential to minimize product loss and reduce downstream processing costs."
    },
    "chemical_conversion": {
      "unit_operation_id": "chemical_conversion",
      "name": "Chemical Conversion",
      "description": "In this unit operation, the purified 3-hydroxybutyric acid undergoes chemical conversion to form 3-hydroxy butyrolactone. This transformation typically involves a catalytic dehydration reaction, where a catalyst facilitates the removal of water from 3-HBA to form the lactone ring structure of 3-hydroxy butyrolactone. The choice of catalyst and reaction conditions are optimized to maximize yield and selectivity.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Purified 3-Hydroxybutyric Acid",
        "Catalyst"
      ],
      "output_streams": [
        "3-Hydroxy Butyrolactone",
        "Water"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Dehydration of 3-Hydroxybutyric Acid to form 3-Hydroxy Butyrolactone and water, facilitated by a suitable catalyst.",
            "inputComponent": "3-Hydroxybutyric Acid",
            "outputComponent": "3-Hydroxy Butyrolactone",
            "conversionRate": 0.95
          },
          {
            "description": "Byproduct formation through the dehydration process, where water is produced alongside 3-Hydroxy Butyrolactone.",
            "inputComponent": "3-Hydroxybutyric Acid",
            "outputComponent": "Water",
            "conversionRate": 0.95
          }
        ]
      },
      "additional_info": "Catalyst selection and reaction optimization are critical to achieving high conversion rates and product purity."
    },
    "product_purification": {
      "unit_operation_id": "product_purification",
      "name": "Product Purification",
      "description": "The final unit operation involves purifying the 3-hydroxy butyrolactone to meet commercial specifications. Techniques such as distillation, crystallization, or chromatography are employed to achieve the desired purity level of over 99%. This step ensures that the product is suitable for use in pharmaceuticals and biodegradable polymers.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "3-Hydroxy Butyrolactone"
      ],
      "output_streams": [
        "High-Purity 3-Hydroxy Butyrolactone"
      ],
      "parameters": {},
      "additional_info": "Achieving high purity is essential for the product's application in sensitive industries such as pharmaceuticals."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is collected post-harvest from maize plants. The stream consists of a mixture of cellulose (35-40%), hemicellulose (25-30%), lignin (15-20%), ash (5-10%), and moisture (5-10%). It is an agricultural residue that may require pretreatment to reduce lignin content and enhance the accessibility of cellulose and hemicellulose for subsequent processing steps in the production of bio-based chemicals.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which is a critical input for the enzymatic hydrolysis process. The Enzyme Solution is a mixture of cellulases and hemicellulases specifically designed to catalyze the hydrolysis of polysaccharides present in pretreated biomass. This enzymatic action is essential for converting complex carbohydrates into fermentable sugars, facilitating the subsequent fermentation step in the production of 3-Hydroxybutyric Acid.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "microbial culture source": {
      "unit_operation_id": "microbial culture source",
      "name": "Microbial Culture Source",
      "description": "This unit operation serves as a source for the Microbial Culture stream, which consists of a selected strain of microorganisms specifically engineered or selected for their ability to efficiently convert sugars into 3-Hydroxybutyric Acid (3-HBA) during the fermentation process. The microbial culture is critical for the fermentation step, ensuring high conversion rates and product yields.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Microbial Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "waste stream sink": {
      "unit_operation_id": "waste stream sink",
      "name": "Waste Stream Sink",
      "description": "This unit operation serves as the sink for the Waste Stream generated during the product recovery and purification processes. It collects the residual biomass, primarily consisting of microbial biomass and residual sugars, that is removed from the system. The Waste Stream Sink is crucial for managing waste disposal and ensuring that the process adheres to environmental regulations by facilitating proper treatment or disposal of the waste materials.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Waste Stream"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "catalyst source": {
      "unit_operation_id": "catalyst source",
      "name": "Catalyst Source",
      "description": "This unit operation serves as a source for the Catalyst stream, which is essential for facilitating the dehydration reaction in the chemical conversion process. The catalyst is introduced into the system to enhance the reaction kinetics and improve the overall efficiency of the conversion of purified 3-Hydroxybutyric Acid into 3-Hydroxy Butyrolactone. The catalyst stream is delivered at the required volumetric scale to ensure optimal reaction conditions.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Catalyst"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "high_purity 3_hydroxy butyrolactone sink": {
      "unit_operation_id": "high_purity 3_hydroxy butyrolactone sink",
      "name": "High-Purity 3-Hydroxy Butyrolactone Sink",
      "description": "This unit operation serves as the final sink for the stream of High-Purity 3-Hydroxy Butyrolactone, which is produced through a series of chemical conversions and purification processes. The stream consists solely of 3-Hydroxy Butyrolactone with a purity exceeding 99%, making it suitable for commercial applications in pharmaceuticals and biodegradable polymers. This sink ensures that the high-quality product is collected and stored for distribution.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "High-Purity 3-Hydroxy Butyrolactone"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "pretreatment chemical agents source": {
      "unit_operation_id": "pretreatment chemical agents source",
      "name": "Pretreatment Chemical Agents Source",
      "description": "This unit operation serves as a source for the Pretreatment Chemical Agents stream, which includes various chemicals utilized during the pretreatment process of lignocellulosic biomass. These agents, which can be acids or alkalis, are essential for breaking down the complex lignocellulosic structure of materials like corn stover. The stream may also include water, particularly when steam or liquid treatments are employed. This source ensures that the necessary chemical agents are supplied in the required quantities to facilitate effective pretreatment, thereby enhancing the accessibility of cellulose and hemicellulose for subsequent processing steps.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Pretreatment Chemical Agents"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "nutrient solution source": {
      "unit_operation_id": "nutrient solution source",
      "name": "Nutrient Solution Source",
      "description": "The Nutrient Solution Source is a unit operation that serves as a critical input for the fermentation process. It supplies essential nutrients, minerals, and nitrogen sources necessary for the growth and metabolic activity of the microbial culture. The solution typically contains components such as nitrogen sources (e.g., Ammonium Sulfate), phosphates, trace minerals, and vitamins, which are vital for optimizing fermentation conditions and ensuring high yields of the desired product.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Nutrient Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "water sink": {
      "unit_operation_id": "water sink",
      "name": "Water Sink",
      "description": "The Water Sink unit operation serves as the terminus for the water produced during the catalytic dehydration reaction of 3-hydroxybutyric acid to form 3-hydroxy butyrolactone. This unit operation is critical for ensuring proper mass balance in the process, allowing for accurate tracking and management of all materials involved in the chemical conversion process. It effectively collects and manages the water byproduct, which is essential for maintaining operational efficiency and environmental compliance.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Water"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Collected post-harvest, consisting of leaves, stalks, and cobs of maize plants.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Corn stover with reduced lignin content and increased cellulose and hemicellulose accessibility.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Reduced Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A mixture of cellulases and hemicellulases to catalyze the hydrolysis of polysaccharides.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulases": 0,
        "Hemicellulases": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution rich in fermentable sugars derived from the hydrolysis of cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Residual Lignin": 0
      }
    },
    "Microbial Culture": {
      "name": "Microbial Culture",
      "stream_id": "microbial culture",
      "description": "A selected strain of bacteria or yeast capable of converting sugars to 3-HBA.",
      "stream_type": "core",
      "source": "microbial culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Microorganisms": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A complex mixture containing 3-hydroxybutyric acid, unconverted sugars, microbial biomass, and other metabolites.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "product_recovery",
      "flow_rate": 0.0,
      "components": {
        "3-Hydroxybutyric Acid": 0,
        "Residual Sugars": 0,
        "Microbial Biomass": 0
      }
    },
    "Purified 3-Hydroxybutyric Acid": {
      "name": "Purified 3-Hydroxybutyric Acid",
      "stream_id": "purified 3_hydroxybutyric acid",
      "description": "A high-purity intermediate ready for chemical conversion.",
      "stream_type": "core",
      "source": "product_recovery",
      "target": "chemical_conversion",
      "flow_rate": 0.0,
      "components": {
        "3-Hydroxybutyric Acid": 0
      }
    },
    "Waste Stream": {
      "name": "Waste Stream",
      "stream_id": "waste stream",
      "description": "Residual biomass and impurities removed during purification.",
      "stream_type": "core",
      "source": "product_recovery",
      "target": "waste stream sink",
      "flow_rate": 0.0,
      "components": {
        "Microbial Biomass": 0,
        "Residual Sugars": 0
      }
    },
    "Catalyst": {
      "name": "Catalyst",
      "stream_id": "catalyst",
      "description": "A catalyst to facilitate the dehydration reaction.",
      "stream_type": "core",
      "source": "catalyst source",
      "target": "chemical_conversion",
      "flow_rate": 0.0,
      "components": {
        "Catalyst": 0
      }
    },
    "3-Hydroxy Butyrolactone": {
      "name": "3-Hydroxy Butyrolactone",
      "stream_id": "3_hydroxy butyrolactone",
      "description": "The target product, a high-purity chemical intermediate.",
      "stream_type": "core",
      "source": "chemical_conversion",
      "target": "product_purification",
      "flow_rate": 0.0,
      "components": {
        "3-Hydroxy Butyrolactone": 0
      }
    },
    "High-Purity 3-Hydroxy Butyrolactone": {
      "name": "High-Purity 3-Hydroxy Butyrolactone",
      "stream_id": "high_purity 3_hydroxy butyrolactone",
      "description": "The final product with purity exceeding 99%, ready for commercial use.",
      "stream_type": "core",
      "source": "product_purification",
      "target": "high_purity 3_hydroxy butyrolactone sink",
      "flow_rate": 0.0,
      "components": {
        "3-Hydroxy Butyrolactone": 0
      }
    },
    "Pretreatment Chemical Agents": {
      "name": "Pretreatment Chemical Agents",
      "stream_id": "pretreatment chemical agents",
      "description": "This stream includes any chemicals added during the pretreatment process to aid in breaking down the lignocellulosic structure. These could be acids or bases used in hydrolysis or other chemical agents specific to the chosen pretreatment method.",
      "stream_type": "aux",
      "source": "pretreatment chemical agents source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Acid/Alkali (depending on the method)": 0,
        "Water (if steam or liquid treatments are used)": 0
      }
    },
    "Nutrient Solution": {
      "name": "Nutrient Solution",
      "stream_id": "nutrient solution",
      "description": "The nutrient solution provides essential nutrients, minerals, and possibly nitrogen sources required for the growth and metabolic activity of the microbial culture during the fermentation process.",
      "stream_type": "aux",
      "source": "nutrient solution source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Nitrogen Source (e.g., Ammonium Sulfate)": 0,
        "Phosphates": 0,
        "Trace Minerals": 0,
        "Vitamins": 0
      }
    },
    "Water": {
      "name": "Water",
      "stream_id": "water",
      "description": "Water is produced as a byproduct during the catalytic dehydration reaction of 3-hydroxybutyric acid to form 3-hydroxy butyrolactone. This water needs to be accounted for in the mass balance to ensure accurate tracking of all materials involved in the chemical conversion process.",
      "stream_type": "aux",
      "source": "chemical_conversion",
      "target": "water sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Ash": {
      "name": "Ash",
      "properties": {}
    },
    "Moisture": {
      "name": "Moisture",
      "properties": {}
    },
    "Reduced Lignin": {
      "name": "Reduced Lignin",
      "properties": {}
    },
    "Cellulases": {
      "name": "Cellulases",
      "properties": {}
    },
    "Hemicellulases": {
      "name": "Hemicellulases",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Residual Lignin": {
      "name": "Residual Lignin",
      "properties": {}
    },
    "Microorganisms": {
      "name": "Microorganisms",
      "properties": {}
    },
    "3-Hydroxybutyric Acid": {
      "name": "3-Hydroxybutyric Acid",
      "properties": {}
    },
    "Residual Sugars": {
      "name": "Residual Sugars",
      "properties": {}
    },
    "Microbial Biomass": {
      "name": "Microbial Biomass",
      "properties": {}
    },
    "Catalyst": {
      "name": "Catalyst",
      "properties": {}
    },
    "3-Hydroxy Butyrolactone": {
      "name": "3-Hydroxy Butyrolactone",
      "properties": {}
    },
    "Acid/Alkali (depending on the method)": {
      "name": "Acid/Alkali (depending on the method)",
      "properties": {}
    },
    "Water (if steam or liquid treatments are used)": {
      "name": "Water (if steam or liquid treatments are used)",
      "properties": {}
    },
    "Nitrogen Source (e.g., Ammonium Sulfate)": {
      "name": "Nitrogen Source (e.g., Ammonium Sulfate)",
      "properties": {}
    },
    "Phosphates": {
      "name": "Phosphates",
      "properties": {}
    },
    "Trace Minerals": {
      "name": "Trace Minerals",
      "properties": {}
    },
    "Vitamins": {
      "name": "Vitamins",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    }
  }
}