{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Cellulose (35-40%), Hemicellulose (25-30%), Lignin (15-20%), Ash (5-10%), Moisture (5-10%)",
      "key_specs": "Corn stover is a lignocellulosic biomass, typically requiring pretreatment to break down cellulose and hemicellulose into fermentable sugars.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Lysine",
      "composition": "C6H14N2O2",
      "key_specs": "Feed-grade lysine with a purity of 98.5% or higher, typically produced in a crystalline form for animal nutrition applications.",
      "volumetric_scale": "10,000 metric tons per year"
    }
  ],
  "unit_operations": {
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The pretreatment unit operation is designed to break down the complex lignocellulosic structure of corn stover into simpler, more accessible components. This is typically achieved through a combination of mechanical, chemical, and/or thermal processes. The goal is to disrupt the lignin structure and increase the surface area of cellulose and hemicellulose, making them more amenable to enzymatic hydrolysis. Common methods include steam explosion, acid hydrolysis, or alkaline treatment. This step is crucial to enhance the efficiency of subsequent enzymatic hydrolysis and fermentation processes.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover",
        "Water",
        "Chemicals (e.g., Acid or Alkali)",
        "Steam"
      ],
      "output_streams": [
        "Pretreated Biomass",
        "Wastewater"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Significant portion of cellulose retained in pretreated biomass after breakdown of corn stover.",
            "component": "Cellulose",
            "extractionRate": 0.85
          },
          {
            "description": "High retention of hemicellulose in pretreated biomass for improved enzymatic efficiency.",
            "component": "Hemicellulose",
            "extractionRate": 0.8
          },
          {
            "description": "Partial removal of lignin, with a fraction ending up in the wastewater stream as fragments.",
            "component": "Lignin",
            "extractionRate": 0.3
          }
        ]
      },
      "additional_info": "The choice of pretreatment method can significantly impact the overall process economics and efficiency."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass is subjected to enzymatic hydrolysis to convert cellulose and hemicellulose into fermentable sugars, primarily glucose and xylose. Enzymes such as cellulases and hemicellulases are added to the biomass slurry, catalyzing the breakdown of polysaccharides into monosaccharides. This step is critical for maximizing sugar yield, which directly influences the subsequent fermentation efficiency.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Enzymatic hydrolysis of cellulose into glucose using cellulase enzymes.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.85
          },
          {
            "description": "Enzymatic hydrolysis of hemicellulose into xylose using hemicellulase enzymes.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.75
          }
        ]
      },
      "additional_info": "The enzymatic hydrolysis is typically conducted at specific temperature and pH conditions to optimize enzyme activity."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The fermentation unit operation involves the conversion of fermentable sugars into lysine using a genetically engineered bacterial strain under aerobic conditions. The sugar solution is inoculated with the bacterial culture, and the fermentation is carried out in a bioreactor. Oxygen is supplied to maintain aerobic conditions, and nutrients are added to support bacterial growth and lysine production. The process is monitored to ensure optimal conditions for lysine synthesis.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Sugar Solution",
        "Bacterial Culture",
        "Nutrient Solution",
        "Air"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The conversion of glucose into lysine by a genetically engineered bacterial culture under aerobic conditions.",
            "inputComponent": "Glucose",
            "outputComponent": "Lysine",
            "conversionRate": 0.75
          },
          {
            "description": "The conversion of xylose into lysine facilitated by the same engineered bacterial culture, also under aerobic conditions.",
            "inputComponent": "Xylose",
            "outputComponent": "Lysine",
            "conversionRate": 0.6
          }
        ]
      },
      "additional_info": "The choice of bacterial strain and fermentation conditions are critical to achieving high lysine yields."
    },
    "broth_separation": {
      "unit_operation_id": "broth_separation",
      "name": "Broth Separation",
      "description": "In this unit operation, the fermentation broth is subjected to solid-liquid separation to remove bacterial biomass and residual lignin from the liquid containing lysine and unconverted sugars. This is typically achieved using centrifugation or filtration techniques. The goal is to obtain a clear liquid stream that can be further processed to recover lysine.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Clarified Broth",
        "Solid Waste"
      ],
      "parameters": {
        "separations": [
          {
            "description": "High efficiency separation of bacterial biomass from the fermentation broth using centrifugation or filtration techniques.",
            "component": "Bacterial Biomass",
            "extractionRate": 0.95
          },
          {
            "description": "Effective removal of lignin from the fermentation broth, resulting in cleaner liquid fractions.",
            "component": "Lignin",
            "extractionRate": 0.9
          }
        ]
      },
      "additional_info": "The solid waste stream may be further processed for by-product recovery or disposed of according to environmental regulations."
    },
    "lysine_recovery": {
      "unit_operation_id": "lysine_recovery",
      "name": "Lysine Recovery",
      "description": "The lysine recovery unit operation involves the extraction and purification of lysine from the clarified broth. This is typically achieved through crystallization or ion-exchange chromatography, where lysine is separated based on its chemical properties. The objective is to produce high-purity lysine suitable for feed-grade applications. The process parameters are optimized to maximize lysine yield and purity.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Clarified Broth"
      ],
      "output_streams": [
        "Crude Lysine",
        "Waste Stream"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of lysine from clarified broth through crystallization or ion-exchange chromatography.",
            "component": "Lysine",
            "extractionRate": 0.85
          },
          {
            "description": "Separation of unconverted sugars, which are directed into a waste stream.",
            "component": "Unconverted Sugars",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "The choice of recovery method can influence the purity and yield of the final lysine product."
    },
    "lysine_purification": {
      "unit_operation_id": "lysine_purification",
      "name": "Lysine Purification",
      "description": "In this final unit operation, the crude lysine is further purified to achieve the desired purity level of 98.5% or higher. This is often accomplished through recrystallization or additional ion-exchange steps. The purified lysine is then dried and converted into a crystalline form suitable for animal nutrition applications. The process ensures that the final product meets industry standards for feed-grade lysine.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Lysine"
      ],
      "output_streams": [
        "Purified Lysine"
      ],
      "parameters": {
        "separations": [
          {
            "description": "The recrystallization process begins with dissolving crude lysine in a suitable solvent, followed by cooling to allow lysine to crystallize while impurities remain dissolved. The crystalline lysine is separated from the solution via filtration or centrifugation.",
            "component": "Lysine",
            "extractionRate": 0.98
          },
          {
            "description": "Ion-exchange further purifies lysine by exchanging ions, effectively removing ionic impurities that may persist after recrystallization.",
            "component": "Lysine",
            "extractionRate": 0.98
          },
          {
            "description": "The purified lysine crystals are dried to achieve the necessary moisture content, preserving the crystal structure and ensuring stability during storage.",
            "component": "Lysine",
            "extractionRate": 0.98
          },
          {
            "description": "Final crystallization converts lysine into its desired crystalline form while ensuring high purity suitable for animal nutrition applications.",
            "component": "Lysine",
            "extractionRate": 0.98
          }
        ]
      },
      "additional_info": "The final product is packaged and stored under conditions that prevent degradation and maintain quality."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is a lignocellulosic biomass feedstock. It consists of a mixture of cellulose (35-40%), hemicellulose (25-30%), lignin (15-20%), ash (5-10%), and moisture (5-10%). The Raw Corn Stover is crucial for the subsequent pretreatment process, where it will undergo treatment to break down the cellulose and hemicellulose into fermentable sugars for lysine production.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which is a critical input for the Enzymatic Hydrolysis process. The Enzyme Solution contains cellulase and hemicellulase enzymes, which are essential for breaking down the pretreated biomass into fermentable sugars. The unit operation ensures a consistent and controlled supply of the enzyme solution, facilitating efficient enzymatic activity and maximizing sugar yield.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "bacterial culture source": {
      "unit_operation_id": "bacterial culture source",
      "name": "Bacterial Culture Source",
      "description": "This unit operation serves as a source for the Bacterial Culture stream, which consists of genetically engineered bacteria specifically designed to convert sugars into lysine under aerobic conditions. The Bacterial Culture is essential for the fermentation process, where it utilizes the sugar solution produced from enzymatic hydrolysis to synthesize lysine efficiently. This source ensures a consistent supply of active bacterial culture necessary for optimal fermentation performance.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Bacterial Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "nutrient solution source": {
      "unit_operation_id": "nutrient solution source",
      "name": "Nutrient Solution Source",
      "description": "This unit operation serves as a source for the Nutrient Solution, which is critical for supporting bacterial growth during the fermentation process. The Nutrient Solution contains a balanced mixture of essential nutrients required for optimal bacterial metabolism and lysine production. It is introduced into the fermentation unit operation to ensure that the bacterial culture has the necessary resources to efficiently convert sugars into lysine.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Nutrient Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "air supply": {
      "unit_operation_id": "air supply",
      "name": "Air Supply",
      "description": "This unit operation serves as a source for the Air stream, which supplies oxygen to maintain aerobic conditions in the bioreactor during the fermentation process. The Air stream is essential for the growth of aerobic bacteria, facilitating the conversion of sugars into lysine. It ensures that the fermentation environment is optimal for microbial activity, thereby enhancing the overall efficiency and yield of lysine production.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Air"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "solid waste sink": {
      "unit_operation_id": "solid waste sink",
      "name": "Solid Waste Sink",
      "description": "This unit operation serves as the final sink for the solid waste generated from the fermentation process. It collects solid residues, which primarily consist of bacterial biomass and lignin, after the broth separation and lysine recovery processes. The solid waste is typically disposed of or processed further for potential energy recovery or composting.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Solid Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "waste stream sink": {
      "unit_operation_id": "waste stream sink",
      "name": "Waste Stream Sink",
      "description": "The Waste Stream Sink is the final unit operation in the process flow that serves as the terminus for the Waste Stream. This stream contains impurities and unconverted sugars that are not utilized in the production of lysine. The Waste Stream Sink is designed to safely handle and dispose of these by-products, ensuring that they do not interfere with the overall efficiency and sustainability of the production process. Proper management of this stream is crucial for minimizing environmental impact and adhering to regulatory standards.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Waste Stream"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "purified lysine sink": {
      "unit_operation_id": "purified lysine sink",
      "name": "Purified Lysine Sink",
      "description": "This unit operation serves as the final sink for the purified lysine stream, which is produced in crystalline form with a purity of 98.5% or higher. It is designed to receive the purified lysine from the lysine purification process, ensuring that the product is stored and handled appropriately for subsequent packaging and distribution for animal nutrition applications.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Purified Lysine"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "water source": {
      "unit_operation_id": "water source",
      "name": "Water Source",
      "description": "This unit operation serves as a source for the Water stream, which is essential for the pretreatment process. Water is utilized to facilitate chemical reactions, assist in thermal processes, and aid in the separation of components during the conversion of Corn Stover into fermentable sugars. The Water stream is supplied at an industrial scale to meet the operational requirements of the pretreatment unit.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Water"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "chemical source": {
      "unit_operation_id": "chemical source",
      "name": "Chemical Source",
      "description": "This unit operation serves as a source for the Chemicals (e.g., Acid or Alkali) required in the pretreatment process of corn stover. Depending on the pretreatment method selected, it provides the necessary chemicals to effectively break down the lignocellulosic structure of the biomass, facilitating the conversion of cellulose and hemicellulose into fermentable sugars.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Chemicals (e.g., Acid or Alkali)"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "steam source": {
      "unit_operation_id": "steam source",
      "name": "Steam Source",
      "description": "This unit operation serves as a source for steam, which is essential in processes such as steam explosion. Steam is utilized to achieve the thermal breakdown of biomass structure, facilitating the pretreatment of feedstocks like corn stover. The steam is delivered in vapor form, ensuring effective penetration and reaction with the biomass.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Steam"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "wastewater sink": {
      "unit_operation_id": "wastewater sink",
      "name": "Wastewater Sink",
      "description": "This unit operation serves as the sink for the wastewater generated during the pretreatment process. The wastewater contains dissolved organics, lignin fragments, and residual chemicals used in the treatment. It is crucial to manage this stream effectively to minimize environmental impact and comply with regulatory standards. The wastewater may require further treatment or disposal before it can be released into the environment.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Wastewater"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Lignocellulosic biomass feedstock consisting of cellulose, hemicellulose, lignin, ash, and moisture.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with disrupted lignin structure and exposed cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulase and hemicellulase enzymes.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0,
        "Hemicellulase": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution rich in fermentable sugars, primarily glucose and xylose, with residual lignin.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin": 0
      }
    },
    "Bacterial Culture": {
      "name": "Bacterial Culture",
      "stream_id": "bacterial culture",
      "description": "Genetically engineered bacteria capable of converting sugars to lysine under aerobic conditions.",
      "stream_type": "core",
      "source": "bacterial culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Bacteria": 0
      }
    },
    "Nutrient Solution": {
      "name": "Nutrient Solution",
      "stream_id": "nutrient solution",
      "description": "A solution containing essential nutrients to support bacterial growth and lysine production.",
      "stream_type": "core",
      "source": "nutrient solution source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Nutrients": 0
      }
    },
    "Air": {
      "name": "Air",
      "stream_id": "air",
      "description": "Supplies oxygen to maintain aerobic conditions in the bioreactor.",
      "stream_type": "core",
      "source": "air supply",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Oxygen": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing lysine, unconverted sugars, bacterial biomass, and residual lignin.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "broth_separation",
      "flow_rate": 0.0,
      "components": {
        "Lysine": 0,
        "Unconverted Sugars": 0,
        "Bacterial Biomass": 0,
        "Lignin": 0
      }
    },
    "Clarified Broth": {
      "name": "Clarified Broth",
      "stream_id": "clarified broth",
      "description": "A liquid stream containing lysine and unconverted sugars, free of solids.",
      "stream_type": "core",
      "source": "broth_separation",
      "target": "lysine_recovery",
      "flow_rate": 0.0,
      "components": {
        "Lysine": 0,
        "Unconverted Sugars": 0
      }
    },
    "Solid Waste": {
      "name": "Solid Waste",
      "stream_id": "solid waste",
      "description": "Solid residues including bacterial biomass and lignin.",
      "stream_type": "core",
      "source": "broth_separation",
      "target": "solid waste sink",
      "flow_rate": 0.0,
      "components": {
        "Bacterial Biomass": 0,
        "Lignin": 0
      }
    },
    "Crude Lysine": {
      "name": "Crude Lysine",
      "stream_id": "crude lysine",
      "description": "A concentrated lysine product with impurities that require further purification.",
      "stream_type": "core",
      "source": "lysine_recovery",
      "target": "lysine_purification",
      "flow_rate": 0.0,
      "components": {
        "Lysine": 0
      }
    },
    "Waste Stream": {
      "name": "Waste Stream",
      "stream_id": "waste stream",
      "description": "A stream containing impurities and unconverted sugars.",
      "stream_type": "core",
      "source": "lysine_recovery",
      "target": "waste stream sink",
      "flow_rate": 0.0,
      "components": {
        "Unconverted Sugars": 0
      }
    },
    "Purified Lysine": {
      "name": "Purified Lysine",
      "stream_id": "purified lysine",
      "description": "High-purity lysine in crystalline form, suitable for feed-grade applications.",
      "stream_type": "core",
      "source": "lysine_purification",
      "target": "purified lysine sink",
      "flow_rate": 0.0,
      "components": {
        "Lysine": 0
      }
    },
    "Water": {
      "name": "Water",
      "stream_id": "water",
      "description": "Water is often used in pretreatment processes to facilitate chemical reactions, assist in thermal processes, and help in the separation of components.",
      "stream_type": "aux",
      "source": "water source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "H2O": 0
      }
    },
    "Chemicals (e.g., Acid or Alkali)": {
      "name": "Chemicals (e.g., Acid or Alkali)",
      "stream_id": "chemicals (e.g., acid or alkali)",
      "description": "Depending on the pretreatment method used (e.g., acid hydrolysis or alkaline treatment), specific chemicals are required to break down the lignocellulosic structure effectively.",
      "stream_type": "aux",
      "source": "chemical source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Acid or Alkali, depending on the method used": 0
      }
    },
    "Steam": {
      "name": "Steam",
      "stream_id": "steam",
      "description": "In processes like steam explosion, steam is a critical input to achieve the thermal breakdown of biomass structure.",
      "stream_type": "aux",
      "source": "steam source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "H2O (in vapor form)": 0
      }
    },
    "Wastewater": {
      "name": "Wastewater",
      "stream_id": "wastewater",
      "description": "The pretreatment process can generate wastewater containing dissolved organics, lignin fragments, and any residual chemicals used in the treatment.",
      "stream_type": "aux",
      "source": "pretreatment",
      "target": "wastewater sink",
      "flow_rate": 0.0,
      "components": {
        "Dissolved organics": 0,
        "Lignin fragments": 0,
        "Residual chemicals": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Ash": {
      "name": "Ash",
      "properties": {}
    },
    "Moisture": {
      "name": "Moisture",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Hemicellulase": {
      "name": "Hemicellulase",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Bacteria": {
      "name": "Bacteria",
      "properties": {}
    },
    "Nutrients": {
      "name": "Nutrients",
      "properties": {}
    },
    "Oxygen": {
      "name": "Oxygen",
      "properties": {}
    },
    "Lysine": {
      "name": "Lysine",
      "properties": {}
    },
    "Unconverted Sugars": {
      "name": "Unconverted Sugars",
      "properties": {}
    },
    "Bacterial Biomass": {
      "name": "Bacterial Biomass",
      "properties": {}
    },
    "H2O": {
      "name": "H2O",
      "properties": {}
    },
    "Acid or Alkali, depending on the method used": {
      "name": "Acid or Alkali, depending on the method used",
      "properties": {}
    },
    "H2O (in vapor form)": {
      "name": "H2O (in vapor form)",
      "properties": {}
    },
    "Dissolved organics": {
      "name": "Dissolved organics",
      "properties": {}
    },
    "Lignin fragments": {
      "name": "Lignin fragments",
      "properties": {}
    },
    "Residual chemicals": {
      "name": "Residual chemicals",
      "properties": {}
    }
  }
}