{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Primarily composed of cellulose (35-40%), hemicellulose (25-30%), and lignin (15-20%)",
      "key_specs": "Typically collected as agricultural residue; requires pre-treatment to break down lignocellulosic structure",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "C2H5OH, typically 99.5% purity for fuel-grade ethanol",
      "key_specs": "Fuel-grade ethanol with specifications meeting ASTM D4806; water content less than 1%",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "feedstock_handling_and_preparation": {
      "unit_operation_id": "feedstock_handling_and_preparation",
      "name": "Feedstock Handling and Preparation",
      "description": "Corn stover, an agricultural residue, is collected and transported to the processing facility. The stover is initially cleaned to remove dirt and debris. It is then mechanically processed to reduce particle size, enhancing the efficiency of subsequent pretreatment steps. This involves shredding or grinding the stover into smaller pieces, which increases the surface area for chemical reactions.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Prepared Corn Stover"
      ],
      "parameters": {},
      "additional_info": "Particle size reduction is crucial for efficient chemical penetration during pretreatment."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The prepared corn stover undergoes a pretreatment process to break down the lignocellulosic structure, making cellulose and hemicellulose more accessible for enzymatic hydrolysis. This is typically achieved using dilute acid or steam explosion methods, which help to solubilize hemicellulose and disrupt the lignin matrix.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Prepared Corn Stover",
        "Water/Acid or Steam"
      ],
      "output_streams": [
        "Pretreated Biomass"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "In the pretreatment unit operation, prepared corn stover undergoes treatment with water/acid or steam which results in the solubilization of hemicellulose, making it more accessible for later enzymatic hydrolysis.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Solubilized Hemicellulose",
            "conversionRate": 0.6
          }
        ]
      },
      "additional_info": "The choice of pretreatment method affects downstream processing efficiency and cost."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this step, enzymes are added to the pretreated biomass to hydrolyze cellulose and hemicellulose into fermentable sugars, primarily glucose and xylose. The enzymatic hydrolysis is conducted in a bioreactor, where optimal conditions are maintained to maximize sugar yield.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzymes"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The enzymatic hydrolysis of cellulose involves the action of cellulase enzymes, breaking down cellulose into glucose units.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.8
          },
          {
            "description": "The enzymatic hydrolysis of hemicellulose is facilitated by hemicellulase enzymes, converting solubilized hemicellulose into xylose and other sugars.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "Enzyme loading and reaction time are critical parameters influencing the hydrolysis efficiency."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The sugar solution is subjected to fermentation, where microorganisms such as yeast or engineered bacteria convert the sugars into ethanol. This process occurs in anaerobic conditions within a fermentation tank, where the microorganisms metabolize the sugars, producing ethanol and carbon dioxide as by-products.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Sugar Solution",
        "Microorganisms"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Fermentation of glucose into ethanol and carbon dioxide using microorganisms under anaerobic conditions.",
            "inputComponent": "Glucose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.95
          },
          {
            "description": "Fermentation of glucose into carbon dioxide as a by-product in the fermentation process.",
            "inputComponent": "Glucose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.05
          },
          {
            "description": "Fermentation of xylose into ethanol using specialized microorganisms during the fermentation process.",
            "inputComponent": "Xylose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.7
          },
          {
            "description": "Fermentation of xylose into carbon dioxide as a by-product using microorganisms during fermentation.",
            "inputComponent": "Xylose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.1
          }
        ]
      },
      "additional_info": "The choice of microorganism and fermentation conditions significantly impact ethanol yield and productivity."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "The fermentation broth is subjected to distillation to separate ethanol from the mixture. Distillation involves heating the broth to vaporize ethanol, which is then condensed into a concentrated form. This step is crucial for achieving the desired fuel-grade ethanol purity.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "The distillation process separates ethanol from fermentation broth by utilizing the differences in boiling points between ethanol and other components.",
            "component": "Ethanol",
            "extractionRate": 0.95
          },
          {
            "description": "Residual sugars and microbial biomass remain largely in the stillage after distillation, indicating minimal extraction into the crude ethanol stream.",
            "component": "Residual Sugars",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "Energy efficiency and heat integration are key considerations in the distillation process."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The crude ethanol undergoes dehydration to remove excess water and achieve the required fuel-grade purity. This is typically done using molecular sieves or azeotropic distillation, which selectively adsorb or separate water from ethanol.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Fuel-Grade Ethanol"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of water from crude ethanol using molecular sieves and azeotropic distillation.",
            "component": "Water",
            "extractionRate": 0.99
          },
          {
            "description": "Removal of trace impurities from crude ethanol during the dehydration process.",
            "component": "Trace Impurities",
            "extractionRate": 0.95
          }
        ]
      },
      "additional_info": "The final ethanol product must meet ASTM D4806 specifications, including water content less than 1%."
    },
    "waste_management_and_by-product_recovery": {
      "unit_operation_id": "waste_management_and_by-product_recovery",
      "name": "Waste Management and By-product Recovery",
      "description": "This unit operation involves handling and processing the by-products and waste streams generated throughout the process. Lignin residue and stillage can be used for energy recovery or as animal feed, while carbon dioxide from fermentation may be captured for industrial use or greenhouse gas mitigation.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Stillage",
        "Lignin Residue",
        "Carbon Dioxide"
      ],
      "output_streams": [
        "Recovered By-products"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of lignin from residuals for energy and additive applications.",
            "component": "Lignin",
            "extractionRate": 1.0
          },
          {
            "description": "Capture of carbon dioxide from fermentation for industrial use and greenhouse gas mitigation.",
            "component": "Carbon Dioxide",
            "extractionRate": 1.0
          }
        ]
      },
      "additional_info": "Efficient waste management and by-product utilization enhance the overall sustainability and economics of the process."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is collected agricultural residue primarily composed of cellulose (35-40%), hemicellulose (25-30%), and lignin (15-20%). It is typically gathered from agricultural fields post-harvest and requires subsequent handling and preparation to break down its lignocellulosic structure for further processing in the ethanol production pathway.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme source": {
      "unit_operation_id": "enzyme source",
      "name": "Enzyme Source",
      "description": "This unit operation serves as a source for the Enzymes stream, which consists of cellulase and hemicellulase. These enzymes are critical for the enzymatic hydrolysis process, where they catalyze the breakdown of cellulose and hemicellulose from pretreated biomass into fermentable sugars. The Enzyme Source ensures a consistent supply of these biocatalysts, which are essential for optimizing the efficiency of sugar production in the bioethanol process.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzymes"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "fuel_grade ethanol sink": {
      "unit_operation_id": "fuel_grade ethanol sink",
      "name": "Fuel-Grade Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Fuel-Grade Ethanol stream, which is a high-purity ethanol suitable for use as a biofuel. The sink collects and stores the ethanol produced from the dehydration process, ensuring that it meets the specifications for fuel-grade ethanol with a purity of 99.5% and a water content of less than 1%. This unit operation is critical for the final product quality assurance and inventory management in the biofuel production process.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Fuel-Grade Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "lignin residue source": {
      "unit_operation_id": "lignin residue source",
      "name": "Lignin Residue Source",
      "description": "This unit operation serves as a source for the Lignin Residue stream, which is the non-fermentable by-product remaining after the enzymatic hydrolysis of pretreated biomass. The Lignin Residue primarily consists of lignin, a complex organic polymer that provides structural support in plants. This stream is generated during the conversion of biomass to sugars and ethanol, and its management is crucial for maximizing overall process efficiency and sustainability. The Lignin Residue can be further processed for recovery of valuable by-products or utilized in waste management systems.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Lignin Residue"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "recovered by_products sink": {
      "unit_operation_id": "recovered by_products sink",
      "name": "Recovered By-products Sink",
      "description": "This unit operation serves as the terminus for the Recovered By-products stream, which includes valuable components such as lignin and carbon dioxide. The lignin can be utilized for energy production or as a feedstock in various applications, while the captured carbon dioxide can be used in industrial processes or for enhanced oil recovery. This sink ensures the proper management and utilization of these by-products, contributing to the overall sustainability and efficiency of the process.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Recovered By-products"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "water/acid or steam source": {
      "unit_operation_id": "water/acid or steam source",
      "name": "Water/Acid or Steam Source",
      "description": "This unit operation serves as a source for the Water/Acid or Steam stream, which includes the necessary pretreatment agents such as dilute acid or steam. These agents are essential for the pretreatment process, as they help to solubilize hemicellulose and disrupt the lignin matrix in the biomass feedstock, facilitating subsequent enzymatic hydrolysis and fermentation steps.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Water/Acid or Steam"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "microorganism source": {
      "unit_operation_id": "microorganism source",
      "name": "Microorganism Source",
      "description": "This unit operation serves as a source for microorganisms, specifically yeast and engineered bacteria, which are essential for the fermentation process. These microorganisms facilitate the conversion of sugars into ethanol and carbon dioxide during fermentation, playing a critical role in the production of fuel-grade ethanol from biomass.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Microorganisms"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "carbon dioxide source": {
      "unit_operation_id": "carbon dioxide source",
      "name": "Carbon Dioxide Source",
      "description": "This unit operation serves as a source for the Carbon Dioxide stream, which is generated as a by-product during the fermentation of sugars in the ethanol production process. The Carbon Dioxide produced can be captured and utilized in the Waste Management and By-product Recovery unit operation, contributing to the overall efficiency and sustainability of the process.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Carbon Dioxide"
      ],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Collected agricultural residue composed primarily of cellulose, hemicellulose, and lignin.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_handling_and_preparation",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Prepared Corn Stover": {
      "name": "Prepared Corn Stover",
      "stream_id": "prepared corn stover",
      "description": "Mechanically processed corn stover with reduced particle size, ready for pretreatment.",
      "stream_type": "core",
      "source": "feedstock_handling_and_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Corn stover with disrupted lignocellulosic structure, facilitating enzyme access to cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Solubilized Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Enzymes": {
      "name": "Enzymes",
      "stream_id": "enzymes",
      "description": "Cellulase and hemicellulase enzymes used to break down cellulose and hemicellulose into sugars.",
      "stream_type": "core",
      "source": "enzyme source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0,
        "Hemicellulase": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution containing fermentable sugars derived from cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin Residue": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture of ethanol, unconverted sugars, and microbial biomass.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Carbon Dioxide": 0,
        "Residual Sugars": 0,
        "Microbial Biomass": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "Concentrated ethanol with impurities, requiring further purification.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Water": 0,
        "Trace Impurities": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "Residue containing water, unconverted sugars, and microbial biomass.",
      "stream_type": "core",
      "source": "distillation",
      "target": "waste_management_and_by-product_recovery",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Residual Sugars": 0,
        "Microbial Biomass": 0
      }
    },
    "Fuel-Grade Ethanol": {
      "name": "Fuel-Grade Ethanol",
      "stream_id": "fuel_grade ethanol",
      "description": "High-purity ethanol suitable for use as a biofuel.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "fuel_grade ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Lignin Residue": {
      "name": "Lignin Residue",
      "stream_id": "lignin residue",
      "description": "Non-fermentable component remaining after enzymatic hydrolysis.",
      "stream_type": "core",
      "source": "lignin residue source",
      "target": "waste_management_and_by-product_recovery",
      "flow_rate": 0.0,
      "components": {
        "Lignin": 0
      }
    },
    "Recovered By-products": {
      "name": "Recovered By-products",
      "stream_id": "recovered by_products",
      "description": "Valuable by-products such as lignin for energy or feed, and captured carbon dioxide.",
      "stream_type": "core",
      "source": "waste_management_and_by-product_recovery",
      "target": "recovered by_products sink",
      "flow_rate": 0.0,
      "components": {
        "Lignin": 0,
        "Carbon Dioxide": 0
      }
    },
    "Water/Acid or Steam": {
      "name": "Water/Acid or Steam",
      "stream_id": "water/acid or steam",
      "description": "This stream includes the necessary pretreatment agents such as dilute acid or steam, which are essential for the pretreatment process to solubilize hemicellulose and disrupt the lignin matrix.",
      "stream_type": "aux",
      "source": "water/acid or steam source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Acid (if applicable)": 0
      }
    },
    "Microorganisms": {
      "name": "Microorganisms",
      "stream_id": "microorganisms",
      "description": "Microorganisms, such as yeast or engineered bacteria, are required for the fermentation process to convert sugars into ethanol and carbon dioxide.",
      "stream_type": "aux",
      "source": "microorganism source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Yeast": 0,
        "Engineered Bacteria": 0
      }
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "stream_id": "carbon dioxide",
      "description": "Carbon dioxide is a by-product from the fermentation process that can be captured and utilized in the waste management and by-product recovery unit operation.",
      "stream_type": "aux",
      "source": "carbon dioxide source",
      "target": "waste_management_and_by-product_recovery",
      "flow_rate": 0.0,
      "components": {
        "Carbon Dioxide": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Solubilized Hemicellulose": {
      "name": "Solubilized Hemicellulose",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Hemicellulase": {
      "name": "Hemicellulase",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Lignin Residue": {
      "name": "Lignin Residue",
      "properties": {}
    },
    "Ethanol": {
      "name": "Ethanol",
      "properties": {}
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "properties": {}
    },
    "Residual Sugars": {
      "name": "Residual Sugars",
      "properties": {}
    },
    "Microbial Biomass": {
      "name": "Microbial Biomass",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Trace Impurities": {
      "name": "Trace Impurities",
      "properties": {}
    },
    "Acid (if applicable)": {
      "name": "Acid (if applicable)",
      "properties": {}
    },
    "Yeast": {
      "name": "Yeast",
      "properties": {}
    },
    "Engineered Bacteria": {
      "name": "Engineered Bacteria",
      "properties": {}
    }
  }
}