{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Primarily composed of cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%)",
      "key_specs": "Corn stover is the non-grain part of the corn plant, including leaves, stalks, and cobs. It is typically collected post-harvest and may require pretreatment to break down lignocellulosic structure for fermentation.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "C2H5OH, typically 99.5% purity for fuel-grade ethanol",
      "key_specs": "Fuel-grade ethanol with a purity of 99.5% is required for blending with gasoline. It must meet ASTM D4806 specifications for ethanol used as a motor fuel.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover, which is the non-grain part of the corn plant, is collected post-harvest. This unit operation involves the mechanical processing of corn stover to reduce its size and increase its surface area, making it more amenable to subsequent chemical treatments. The stover is typically chopped or milled to a uniform particle size to facilitate efficient handling and processing in downstream operations.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Prepared Corn Stover"
      ],
      "parameters": {},
      "additional_info": "Particle size reduction is crucial for enhancing the efficiency of the pretreatment process."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The prepared corn stover undergoes a pretreatment process to break down the lignocellulosic structure. This step is essential to increase the accessibility of cellulose and hemicellulose for enzymatic hydrolysis. Common pretreatment methods include dilute acid, steam explosion, or alkaline treatment, which help in removing lignin and hemicellulose, thus exposing cellulose fibers.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Prepared Corn Stover",
        "Pretreatment Chemicals"
      ],
      "output_streams": [
        "Pretreated Biomass"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Removal or alteration of lignin to increase cellulose accessibility.",
            "component": "Lignin",
            "extractionRate": 0.5
          },
          {
            "description": "Partial hydrolysis of hemicellulose, facilitating subsequent enzymatic breakdown.",
            "component": "Hemicellulose",
            "extractionRate": 0.3
          }
        ]
      },
      "additional_info": "The choice of pretreatment method affects the efficiency of subsequent enzymatic hydrolysis and fermentation."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass is subjected to enzymatic hydrolysis. Specific enzymes, such as cellulases and hemicellulases, are added to convert cellulose and hemicellulose into fermentable sugars, primarily glucose and xylose. This process is critical for maximizing sugar yield, which directly impacts ethanol production efficiency.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Cellulase enzymes break down cellulose into glucose through enzymatic hydrolysis.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.8
          },
          {
            "description": "Hemicellulase enzymes act on hemicellulose to produce xylose and other sugars.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.85
          }
        ]
      },
      "additional_info": "Enzyme loading and reaction time are key factors influencing the hydrolysis efficiency and cost."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The sugar solution is fermented using yeast or other microorganisms to convert the sugars into ethanol and carbon dioxide. This biological process is the core of ethanol production, where the fermentable sugars are transformed into ethanol through metabolic pathways of the microorganisms.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Sugar Solution",
        "Microorganism Culture"
      ],
      "output_streams": [
        "Fermentation Broth",
        "Carbon Dioxide"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Conversion of glucose into ethanol and carbon dioxide by yeast through fermentation.",
            "inputComponent": "Glucose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.45
          },
          {
            "description": "Conversion of glucose into ethanol and carbon dioxide by yeast through fermentation.",
            "inputComponent": "Glucose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.45
          },
          {
            "description": "Fermentation of xylose into ethanol (and potentially carbon dioxide) by engineered yeast or other microorganisms.",
            "inputComponent": "Xylose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.35
          },
          {
            "description": "Partial conversion of xylose into carbon dioxide during fermentation processes.",
            "inputComponent": "Xylose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.35
          }
        ]
      },
      "additional_info": "Fermentation conditions such as temperature and pH are optimized to maximize ethanol yield."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "The fermentation broth is subjected to distillation to separate ethanol from water and other components. Distillation exploits the differences in boiling points to concentrate ethanol to the desired purity level. This step is crucial for producing fuel-grade ethanol that meets industry specifications.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of ethanol from the fermentation broth utilizing distillation based on boiling point differences.",
            "component": "Ethanol",
            "extractionRate": 0.9
          },
          {
            "description": "Separation of water that co-distills with ethanol due to azeotropic behavior.",
            "component": "Water",
            "extractionRate": 0.1
          },
          {
            "description": "Isolation of microbial biomass that remains in the liquid phase and is not vaporized during distillation.",
            "component": "Microbial Biomass",
            "extractionRate": 0.0
          }
        ]
      },
      "additional_info": "Multiple distillation columns may be used to achieve the desired ethanol purity."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The crude ethanol is further dehydrated to remove any remaining water, achieving the fuel-grade ethanol purity of 99.5%. This is typically done using molecular sieves or azeotropic distillation techniques. The removal of water is essential to meet the ASTM D4806 specifications for ethanol used as a motor fuel.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Fuel-Grade Ethanol",
        "Water"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of water from the crude ethanol stream using technologies such as molecular sieves or azeotropic distillation to produce fuel-grade ethanol.",
            "component": "Ethanol",
            "extractionRate": 0.005
          },
          {
            "description": "Removal of water from the crude ethanol stream to concentrate ethanol to meet fuel-grade specifications.",
            "component": "Water",
            "extractionRate": 0.995
          }
        ]
      },
      "additional_info": "The choice of dehydration method can impact the energy consumption and overall process economics."
    },
    "waste_management": {
      "unit_operation_id": "waste_management",
      "name": "Waste Management",
      "description": "This unit operation involves the treatment and disposal of waste streams generated throughout the process, including stillage and any residual biomass. Waste management is critical for minimizing environmental impact and complying with regulatory requirements. By-products may be processed for use as animal feed or for energy recovery.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [
        "Treated Waste"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of water from stillage for treatment and reuse.",
            "component": "Water",
            "extractionRate": 0.9
          },
          {
            "description": "Recovery of biomass from stillage for potential reuse or safe disposal.",
            "component": "Biomass",
            "extractionRate": 0.8
          }
        ]
      },
      "additional_info": "Efficient waste management can enhance the sustainability and economic viability of the ethanol production process."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is collected from the fields post-harvest. The stream consists of the non-grain parts of the corn plant, including leaves, stalks, and cobs. The composition primarily includes cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%). This feedstock is crucial for subsequent processing steps, requiring preparation and pretreatment to facilitate the conversion into ethanol.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which is a critical input stream for the enzymatic hydrolysis process. The Enzyme Solution contains cellulase and hemicellulase enzymes, which are essential for breaking down the polysaccharides in pretreated biomass into fermentable sugars. The enzymatic activity of these components is vital for optimizing the yield of sugars from the biomass, thereby facilitating efficient fermentation to produce ethanol.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "microorganism culture source": {
      "unit_operation_id": "microorganism culture source",
      "name": "Microorganism Culture Source",
      "description": "This unit operation serves as a source for the Microorganism Culture stream, which consists primarily of yeast. The Microorganism Culture is essential for the fermentation process, where yeast converts sugars into ethanol and carbon dioxide. The source ensures a consistent and viable supply of yeast, which is critical for achieving optimal fermentation efficiency and product yield.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Microorganism Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "fuel_grade ethanol sink": {
      "unit_operation_id": "fuel_grade ethanol sink",
      "name": "Fuel-Grade Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Fuel-Grade Ethanol stream, which is produced at a purity of 99.5%. The ethanol is collected here for storage and distribution, ensuring it meets the ASTM D4806 specifications for use as a motor fuel. This sink is critical for the efficient handling and transfer of the ethanol to blending facilities or for further processing.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Fuel-Grade Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "treated waste sink": {
      "unit_operation_id": "treated waste sink",
      "name": "Treated Waste Sink",
      "description": "This unit operation serves as the final sink for the treated waste stream generated from the Waste Management unit operation. It is designed to handle processed waste streams that are ready for disposal or potential reuse. The treated waste consists primarily of water and biomass, ensuring that any residual materials from the fermentation and distillation processes are managed effectively. The sink facilitates the safe and environmentally responsible disposal of waste, adhering to regulatory standards and promoting sustainability in the overall process.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Treated Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "pretreatment chemicals source": {
      "unit_operation_id": "pretreatment chemicals source",
      "name": "Pretreatment Chemicals Source",
      "description": "This unit operation serves as a source for the stream of pretreatment chemicals, which include dilute acid, steam, and alkaline agents. These chemicals are essential in the pretreatment process, as they facilitate the breakdown of lignin and hemicellulose, thereby exposing the cellulose fibers for subsequent enzymatic hydrolysis. The effective use of these chemicals enhances the overall efficiency of the biomass conversion process.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Pretreatment Chemicals"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "carbon dioxide sink": {
      "unit_operation_id": "carbon dioxide sink",
      "name": "Carbon Dioxide Sink",
      "description": "This unit operation serves as a sink for the carbon dioxide produced during the fermentation process. It captures and manages the carbon dioxide byproduct generated when sugars are converted into ethanol by microorganisms. The carbon dioxide can be either vented to the atmosphere, captured for further use, or processed for sequestration, depending on the environmental and economic considerations of the facility.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Carbon Dioxide"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "water sink": {
      "unit_operation_id": "water sink",
      "name": "Water Sink",
      "description": "This unit operation serves as a sink for the water removed during the dehydration process of crude ethanol. It collects the water byproduct generated to achieve the required fuel-grade ethanol purity. The water may be directed to waste management or treatment processes for further processing or disposal.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Water"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Corn stover collected from the fields, consisting of leaves, stalks, and cobs.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Prepared Corn Stover": {
      "name": "Prepared Corn Stover",
      "stream_id": "prepared corn stover",
      "description": "Size-reduced corn stover with increased surface area for better chemical processing.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with disrupted lignocellulosic structure, making cellulose and hemicellulose more accessible.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulase and hemicellulase enzymes.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0,
        "Hemicellulase": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution rich in fermentable sugars, primarily glucose and xylose, ready for fermentation.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0
      }
    },
    "Microorganism Culture": {
      "name": "Microorganism Culture",
      "stream_id": "microorganism culture",
      "description": "Yeast or other microorganisms used for fermentation.",
      "stream_type": "core",
      "source": "microorganism culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Yeast": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, unfermented sugars, and microbial biomass.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Water": 0,
        "Microbial Biomass": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "Ethanol concentrated to a high purity level, but not yet fuel-grade.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Water": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "Residue from distillation containing water, unfermented sugars, and biomass.",
      "stream_type": "core",
      "source": "distillation",
      "target": "waste_management",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Microbial Biomass": 0
      }
    },
    "Fuel-Grade Ethanol": {
      "name": "Fuel-Grade Ethanol",
      "stream_id": "fuel_grade ethanol",
      "description": "Ethanol with 99.5% purity suitable for blending with gasoline.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "fuel_grade ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Treated Waste": {
      "name": "Treated Waste",
      "stream_id": "treated waste",
      "description": "Processed waste streams ready for disposal or reuse.",
      "stream_type": "core",
      "source": "waste_management",
      "target": "treated waste sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Biomass": 0
      }
    },
    "Pretreatment Chemicals": {
      "name": "Pretreatment Chemicals",
      "stream_id": "pretreatment chemicals",
      "description": "Chemicals used in the pretreatment process, such as dilute acid, steam, or alkaline agents, which facilitate the breakdown of lignin and hemicellulose and expose cellulose fibers for subsequent enzymatic hydrolysis.",
      "stream_type": "aux",
      "source": "pretreatment chemicals source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Acid": 0,
        "Steam": 0,
        "Alkaline Agents": 0
      }
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "stream_id": "carbon dioxide",
      "description": "Byproduct of the fermentation process where sugars are converted into ethanol and carbon dioxide by the microorganisms.",
      "stream_type": "aux",
      "source": "fermentation",
      "target": "carbon dioxide sink",
      "flow_rate": 0.0,
      "components": {
        "Carbon Dioxide": 0
      }
    },
    "Water": {
      "name": "Water",
      "stream_id": "water",
      "description": "Water removed from the crude ethanol during the dehydration process to achieve the required fuel-grade ethanol purity.",
      "stream_type": "aux",
      "source": "dehydration",
      "target": "water sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Hemicellulase": {
      "name": "Hemicellulase",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Yeast": {
      "name": "Yeast",
      "properties": {}
    },
    "Ethanol": {
      "name": "Ethanol",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Microbial Biomass": {
      "name": "Microbial Biomass",
      "properties": {}
    },
    "Biomass": {
      "name": "Biomass",
      "properties": {}
    },
    "Acid": {
      "name": "Acid",
      "properties": {}
    },
    "Steam": {
      "name": "Steam",
      "properties": {}
    },
    "Alkaline Agents": {
      "name": "Alkaline Agents",
      "properties": {}
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "properties": {}
    }
  }
}