{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Primarily composed of cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%)",
      "key_specs": "Corn stover is the non-grain part of the corn plant, including leaves, stalks, and cobs. It is typically collected post-harvest and may require pretreatment to break down lignocellulosic structure.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "C2H5OH with typical purity of 99.5% for fuel-grade ethanol",
      "key_specs": "Fuel-grade ethanol must meet ASTM D4806 standards, which include specifications for purity, water content, and denaturant levels. It is used as a biofuel additive for gasoline.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover is collected from agricultural fields post-harvest. It is then transported to the processing facility where it undergoes size reduction to increase the surface area for subsequent processing steps. This is typically achieved using mechanical milling or grinding equipment. The reduced particle size facilitates more efficient chemical reactions and enzymatic hydrolysis in later stages.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Prepared Corn Stover"
      ],
      "parameters": {},
      "additional_info": "Particle size reduction is crucial for enhancing the efficiency of the pretreatment and hydrolysis steps."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The prepared corn stover undergoes a pretreatment process to break down the lignocellulosic structure, making the cellulose and hemicellulose more accessible for enzymatic hydrolysis. This is typically achieved using dilute acid pretreatment, where the biomass is treated with a dilute acid solution under controlled conditions. The pretreatment helps to solubilize hemicellulose and disrupt the lignin structure.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Prepared Corn Stover",
        "Dilute Acid Solution"
      ],
      "output_streams": [
        "Pretreated Biomass",
        "Acid-Containing Effluent"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Partial solubilization of hemicellulose into C5 sugars and similar water-soluble components, transported from prepared corn stover to form solubilized hemicellulose.",
            "component": "Hemicellulose",
            "extractionRate": 0.6
          },
          {
            "description": "Cellulose remains predominantly unchanged but is made more accessible for subsequent enzymatic hydrolysis.",
            "component": "Cellulose",
            "extractionRate": 0.0
          },
          {
            "description": "Lignin's structure is disrupted to facilitate later processing, but remains largely unchanged.",
            "component": "Lignin",
            "extractionRate": 0.0
          }
        ]
      },
      "additional_info": "The choice of acid and operating conditions are critical for maximizing sugar yield while minimizing degradation products."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "The pretreated biomass is subjected to enzymatic hydrolysis, where specific enzymes are added to convert cellulose and hemicellulose into fermentable sugars. Enzymes such as cellulases and hemicellulases are used to catalyze the breakdown of polysaccharides into monosaccharides like glucose and xylose.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Hydrolysis of cellulose into glucose using cellulases.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.85
          },
          {
            "description": "Breakdown of solubilized hemicellulose into xylose using hemicellulases.",
            "inputComponent": "Solubilized Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.75
          }
        ]
      },
      "additional_info": "Enzyme loading and reaction time are optimized to maximize sugar yield and minimize enzyme costs."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The sugar solution is fermented using a microorganism, typically yeast, to convert the fermentable sugars into ethanol. The fermentation process is carried out in bioreactors under anaerobic conditions. The yeast metabolizes the sugars, producing ethanol and carbon dioxide as by-products.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Sugar Solution",
        "Yeast Culture"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Yeast converts glucose into ethanol and carbon dioxide through fermentation under anaerobic conditions.",
            "inputComponent": "Glucose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.85
          },
          {
            "description": "Yeast converts glucose into ethanol and carbon dioxide through fermentation under anaerobic conditions.",
            "inputComponent": "Glucose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.85
          },
          {
            "description": "Yeast converts xylose into ethanol and carbon dioxide, although with lower efficiency than glucose fermentation.",
            "inputComponent": "Xylose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.5
          },
          {
            "description": "Yeast converts xylose into ethanol and carbon dioxide, although less efficiently compared to glucose fermentation.",
            "inputComponent": "Xylose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.5
          }
        ]
      },
      "additional_info": "The choice of yeast strain and fermentation conditions are optimized for high ethanol yield and productivity."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "The fermentation broth is subjected to distillation to separate ethanol from the mixture. Distillation involves heating the broth to vaporize ethanol, which is then condensed to obtain a concentrated ethanol stream. This step is crucial for achieving the desired purity of fuel-grade ethanol.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Distillation process is used to separate ethanol from fermentation broth based on boiling point differences.",
            "component": "Ethanol",
            "extractionRate": 0.95
          },
          {
            "description": "Yeast remains largely in the liquid phase during distillation as it has a higher boiling point than ethanol, thus being mostly left in stillage.",
            "component": "Yeast",
            "extractionRate": 0.01
          },
          {
            "description": "Residual sugars are also largely retained in the liquid phase during distillation, resulting in a low extraction rate into crude ethanol.",
            "component": "Residual Sugars",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "Multiple distillation columns may be used to achieve the required ethanol purity."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The crude ethanol is further dehydrated to remove any remaining water, achieving the high purity required for fuel-grade ethanol. This is typically done using molecular sieves or azeotropic distillation techniques to achieve ethanol purity of 99.5%.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Fuel-Grade Ethanol"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Removing water from crude ethanol to produce fuel-grade ethanol.",
            "component": "Water",
            "extractionRate": 0.995
          }
        ]
      },
      "additional_info": "Molecular sieves are often preferred for their efficiency in removing water to achieve high ethanol purity."
    },
    "waste_management": {
      "unit_operation_id": "waste_management",
      "name": "Waste Management",
      "description": "The stillage and other waste streams from the process are managed and treated to minimize environmental impact. This may involve anaerobic digestion to produce biogas, which can be used as a renewable energy source, or other treatment methods to recover valuable by-products or ensure safe disposal.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [
        "Treated Waste"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Microorganisms convert residual sugars from stillage into biogas, primarily methane.",
            "inputComponent": "Residual Sugars",
            "outputComponent": "Biogas",
            "conversionRate": 0.85
          },
          {
            "description": "Yeast cells present in the stillage are broken down by microorganisms, leading to the production of biogas and water.",
            "inputComponent": "Yeast",
            "outputComponent": "Biogas",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "Waste management strategies are crucial for improving the sustainability and economic viability of the ethanol production process."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the 'Raw Corn Stover' stream, which is collected post-harvest from corn plants. The stream consists of the non-grain parts of the corn plant, including leaves, stalks, and cobs. The composition of the stream primarily includes cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%). This feedstock is essential for subsequent processing steps in the production of ethanol and may require pretreatment to break down its lignocellulosic structure for efficient conversion.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "dilute acid solution source": {
      "unit_operation_id": "dilute acid solution source",
      "name": "Dilute Acid Solution Source",
      "description": "This unit operation serves as a source for the Dilute Acid Solution, which is utilized in the pretreatment phase of the biomass conversion process. The solution is crucial for facilitating the breakdown of the lignocellulosic structure of the biomass, enhancing the efficiency of subsequent enzymatic hydrolysis. The Dilute Acid Solution is composed primarily of acid and water, and is prepared to specific concentrations to optimize the pretreatment process.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Dilute Acid Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which contains a mixture of cellulases and hemicellulases. These enzymes are crucial for the enzymatic hydrolysis process, where they break down polysaccharides into fermentable sugars. The Enzyme Solution is prepared and supplied to the enzymatic hydrolysis unit operation, ensuring a consistent and optimal concentration of enzymes for efficient conversion of pretreated biomass.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "yeast culture source": {
      "unit_operation_id": "yeast culture source",
      "name": "Yeast Culture Source",
      "description": "This unit operation serves as the source for the Yeast Culture stream, which contains a concentrated culture of yeast necessary for the fermentation process. The Yeast Culture is critical for converting sugars into ethanol during the fermentation stage of the process flow. It is prepared under controlled conditions to ensure high viability and activity of the yeast, which is essential for maximizing ethanol production.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Yeast Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "fuel_grade ethanol sink": {
      "unit_operation_id": "fuel_grade ethanol sink",
      "name": "Fuel-Grade Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Fuel-Grade Ethanol stream, which is produced through a series of biochemical processes including fermentation and distillation. The sink is designed to receive the high-purity ethanol, ensuring it meets the required specifications for fuel-grade ethanol, primarily for use as a biofuel additive. The unit operation ensures proper handling, storage, and potential distribution of the ethanol, maintaining its quality and integrity for end-use applications.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Fuel-Grade Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "treated waste sink": {
      "unit_operation_id": "treated waste sink",
      "name": "Treated Waste Sink",
      "description": "This unit operation serves as the final sink for the treated waste stream generated from the Waste Management unit operation. The Treated Waste consists of biogas and water, which are either safely disposed of or utilized for further applications. The unit ensures that all waste materials are handled in compliance with environmental regulations, minimizing any potential impact on the surrounding ecosystem.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Treated Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "acid_containing effluent sink": {
      "unit_operation_id": "acid_containing effluent sink",
      "name": "Acid-Containing Effluent Sink",
      "description": "This unit operation serves as a sink for the Acid-Containing Effluent stream generated during the pretreatment process. The Acid-Containing Effluent consists of excess acid, water, and solubilized hemicellulose, which are byproducts of the pretreatment stage. This sink is designed to safely collect and manage the effluent, ensuring that the acidic components are neutralized or treated before disposal or further processing, thereby minimizing environmental impact and adhering to regulatory standards.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Acid-Containing Effluent"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Collected corn stover consisting of leaves, stalks, and cobs.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Prepared Corn Stover": {
      "name": "Prepared Corn Stover",
      "stream_id": "prepared corn stover",
      "description": "Corn stover that has been mechanically processed to reduce particle size.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Dilute Acid Solution": {
      "name": "Dilute Acid Solution",
      "stream_id": "dilute acid solution",
      "description": "An acid solution used to facilitate the breakdown of lignocellulosic structure.",
      "stream_type": "core",
      "source": "dilute acid solution source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Acid": 0,
        "Water": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with disrupted lignocellulosic structure, making cellulose and hemicellulose more accessible.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Solubilized Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulases and hemicellulases for hydrolyzing polysaccharides.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulases": 0,
        "Hemicellulases": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution rich in fermentable sugars derived from cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin": 0
      }
    },
    "Yeast Culture": {
      "name": "Yeast Culture",
      "stream_id": "yeast culture",
      "description": "A culture of yeast used to ferment sugars into ethanol.",
      "stream_type": "core",
      "source": "yeast culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Yeast": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, unfermented sugars, yeast cells, and by-products.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Carbon Dioxide": 0,
        "Yeast": 0,
        "Residual Sugars": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "A concentrated ethanol stream obtained from distillation.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "The residual liquid containing water, unfermented sugars, and yeast cells.",
      "stream_type": "core",
      "source": "distillation",
      "target": "waste_management",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Residual Sugars": 0,
        "Yeast": 0
      }
    },
    "Fuel-Grade Ethanol": {
      "name": "Fuel-Grade Ethanol",
      "stream_id": "fuel_grade ethanol",
      "description": "High-purity ethanol suitable for use as a biofuel additive.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "fuel_grade ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Treated Waste": {
      "name": "Treated Waste",
      "stream_id": "treated waste",
      "description": "Processed waste streams that are safely disposed of or utilized.",
      "stream_type": "core",
      "source": "waste_management",
      "target": "treated waste sink",
      "flow_rate": 0.0,
      "components": {
        "Biogas": 0,
        "Water": 0
      }
    },
    "Acid-Containing Effluent": {
      "name": "Acid-Containing Effluent",
      "stream_id": "acid_containing effluent",
      "description": "This stream would likely contain excess acid, water, and solubilized components that are washed away or separated during or after the pretreatment process.",
      "stream_type": "aux",
      "source": "pretreatment",
      "target": "acid_containing effluent sink",
      "flow_rate": 0.0,
      "components": {
        "Acid": 0,
        "Water": 0,
        "Solubilized Hemicellulose": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Acid": {
      "name": "Acid",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Solubilized Hemicellulose": {
      "name": "Solubilized Hemicellulose",
      "properties": {}
    },
    "Cellulases": {
      "name": "Cellulases",
      "properties": {}
    },
    "Hemicellulases": {
      "name": "Hemicellulases",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Yeast": {
      "name": "Yeast",
      "properties": {}
    },
    "Ethanol": {
      "name": "Ethanol",
      "properties": {}
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "properties": {}
    },
    "Residual Sugars": {
      "name": "Residual Sugars",
      "properties": {}
    },
    "Biogas": {
      "name": "Biogas",
      "properties": {}
    }
  }
}