{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Primarily composed of cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%)",
      "key_specs": "Corn stover is an agricultural residue consisting of the leaves, stalks, and cobs of maize plants. It is typically dry and fibrous, requiring pretreatment to enhance enzymatic accessibility.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Gluconic Acid",
      "composition": "C6H12O7",
      "key_specs": "Gluconic acid is typically produced with a purity of over 99% for industrial applications. It is used in food, pharmaceuticals, and as a cleaning agent. The product should meet commercial grade specifications for purity and stability.",
      "volumetric_scale": "50,000 metric tons per year"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover, an agricultural residue primarily composed of cellulose, hemicellulose, and lignin, is first collected and transported to the processing facility. Here, it undergoes size reduction through mechanical milling to increase the surface area, which is crucial for the subsequent pretreatment process. The milled corn stover is then dried to reduce moisture content, ensuring optimal conditions for the pretreatment stage.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Prepared Corn Stover"
      ],
      "parameters": {},
      "additional_info": "Size reduction is typically achieved using hammer mills or knife mills. Moisture content is reduced to below 10%."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The prepared corn stover is subjected to a pretreatment process to break down the lignin structure and enhance the accessibility of cellulose and hemicellulose for enzymatic hydrolysis. This is typically achieved using a dilute acid or alkaline solution, which helps in solubilizing hemicellulose and partially removing lignin.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Prepared Corn Stover",
        "Pretreatment Chemicals"
      ],
      "output_streams": [
        "Pretreated Biomass",
        "Lignin-rich Residue"
      ],
      "parameters": {
        "separations": [
          {
            "description": "The separation of lignin from the corn stover during pretreatment, yielding a lignin-rich residue.",
            "component": "lignin",
            "extractionRate": 0.6
          },
          {
            "description": "The solubilization and removal of hemicellulose from the corn stover, contributing to the production of pretreatment biomass.",
            "component": "hemicellulose",
            "extractionRate": 0.4
          }
        ]
      },
      "additional_info": "The choice of pretreatment method affects downstream processing efficiency and cost. Acid pretreatment is common but requires neutralization."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "The pretreated biomass is subjected to enzymatic hydrolysis, where cellulase and hemicellulase enzymes are added to convert cellulose and hemicellulose into fermentable sugars, primarily glucose. This step is crucial for maximizing sugar yield, which directly impacts the efficiency of the subsequent fermentation process.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Hydrolysate"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Enzymatic hydrolysis of cellulose into glucose using cellulase enzymes.",
            "inputComponent": "cellulose",
            "outputComponent": "glucose",
            "conversionRate": 0.85
          },
          {
            "description": "Enzymatic hydrolysis of hemicellulose into xylose using hemicellulase enzymes.",
            "inputComponent": "hemicellulose",
            "outputComponent": "xylose",
            "conversionRate": 0.75
          }
        ]
      },
      "additional_info": "Enzyme loading and hydrolysis time are critical parameters that influence sugar yield and process economics."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The hydrolysate containing fermentable sugars is inoculated with a microorganism capable of converting glucose into gluconic acid. This biotransformation occurs under controlled conditions to optimize the yield and purity of gluconic acid. The fermentation process is monitored to ensure efficient conversion and minimal by-product formation.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Hydrolysate",
        "Microbial Culture"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The bioconversion of glucose into gluconic acid through fermentation using a microbial culture.",
            "inputComponent": "glucose",
            "outputComponent": "gluconic acid",
            "conversionRate": 0.7
          },
          {
            "description": "Residual sugars remain unconverted after fermentation, specifically resulting from xylose not being utilized by *Aspergillus niger*.",
            "inputComponent": "xylose",
            "outputComponent": "residual sugars",
            "conversionRate": 0.95
          },
          {
            "description": "A portion of glucose is utilized for the growth and reproduction of the microbial culture, leading to biomass generation.",
            "inputComponent": "glucose",
            "outputComponent": "biomass",
            "conversionRate": 0.1
          }
        ]
      },
      "additional_info": "Aspergillus niger is commonly used for gluconic acid production. Oxygen supply and pH control are critical for optimal fermentation."
    },
    "product_recovery": {
      "unit_operation_id": "product_recovery",
      "name": "Product Recovery",
      "description": "The fermentation broth is processed to recover gluconic acid. This involves separation techniques such as filtration to remove microbial biomass, followed by purification steps like ion exchange or crystallization to achieve the desired purity level of gluconic acid. The goal is to produce a high-purity product suitable for industrial applications.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Gluconic Acid",
        "Waste Biomass",
        "Filtrate"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Filtration process to separate solid biomass from liquid fermentation broth, retrieving crude gluconic acid.",
            "component": "gluconic acid",
            "extractionRate": 0.9
          },
          {
            "description": "Purification of liquid stream to remove residual sugars and other organic acids, improving gluconic acid purity.",
            "component": "residual sugars",
            "extractionRate": 0.1
          },
          {
            "description": "Complete separation of microbial biomass during filtration, intended to be removed from the final gluconic acid product.",
            "component": "biomass",
            "extractionRate": 0.0
          }
        ]
      },
      "additional_info": "Purification steps are designed to meet commercial grade specifications for gluconic acid purity and stability."
    },
    "final_purification_and_drying": {
      "unit_operation_id": "final_purification_and_drying",
      "name": "Final Purification and Drying",
      "description": "The crude gluconic acid undergoes final purification to remove any remaining impurities and achieve over 99% purity. This is followed by drying to produce a stable, solid form of gluconic acid suitable for packaging and distribution. The final product is tested to ensure it meets all commercial specifications.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Gluconic Acid"
      ],
      "output_streams": [
        "Pure Gluconic Acid"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Removal of impurities from crude gluconic acid solution using techniques such as filtration, ion exchange, or solvent extraction.",
            "component": "impurities",
            "extractionRate": 0.99
          },
          {
            "description": "Drying of the purified gluconic acid solution to form solid gluconic acid, ensuring stability and ease of handling.",
            "component": "water",
            "extractionRate": 0.95
          }
        ]
      },
      "additional_info": "The final product is typically in crystalline form and packaged for distribution. Quality control tests ensure compliance with industry standards."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is collected agricultural residue from maize plants. The stream consists of leaves, stalks, and cobs, primarily composed of cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%). This fibrous material is typically dry and requires subsequent processing steps, such as feedstock preparation and pretreatment, to enhance its enzymatic accessibility for further conversion into valuable products.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "pretreatment chemicals source": {
      "unit_operation_id": "pretreatment chemicals source",
      "name": "Pretreatment Chemicals Source",
      "description": "This unit operation serves as a source for the Pretreatment Chemicals stream, which consists of chemical agents such as dilute acid and alkaline solution. These chemicals are essential for the pretreatment process, facilitating the breakdown of lignin and hemicellulose in the biomass, thereby enhancing the accessibility of cellulose for subsequent enzymatic hydrolysis. The operation ensures a consistent supply of these chemicals to maintain the efficiency and effectiveness of the pretreatment stage in the overall process flow.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Pretreatment Chemicals"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which contains cellulase and hemicellulase enzymes essential for the enzymatic hydrolysis of pretreated biomass. The Enzyme Solution is critical for breaking down cellulose and hemicellulose into fermentable sugars, facilitating the subsequent fermentation process to produce gluconic acid. The unit operation ensures a consistent supply of the enzyme solution at the required concentration and volume for optimal hydrolysis performance.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "microbial culture source": {
      "unit_operation_id": "microbial culture source",
      "name": "Microbial Culture Source",
      "description": "This unit operation serves as a source for the Microbial Culture stream, which consists of microorganisms, primarily Aspergillus niger and other microbes. These microorganisms are essential for the fermentation process, where they convert glucose derived from hydrolysate into gluconic acid. The Microbial Culture is maintained under optimal conditions to ensure high viability and activity, contributing to efficient gluconic acid production.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Microbial Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "pure gluconic acid sink": {
      "unit_operation_id": "pure gluconic acid sink",
      "name": "Pure Gluconic Acid Sink",
      "description": "This unit operation serves as the final sink for the Pure Gluconic Acid stream, which consists of high-purity gluconic acid suitable for various industrial applications. The unit operation ensures that the product meets the required specifications for purity and stability, effectively terminating the process flow and allowing for the storage or distribution of the final product.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Pure Gluconic Acid"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "lignin_rich residue sink": {
      "unit_operation_id": "lignin_rich residue sink",
      "name": "Lignin-rich Residue Sink",
      "description": "This unit operation serves as a sink for the lignin-rich residue generated during the pretreatment process of biomass. The lignin-rich residue consists primarily of lignin, solubilized hemicellulose, and other solubilized organics. It is typically separated from the pretreated biomass and can be utilized for energy recovery or other applications, such as bio-material production or as a feedstock for further chemical processes. This sink ensures the efficient handling and potential valorization of the lignin-rich by-product.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Lignin-rich Residue"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "waste biomass sink": {
      "unit_operation_id": "waste biomass sink",
      "name": "Waste Biomass Sink",
      "description": "This unit operation serves as the final sink for the Waste Biomass stream, which is a solid waste stream generated during the product recovery process. It consists primarily of residual microbial biomass and insoluble impurities that are separated during the initial filtration step. The Waste Biomass Sink is designed to collect and manage this waste stream, ensuring proper disposal or potential further processing for energy recovery or other applications.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Waste Biomass"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "filtrate sink": {
      "unit_operation_id": "filtrate sink",
      "name": "Filtrate Sink",
      "description": "The Filtrate Sink serves as the final unit operation for the filtrate stream, which is a liquid waste stream generated during the purification of gluconic acid. This stream contains residual sugars, other organic acids, water, and salts that are removed during purification steps such as ion exchange or crystallization. The Filtrate Sink is designed to collect and manage this waste stream, ensuring that it is properly treated or disposed of in accordance with environmental regulations.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Filtrate"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Collected corn stover consisting of leaves, stalks, and cobs.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "lignin": 0
      }
    },
    "Prepared Corn Stover": {
      "name": "Prepared Corn Stover",
      "stream_id": "prepared corn stover",
      "description": "Milled and dried corn stover with increased surface area and reduced moisture content.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "lignin": 0
      }
    },
    "Pretreatment Chemicals": {
      "name": "Pretreatment Chemicals",
      "stream_id": "pretreatment chemicals",
      "description": "Chemical agents used to facilitate the breakdown of lignin and hemicellulose.",
      "stream_type": "core",
      "source": "pretreatment chemicals source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "dilute acid": 0,
        "alkaline solution": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with reduced lignin content and increased cellulose and hemicellulose accessibility.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "lignin": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulase and hemicellulase enzymes.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "cellulase": 0,
        "hemicellulase": 0
      }
    },
    "Hydrolysate": {
      "name": "Hydrolysate",
      "stream_id": "hydrolysate",
      "description": "A liquid stream rich in fermentable sugars, primarily glucose, derived from the enzymatic breakdown of cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "glucose": 0,
        "xylose": 0,
        "other sugars": 0
      }
    },
    "Microbial Culture": {
      "name": "Microbial Culture",
      "stream_id": "microbial culture",
      "description": "Microorganisms used for the conversion of glucose to gluconic acid.",
      "stream_type": "core",
      "source": "microbial culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Aspergillus niger": 0,
        "other microbes": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing gluconic acid, residual sugars, and microbial biomass.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "product_recovery",
      "flow_rate": 0.0,
      "components": {
        "gluconic acid": 0,
        "residual sugars": 0,
        "biomass": 0
      }
    },
    "Crude Gluconic Acid": {
      "name": "Crude Gluconic Acid",
      "stream_id": "crude gluconic acid",
      "description": "Partially purified gluconic acid with some impurities.",
      "stream_type": "core",
      "source": "product_recovery",
      "target": "final_purification_and_drying",
      "flow_rate": 0.0,
      "components": {
        "gluconic acid": 0,
        "impurities": 0
      }
    },
    "Pure Gluconic Acid": {
      "name": "Pure Gluconic Acid",
      "stream_id": "pure gluconic acid",
      "description": "High-purity gluconic acid suitable for industrial applications.",
      "stream_type": "core",
      "source": "final_purification_and_drying",
      "target": "pure gluconic acid sink",
      "flow_rate": 0.0,
      "components": {
        "gluconic acid": 0
      }
    },
    "Lignin-rich Residue": {
      "name": "Lignin-rich Residue",
      "stream_id": "lignin_rich residue",
      "description": "During the pretreatment process, a portion of the lignin, as well as some solubilized hemicellulose, is often removed from the biomass. This lignin-rich residue is typically separated from the pretreated biomass and can be used for energy recovery or other applications.",
      "stream_type": "aux",
      "source": "pretreatment",
      "target": "lignin_rich residue sink",
      "flow_rate": 0.0,
      "components": {
        "lignin": 0,
        "solubilized hemicellulose": 0,
        "other solubilized organics": 0
      }
    },
    "Waste Biomass": {
      "name": "Waste Biomass",
      "stream_id": "waste biomass",
      "description": "Solid waste stream composed primarily of residual microbial biomass and any other insoluble impurities that are separated during the initial filtration step of the product recovery process.",
      "stream_type": "aux",
      "source": "product_recovery",
      "target": "waste biomass sink",
      "flow_rate": 0.0,
      "components": {
        "residual microbes": 0,
        "insoluble impurities": 0
      }
    },
    "Filtrate": {
      "name": "Filtrate",
      "stream_id": "filtrate",
      "description": "Liquid waste stream containing impurities and by-products that are not gluconic acid, removed during purification steps such as ion exchange or crystallization.",
      "stream_type": "aux",
      "source": "product_recovery",
      "target": "filtrate sink",
      "flow_rate": 0.0,
      "components": {
        "residual sugars": 0,
        "other organic acids": 0,
        "water": 0,
        "salts": 0
      }
    }
  },
  "components": {
    "cellulose": {
      "name": "cellulose",
      "properties": {}
    },
    "hemicellulose": {
      "name": "hemicellulose",
      "properties": {}
    },
    "lignin": {
      "name": "lignin",
      "properties": {}
    },
    "dilute acid": {
      "name": "dilute acid",
      "properties": {}
    },
    "alkaline solution": {
      "name": "alkaline solution",
      "properties": {}
    },
    "cellulase": {
      "name": "cellulase",
      "properties": {}
    },
    "hemicellulase": {
      "name": "hemicellulase",
      "properties": {}
    },
    "glucose": {
      "name": "glucose",
      "properties": {}
    },
    "xylose": {
      "name": "xylose",
      "properties": {}
    },
    "other sugars": {
      "name": "other sugars",
      "properties": {}
    },
    "Aspergillus niger": {
      "name": "Aspergillus niger",
      "properties": {}
    },
    "other microbes": {
      "name": "other microbes",
      "properties": {}
    },
    "gluconic acid": {
      "name": "gluconic acid",
      "properties": {}
    },
    "residual sugars": {
      "name": "residual sugars",
      "properties": {}
    },
    "biomass": {
      "name": "biomass",
      "properties": {}
    },
    "impurities": {
      "name": "impurities",
      "properties": {}
    },
    "solubilized hemicellulose": {
      "name": "solubilized hemicellulose",
      "properties": {}
    },
    "other solubilized organics": {
      "name": "other solubilized organics",
      "properties": {}
    },
    "residual microbes": {
      "name": "residual microbes",
      "properties": {}
    },
    "insoluble impurities": {
      "name": "insoluble impurities",
      "properties": {}
    },
    "other organic acids": {
      "name": "other organic acids",
      "properties": {}
    },
    "water": {
      "name": "water",
      "properties": {}
    },
    "salts": {
      "name": "salts",
      "properties": {}
    }
  }
}