{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Primarily composed of cellulose (35-40%), hemicellulose (25-30%), and lignin (15-20%)",
      "key_specs": "Corn stover is the non-grain part of the corn plant, including leaves, stalks, and cobs. It is typically collected post-harvest and may require pretreatment to enhance enzymatic hydrolysis.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "C2H5OH with typical purity of 99.5% for fuel-grade ethanol",
      "key_specs": "Fuel-grade ethanol must meet ASTM D4806 specifications, which include limits on water content, acidity, and other impurities. It is used as a biofuel additive for gasoline.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover, which is the non-grain part of the corn plant, is collected post-harvest. This material is primarily composed of cellulose, hemicellulose, and lignin. The preparation involves size reduction through mechanical milling to increase the surface area and facilitate subsequent processing steps. The milled corn stover is then subjected to a drying process to reduce moisture content, which is crucial for efficient pretreatment and enzymatic hydrolysis.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Prepared Corn Stover"
      ],
      "parameters": {
        "separations": [
          {
            "description": "This separation involves the removal of moisture from raw corn stover during the drying process following milling. The process enhances the efficiency of subsequent biomass processing stages.",
            "component": "Moisture",
            "extractionRate": 1.0
          }
        ]
      },
      "additional_info": "Size reduction is typically achieved using hammer mills or knife mills. Moisture content is reduced to below 10%."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The prepared corn stover undergoes a pretreatment process to break down the lignin structure and make the cellulose and hemicellulose more accessible for enzymatic hydrolysis. This is typically achieved using dilute acid pretreatment, where the biomass is treated with a dilute acid solution under controlled conditions. The pretreatment disrupts the lignin matrix and partially hydrolyzes hemicellulose into soluble sugars.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Prepared Corn Stover",
        "Dilute Acid Solution"
      ],
      "output_streams": [
        "Pretreated Biomass"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Hemicellulose undergoes partial hydrolysis into soluble sugars due to the presence of a dilute acid solution, enhancing subsequent enzymatic hydrolysis.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Soluble Sugars",
            "conversionRate": 0.35
          },
          {
            "description": "Lignin matrix disruption occurs, resulting in lignin residues as the lignin structure remains largely intact without significant conversion.",
            "inputComponent": "Lignin",
            "outputComponent": "Lignin Residues",
            "conversionRate": 0.85
          }
        ]
      },
      "additional_info": "Common acids used include sulfuric acid. The process may generate some inhibitors that need to be managed in subsequent steps."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "The pretreated biomass is subjected to enzymatic hydrolysis, where specific enzymes are added to convert cellulose and remaining hemicellulose into fermentable sugars, primarily glucose and xylose. This step is crucial for maximizing sugar yield, which directly impacts ethanol production efficiency.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Mixture"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Enzymatic hydrolysis of cellulose into glucose using cellulase.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.85
          },
          {
            "description": "Enzymatic hydrolysis of hemicellulose into xylose using hemicellulase.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "Enzymatic hydrolysis is typically conducted at moderate temperatures and neutral pH to optimize enzyme activity."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The sugar solution is fermented using a strain of yeast or bacteria that can efficiently convert glucose and xylose into ethanol. This biological process involves the anaerobic conversion of sugars into ethanol and carbon dioxide. The choice of microorganism is critical to ensure high ethanol yield and productivity.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Sugar Solution",
        "Yeast Culture"
      ],
      "output_streams": [
        "Fermentation Broth",
        "Carbon Dioxide"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The fermentation of glucose into ethanol and carbon dioxide by yeast under anaerobic conditions.",
            "inputComponent": "Glucose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.45
          },
          {
            "description": "The fermentation of glucose into carbon dioxide by yeast while producing ethanol.",
            "inputComponent": "Glucose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.45
          },
          {
            "description": "The fermentation of xylose into ethanol using engineered yeast strains under anaerobic conditions.",
            "inputComponent": "Xylose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.25
          },
          {
            "description": "The fermentation of xylose into carbon dioxide using engineered yeast strains while producing ethanol.",
            "inputComponent": "Xylose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.25
          }
        ]
      },
      "additional_info": "Saccharomyces cerevisiae is commonly used, but genetically engineered strains may be employed to improve xylose fermentation."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "The fermentation broth is subjected to distillation to separate ethanol from water and other components. This involves heating the broth to vaporize ethanol, which is then condensed into a concentrated form. Distillation is a critical step to achieve the desired purity of ethanol for fuel applications.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "The separation of ethanol from fermentation broth using heating and vaporization.",
            "component": "Ethanol",
            "extractionRate": 0.95
          },
          {
            "description": "The residual component primarily consisting of yeast biomass and sugars that remains in the stillage.",
            "component": "Yeast Biomass",
            "extractionRate": 0.05
          },
          {
            "description": "The residual component consisting of unfermented sugars present in the fermentation broth that remain in the stillage.",
            "component": "Residual Sugars",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "A multi-stage distillation column is typically used to achieve high ethanol recovery."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The crude ethanol is further dehydrated to remove residual water and achieve fuel-grade ethanol purity. This is typically done using molecular sieves or membrane separation technologies, which selectively remove water from the ethanol-water mixture.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Fuel-Grade Ethanol"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Using dehydration techniques such as molecular sieves or membrane separation to selectively remove water from crude ethanol-water mixture.",
            "component": "Water",
            "extractionRate": 0.99
          }
        ]
      },
      "additional_info": "Fuel-grade ethanol must meet ASTM D4806 specifications, which include limits on water content and other impurities."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is the collected non-grain part of the corn plant, including leaves, stalks, and cobs. The stream is primarily composed of cellulose (35-40%), hemicellulose (25-30%), lignin (15-20%), and moisture. It is typically collected post-harvest and may require subsequent pretreatment to enhance enzymatic hydrolysis for biofuel production.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "dilute acid solution source": {
      "unit_operation_id": "dilute acid solution source",
      "name": "Dilute Acid Solution Source",
      "description": "This unit operation serves as a source for the Dilute Acid Solution, which is an essential input for the pretreatment stage of the bioethanol production process. The dilute acid solution is specifically formulated to facilitate the breakdown of lignin and hemicellulose in the prepared corn stover, enhancing the efficiency of subsequent enzymatic hydrolysis. The solution typically consists of a mixture of water and a suitable acid, such as sulfuric acid, at a controlled concentration to optimize the pretreatment process.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Dilute Acid Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme mixture source": {
      "unit_operation_id": "enzyme mixture source",
      "name": "Enzyme Mixture Source",
      "description": "This unit operation serves as a source for the Enzyme Mixture stream, which consists of cellulase and hemicellulase enzymes. These enzymes are crucial for the enzymatic hydrolysis process, where they catalyze the breakdown of cellulose and hemicellulose present in the pretreated biomass into fermentable sugars. The Enzyme Mixture is prepared in a controlled environment to ensure optimal activity and stability before being fed into the enzymatic hydrolysis unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Mixture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "yeast culture source": {
      "unit_operation_id": "yeast culture source",
      "name": "Yeast Culture Source",
      "description": "This unit operation serves as a source for the Yeast Culture stream, which is essential for the fermentation process in ethanol production. The Yeast Culture is a concentrated suspension of yeast cells that are specifically cultivated to efficiently convert sugars into ethanol during fermentation. This stream is critical for ensuring a high fermentation rate and maximizing ethanol yield.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Yeast Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "stillage sink": {
      "unit_operation_id": "stillage sink",
      "name": "Stillage Sink",
      "description": "The Stillage Sink is the final unit operation in the process flow, designed to receive and manage the stillage, which is the residue from the distillation process. This stream contains water, yeast biomass, and residual sugars. The Stillage Sink serves as a termination point for the stillage, allowing for potential further processing or disposal. It ensures that the byproducts of ethanol production are properly handled, either for recovery of valuable components or for safe disposal, in compliance with environmental regulations.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "fuel_grade ethanol sink": {
      "unit_operation_id": "fuel_grade ethanol sink",
      "name": "Fuel-Grade Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Fuel-Grade Ethanol stream, which is produced through a series of biochemical transformations from corn stover. The sink is designed to receive the high-purity ethanol, ensuring that it meets the necessary specifications for fuel-grade ethanol, including a purity of 99.5% as per ASTM D4806 standards. The operation may involve storage and quality control measures to maintain the integrity of the product before distribution.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Fuel-Grade Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "carbon dioxide sink": {
      "unit_operation_id": "carbon dioxide sink",
      "name": "Carbon Dioxide Sink",
      "description": "This unit operation serves as a sink for the carbon dioxide produced during the fermentation process. Carbon dioxide is generated as a by-product when yeast converts sugars into ethanol and carbon dioxide. The sink collects and manages the carbon dioxide emissions, which can be further processed for various applications, such as carbon capture, storage, or utilization in other industrial processes.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Carbon Dioxide"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Collected non-grain part of the corn plant, including leaves, stalks, and cobs.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Moisture": 0
      }
    },
    "Prepared Corn Stover": {
      "name": "Prepared Corn Stover",
      "stream_id": "prepared corn stover",
      "description": "Milled and dried corn stover with reduced moisture content, ready for pretreatment.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Dilute Acid Solution": {
      "name": "Dilute Acid Solution",
      "stream_id": "dilute acid solution",
      "description": "A dilute acid solution used to facilitate the breakdown of lignin and hemicellulose.",
      "stream_type": "core",
      "source": "dilute acid solution source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Acid": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Corn stover with disrupted lignin structure and partially hydrolyzed hemicellulose, containing soluble sugars.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Soluble Sugars": 0,
        "Lignin Residues": 0
      }
    },
    "Enzyme Mixture": {
      "name": "Enzyme Mixture",
      "stream_id": "enzyme mixture",
      "description": "A mixture of cellulase and hemicellulase enzymes used to hydrolyze cellulose and hemicellulose into sugars.",
      "stream_type": "core",
      "source": "enzyme mixture source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0,
        "Hemicellulase": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution rich in fermentable sugars, primarily glucose and xylose, ready for fermentation.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin Residues": 0
      }
    },
    "Yeast Culture": {
      "name": "Yeast Culture",
      "stream_id": "yeast culture",
      "description": "A culture of yeast or bacteria used to ferment sugars into ethanol.",
      "stream_type": "core",
      "source": "yeast culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Yeast": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, residual sugars, yeast biomass, and by-products such as carbon dioxide.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Yeast Biomass": 0,
        "Residual Sugars": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "Concentrated ethanol with impurities, requiring further purification.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Water": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "Residue from distillation containing water, yeast biomass, and unfermented sugars.",
      "stream_type": "core",
      "source": "distillation",
      "target": "stillage sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Yeast Biomass": 0,
        "Residual Sugars": 0
      }
    },
    "Fuel-Grade Ethanol": {
      "name": "Fuel-Grade Ethanol",
      "stream_id": "fuel_grade ethanol",
      "description": "High-purity ethanol suitable for use as a biofuel additive in gasoline.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "fuel_grade ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "stream_id": "carbon dioxide",
      "description": "Carbon dioxide is a by-product of the fermentation process where sugars are converted into ethanol and carbon dioxide by the yeast.",
      "stream_type": "aux",
      "source": "fermentation",
      "target": "carbon dioxide sink",
      "flow_rate": 0.0,
      "components": {
        "Carbon Dioxide": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Moisture": {
      "name": "Moisture",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Acid": {
      "name": "Acid",
      "properties": {}
    },
    "Soluble Sugars": {
      "name": "Soluble Sugars",
      "properties": {}
    },
    "Lignin Residues": {
      "name": "Lignin Residues",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Hemicellulase": {
      "name": "Hemicellulase",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Yeast": {
      "name": "Yeast",
      "properties": {}
    },
    "Ethanol": {
      "name": "Ethanol",
      "properties": {}
    },
    "Yeast Biomass": {
      "name": "Yeast Biomass",
      "properties": {}
    },
    "Residual Sugars": {
      "name": "Residual Sugars",
      "properties": {}
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "properties": {}
    }
  }
}