{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Cellulose (35-40%), Hemicellulose (25-30%), Lignin (15-20%), Ash (5-10%), Moisture (5-10%)",
      "key_specs": "Lignocellulosic biomass, typically requires pretreatment to break down cellulose and hemicellulose into fermentable sugars.",
      "volumetric_scale": "1000 metric tons per day"
    }
  ],
  "products": [
    {
      "name": "Glycerol",
      "composition": "C3H8O3 (Glycerol)",
      "key_specs": "Industrial grade, typically >95% purity, suitable for use in pharmaceuticals, cosmetics, and food industries.",
      "volumetric_scale": "200 metric tons per day"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover, a lignocellulosic biomass, is initially collected and prepared for processing. This involves size reduction through mechanical milling to increase the surface area, making it more amenable to subsequent pretreatment processes. The goal is to achieve a uniform particle size that facilitates efficient chemical reactions in later stages.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Milled Corn Stover"
      ],
      "parameters": {},
      "additional_info": "Size reduction is typically achieved using hammer mills or knife mills."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The milled corn stover undergoes a pretreatment process to break down the complex lignocellulosic structure. This is typically done using dilute acid hydrolysis, which helps to solubilize hemicellulose and disrupt the lignin structure, releasing fermentable sugars such as glucose and xylose. This step is crucial for enhancing the enzymatic digestibility of the biomass.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Milled Corn Stover",
        "Dilute Acid Solution"
      ],
      "output_streams": [
        "Pretreated Biomass",
        "Soluble Hemicellulose Extract"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The process where hemicellulose is hydrolyzed with dilute acid to produce xylose.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.5
          },
          {
            "description": "The conversion of hemicellulose into soluble hemicellulose and other soluble sugars through dilute acid hydrolysis.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Solubilized Hemicellulose",
            "conversionRate": 0.3
          }
        ]
      },
      "additional_info": "Common acids used include sulfuric acid or hydrochloric acid. The process may generate some inhibitory compounds that need to be managed."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "The pretreated biomass is subjected to enzymatic hydrolysis to further break down cellulose into glucose. Enzymes such as cellulases are added to catalyze the hydrolysis of cellulose into fermentable sugars. This step is essential for maximizing sugar yield, which is critical for the subsequent fermentation process.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Cellulase Enzymes"
      ],
      "output_streams": [
        "Hydrolyzed Biomass"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The enzymatic hydrolysis process where cellulase enzymes catalyze the breakdown of cellulose into glucose monomers.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.8
          }
        ]
      },
      "additional_info": "Enzyme loading and reaction time are optimized to balance cost and sugar yield."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The hydrolyzed biomass is introduced into a bioreactor for aerobic fermentation. Specific strains of bacteria are employed to convert the glucose and xylose into glycerol. This process requires careful control of oxygen levels, as well as nutrients to support bacterial growth and metabolism.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Hydrolyzed Biomass",
        "Bacterial Culture",
        "Nutrient Solution"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The conversion of glucose into glycerol through bacterial fermentation.",
            "inputComponent": "Glucose",
            "outputComponent": "Glycerol",
            "conversionRate": 0.65
          },
          {
            "description": "The conversion of xylose into glycerol through bacterial fermentation.",
            "inputComponent": "Xylose",
            "outputComponent": "Glycerol",
            "conversionRate": 0.35
          }
        ]
      },
      "additional_info": "Oxygen transfer and mixing are critical design considerations to ensure efficient fermentation."
    },
    "product_recovery": {
      "unit_operation_id": "product_recovery",
      "name": "Product Recovery",
      "description": "The fermentation broth undergoes a series of separation processes to recover glycerol. This typically involves centrifugation to remove bacterial biomass, followed by distillation to purify glycerol from the remaining liquid. The goal is to achieve industrial-grade glycerol with a purity of greater than 95%.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Glycerol",
        "Biomass Waste"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Centrifugation to separate bacterial biomass from fermentation broth.",
            "component": "Bacterial Biomass",
            "extractionRate": 0.99
          },
          {
            "description": "Distillation to recover glycerol from remaining liquid components.",
            "component": "Glycerol",
            "extractionRate": 0.95
          }
        ]
      },
      "additional_info": "Distillation columns are designed to optimize energy efficiency and separation performance."
    },
    "glycerol_purification": {
      "unit_operation_id": "glycerol_purification",
      "name": "Glycerol Purification",
      "description": "The crude glycerol is further purified to achieve the desired industrial-grade quality. This involves additional distillation or other purification techniques such as ion exchange or membrane filtration to remove residual impurities and water, ensuring the glycerol meets the required purity standards for pharmaceutical, cosmetic, and food applications.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Glycerol"
      ],
      "output_streams": [
        "Purified Glycerol"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Distillation technique separates components based on boiling points, removing water and lighter impurities from glycerol.",
            "component": "Water",
            "extractionRate": 0.95
          },
          {
            "description": "Filtration or ion exchange methods are employed to remove salts, metals, or organic compounds from glycerol stream.",
            "component": "Impurities",
            "extractionRate": 0.9
          },
          {
            "description": "Membrane filtration is used to selectively remove smaller molecular impurities and water from glycerol to achieve higher purity levels.",
            "component": "Water",
            "extractionRate": 0.95
          },
          {
            "description": "Membrane filtration aids in removing organic and smaller molecular impurities, enhancing the purity of glycerol.",
            "component": "Impurities",
            "extractionRate": 0.9
          }
        ]
      },
      "additional_info": "Purification processes are selected based on the specific impurity profile and target purity requirements."
    },
    "waste_treatment": {
      "unit_operation_id": "waste_treatment",
      "name": "Waste Treatment",
      "description": "Residual waste streams from the process, including lignin residues, unconverted sugars, and other by-products, are treated to minimize environmental impact. This may involve biological treatment, combustion for energy recovery, or conversion into value-added products such as biochar or animal feed.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Biomass Waste"
      ],
      "output_streams": [
        "Treated Waste"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of bacterial biomass through biological treatment or combustion to achieve inert solids and gases.",
            "component": "Bacterial Biomass",
            "extractionRate": 0.3
          },
          {
            "description": "Conversion of lignin residues into energy or a stable inert form, leaving behind inert solids.",
            "component": "Lignin Residues",
            "extractionRate": 0.2
          }
        ]
      },
      "additional_info": "Waste treatment strategies are chosen based on regulatory requirements and economic considerations."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which consists of unprocessed corn stover collected from agricultural fields. The stream contains a mixture of cellulose (35-40%), hemicellulose (25-30%), lignin (15-20%), ash (5-10%), and moisture (5-10%). It is a key feedstock for the subsequent processing steps in the production of glycerol, requiring proper handling and preparation before entering the feedstock preparation unit.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "dilute acid solution source": {
      "unit_operation_id": "dilute acid solution source",
      "name": "Dilute Acid Solution Source",
      "description": "This unit operation serves as a source for the Dilute Acid Solution, which is utilized in the pretreatment stage of the biomass conversion process. The dilute acid solution is essential for hydrolyzing hemicellulose and disrupting lignin structures in the biomass, facilitating the subsequent enzymatic hydrolysis of cellulose. The solution is composed primarily of water and a specific acid, which is carefully controlled to ensure optimal reaction conditions during the pretreatment phase.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Dilute Acid Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "cellulase enzymes source": {
      "unit_operation_id": "cellulase enzymes source",
      "name": "Cellulase Enzymes Source",
      "description": "This unit operation serves as a source for Cellulase Enzymes, which are critical biocatalysts used in the enzymatic hydrolysis process. The cellulase enzymes facilitate the breakdown of cellulose into fermentable sugars, primarily glucose, thereby enhancing the efficiency of biomass conversion in the production of biofuels and biochemicals. The unit operation ensures a continuous supply of cellulase enzymes at the required concentration and activity level, supporting the downstream enzymatic hydrolysis unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Cellulase Enzymes"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "bacterial culture source": {
      "unit_operation_id": "bacterial culture source",
      "name": "Bacterial Culture Source",
      "description": "This unit operation serves as a source for the Bacterial Culture stream, which consists of bacterial strains specifically selected for their ability to convert fermentable sugars into glycerol during the fermentation process. The Bacterial Culture is maintained under controlled conditions to ensure optimal growth and activity, enabling efficient glycerol production in subsequent stages of the process flow.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Bacterial Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "nutrient solution source": {
      "unit_operation_id": "nutrient solution source",
      "name": "Nutrient Solution Source",
      "description": "This unit operation serves as the source for the Nutrient Solution, which is essential for supporting bacterial growth during the fermentation process. The Nutrient Solution contains a balanced mix of a Nitrogen Source, Phosphorus Source, and Trace Minerals, providing the necessary nutrients for optimal fermentation conditions. This source ensures a continuous supply of the Nutrient Solution at the required volumetric scale to maintain the efficiency and productivity of the fermentation unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Nutrient Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "purified glycerol sink": {
      "unit_operation_id": "purified glycerol sink",
      "name": "Purified Glycerol Sink",
      "description": "This unit operation serves as the final sink for the purified glycerol stream, which is produced from the glycerol purification process. It is designed to receive high-purity glycerol suitable for industrial applications, ensuring that the product meets the required specifications for use in pharmaceuticals, cosmetics, and food industries. The sink facilitates the storage and transfer of purified glycerol to downstream processes or packaging for distribution.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Purified Glycerol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "treated waste sink": {
      "unit_operation_id": "treated waste sink",
      "name": "Treated Waste Sink",
      "description": "This unit operation serves as the final sink for the treated waste stream, which consists of inert solids and water. The treated waste has undergone a waste treatment process to minimize environmental impact, ensuring that it can be safely disposed of or managed without causing harm to the environment. This sink collects the treated waste for further handling, storage, or disposal.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Treated Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "soluble hemicellulose extract sink": {
      "unit_operation_id": "soluble hemicellulose extract sink",
      "name": "Soluble Hemicellulose Extract Sink",
      "description": "This unit operation serves as the terminus for the Soluble Hemicellulose Extract stream, which consists of solubilized hemicellulose, soluble sugars, and various by-products generated during the dilute acid hydrolysis of lignocellulosic biomass. The sink is designed to collect and manage the output from the pretreatment process, facilitating further processing or disposal of the extract.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Soluble Hemicellulose Extract"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Unprocessed corn stover collected from agricultural fields.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Milled Corn Stover": {
      "name": "Milled Corn Stover",
      "stream_id": "milled corn stover",
      "description": "Corn stover that has been mechanically reduced in size, ready for pretreatment.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Dilute Acid Solution": {
      "name": "Dilute Acid Solution",
      "stream_id": "dilute acid solution",
      "description": "A dilute acid solution used to hydrolyze hemicellulose and disrupt lignin.",
      "stream_type": "core",
      "source": "dilute acid solution source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Acid": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with solubilized hemicellulose and disrupted lignin, containing fermentable sugars.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin Residues": 0,
        "Ash": 0
      }
    },
    "Cellulase Enzymes": {
      "name": "Cellulase Enzymes",
      "stream_id": "cellulase enzymes",
      "description": "Enzymes used to catalyze the hydrolysis of cellulose into glucose.",
      "stream_type": "core",
      "source": "cellulase enzymes source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0
      }
    },
    "Hydrolyzed Biomass": {
      "name": "Hydrolyzed Biomass",
      "stream_id": "hydrolyzed biomass",
      "description": "Biomass with cellulose converted into glucose, ready for fermentation.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin Residues": 0,
        "Ash": 0
      }
    },
    "Bacterial Culture": {
      "name": "Bacterial Culture",
      "stream_id": "bacterial culture",
      "description": "Bacterial strains capable of converting sugars into glycerol under aerobic conditions.",
      "stream_type": "core",
      "source": "bacterial culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Bacteria": 0
      }
    },
    "Nutrient Solution": {
      "name": "Nutrient Solution",
      "stream_id": "nutrient solution",
      "description": "Nutrients required to support bacterial growth and fermentation.",
      "stream_type": "core",
      "source": "nutrient solution source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Nitrogen Source": 0,
        "Phosphorus Source": 0,
        "Trace Minerals": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing glycerol, unconverted sugars, bacterial biomass, and other by-products.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "product_recovery",
      "flow_rate": 0.0,
      "components": {
        "Glycerol": 0,
        "Unconverted Sugars": 0,
        "Bacterial Biomass": 0,
        "Water": 0
      }
    },
    "Crude Glycerol": {
      "name": "Crude Glycerol",
      "stream_id": "crude glycerol",
      "description": "Glycerol with impurities, requiring further purification.",
      "stream_type": "core",
      "source": "product_recovery",
      "target": "glycerol_purification",
      "flow_rate": 0.0,
      "components": {
        "Glycerol": 0,
        "Water": 0,
        "Impurities": 0
      }
    },
    "Biomass Waste": {
      "name": "Biomass Waste",
      "stream_id": "biomass waste",
      "description": "Solid waste consisting of bacterial biomass and other solids.",
      "stream_type": "core",
      "source": "product_recovery",
      "target": "waste_treatment",
      "flow_rate": 0.0,
      "components": {
        "Bacterial Biomass": 0,
        "Lignin Residues": 0
      }
    },
    "Purified Glycerol": {
      "name": "Purified Glycerol",
      "stream_id": "purified glycerol",
      "description": "High-purity glycerol suitable for industrial applications.",
      "stream_type": "core",
      "source": "glycerol_purification",
      "target": "purified glycerol sink",
      "flow_rate": 0.0,
      "components": {
        "Glycerol": 0
      }
    },
    "Treated Waste": {
      "name": "Treated Waste",
      "stream_id": "treated waste",
      "description": "Waste that has been treated to reduce environmental impact.",
      "stream_type": "core",
      "source": "waste_treatment",
      "target": "treated waste sink",
      "flow_rate": 0.0,
      "components": {
        "Inert Solids": 0,
        "Water": 0
      }
    },
    "Soluble Hemicellulose Extract": {
      "name": "Soluble Hemicellulose Extract",
      "stream_id": "soluble hemicellulose extract",
      "description": "This stream includes solubilized hemicellulose and other solubilized sugars and compounds that are released during the dilute acid hydrolysis of the lignocellulosic biomass.",
      "stream_type": "aux",
      "source": "pretreatment",
      "target": "soluble hemicellulose extract sink",
      "flow_rate": 0.0,
      "components": {
        "Solubilized Hemicellulose": 0,
        "Soluble Sugars": 0,
        "By-products": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Ash": {
      "name": "Ash",
      "properties": {}
    },
    "Moisture": {
      "name": "Moisture",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Acid": {
      "name": "Acid",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Lignin Residues": {
      "name": "Lignin Residues",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Bacteria": {
      "name": "Bacteria",
      "properties": {}
    },
    "Nitrogen Source": {
      "name": "Nitrogen Source",
      "properties": {}
    },
    "Phosphorus Source": {
      "name": "Phosphorus Source",
      "properties": {}
    },
    "Trace Minerals": {
      "name": "Trace Minerals",
      "properties": {}
    },
    "Glycerol": {
      "name": "Glycerol",
      "properties": {}
    },
    "Unconverted Sugars": {
      "name": "Unconverted Sugars",
      "properties": {}
    },
    "Bacterial Biomass": {
      "name": "Bacterial Biomass",
      "properties": {}
    },
    "Impurities": {
      "name": "Impurities",
      "properties": {}
    },
    "Inert Solids": {
      "name": "Inert Solids",
      "properties": {}
    },
    "Solubilized Hemicellulose": {
      "name": "Solubilized Hemicellulose",
      "properties": {}
    },
    "Soluble Sugars": {
      "name": "Soluble Sugars",
      "properties": {}
    },
    "By-products": {
      "name": "By-products",
      "properties": {}
    }
  }
}