{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Cellulose (35-45%), Hemicellulose (25-35%), Lignin (15-20%), Ash and other components (5-10%)",
      "key_specs": "Typically requires pre-treatment to break down lignocellulosic structure for fermentation. Moisture content should be controlled to optimize fermentation efficiency.",
      "volumetric_scale": "100,000 kg/day"
    }
  ],
  "products": [
    {
      "name": "Lactic Acid",
      "composition": "Lactic acid (C3H6O3) with potential impurities such as unreacted sugars and by-products from fermentation",
      "key_specs": "Commercial grade lactic acid typically requires a purity of 85-90% for industrial applications. Optical purity (L-lactic acid) may be specified depending on the application.",
      "volumetric_scale": "50,000 kg/day"
    }
  ],
  "unit_operations": {
    "pre-treatment": {
      "unit_operation_id": "pre-treatment",
      "name": "Pre-treatment",
      "description": "The pre-treatment unit operation is crucial for preparing corn stover for fermentation. This step involves mechanical, chemical, or a combination of methods to break down the lignocellulosic structure of corn stover, making cellulose and hemicellulose more accessible for enzymatic hydrolysis. Typically, this involves size reduction through milling, followed by chemical treatment using dilute acid or alkali to disrupt the lignin structure and enhance the digestibility of the biomass.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover",
        "Chemical Additives"
      ],
      "output_streams": [
        "Pre-treated Biomass",
        "Wastewater"
      ],
      "parameters": {
        "separations": [
          {
            "description": "The mechanical and chemical treatment of raw corn stover results in the separation of lignin from cellulose and hemicellulose, enhancing the accessibility of these components for enzymatic hydrolysis.",
            "component": "Lignin",
            "extractionRate": 0.3
          }
        ]
      },
      "additional_info": "The moisture content of the corn stover is controlled to optimize the efficiency of the pre-treatment process."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pre-treated biomass undergoes enzymatic hydrolysis to convert cellulose and hemicellulose into fermentable sugars. Enzymes such as cellulases and hemicellulases are added to the biomass slurry, catalyzing the breakdown of polysaccharides into monosaccharides like glucose and xylose. This step is critical for maximizing sugar yield, which directly impacts the efficiency of subsequent fermentation.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Pre-treated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Enzymatic hydrolysis of cellulose into glucose using cellulase enzymes.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.85
          },
          {
            "description": "Enzymatic hydrolysis of hemicellulose into xylose using hemicellulase enzymes.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.8
          }
        ]
      },
      "additional_info": "The enzymatic hydrolysis is typically conducted at controlled temperatures to optimize enzyme activity."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The fermentation unit operation involves the anaerobic conversion of sugars into lactic acid by lactic acid bacteria. The sugar solution is inoculated with a suitable strain of bacteria, such as Lactobacillus species, under anaerobic conditions. The bacteria metabolize the sugars, producing lactic acid as the primary product, along with minor amounts of by-products.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Sugar Solution",
        "Bacterial Culture"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Conversion of glucose into lactic acid by Lactobacillus bacteria during fermentation under anaerobic conditions.",
            "inputComponent": "Glucose",
            "outputComponent": "Lactic Acid",
            "conversionRate": 0.8
          },
          {
            "description": "Conversion of xylose into lactic acid by Lactobacillus bacteria during fermentation under anaerobic conditions.",
            "inputComponent": "Xylose",
            "outputComponent": "Lactic Acid",
            "conversionRate": 0.6
          }
        ]
      },
      "additional_info": "Anaerobic conditions are maintained throughout the fermentation process to ensure optimal bacterial activity."
    },
    "separation": {
      "unit_operation_id": "separation",
      "name": "Separation",
      "description": "This unit operation involves the separation of lactic acid from the fermentation broth. Techniques such as centrifugation and filtration are employed to remove bacterial biomass and other solid residues. The clarified liquid, containing lactic acid and residual sugars, is then subjected to further purification processes.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Clarified Lactic Acid Solution",
        "Solid Waste"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Isolating lactic acid from fermentation broth via centrifugation and filtration.",
            "component": "Lactic Acid",
            "extractionRate": 0.95
          },
          {
            "description": "Isolating unreacted sugars from fermentation broth via centrifugation and filtration.",
            "component": "Unreacted Sugars",
            "extractionRate": 0.92
          },
          {
            "description": "Removing bacterial biomass during the separation process.",
            "component": "Bacterial Biomass",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "Solid waste from this process can be treated and potentially used as a nutrient source or disposed of according to environmental regulations."
    },
    "purification": {
      "unit_operation_id": "purification",
      "name": "Purification",
      "description": "In the purification unit operation, the clarified lactic acid solution undergoes further processing to achieve the desired purity levels. Techniques such as ion exchange, solvent extraction, and distillation are used to remove impurities and concentrate lactic acid. This step is essential to meet commercial-grade specifications for lactic acid purity and optical isomerism, if required.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Clarified Lactic Acid Solution"
      ],
      "output_streams": [
        "Purified Lactic Acid",
        "Waste Stream"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Ion exchange process to remove ionic impurities from clarified lactic acid solution.",
            "component": "Lactic Acid",
            "extractionRate": 0.95
          },
          {
            "description": "Solvent extraction to separate lactic acid from sugars and other impurities using an organic solvent.",
            "component": "Unreacted Sugars",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "The choice of purification method may depend on the required optical purity and end-use application of the lactic acid."
    },
    "product_storage_and_handling": {
      "unit_operation_id": "product_storage_and_handling",
      "name": "Product Storage and Handling",
      "description": "The final unit operation involves the storage and handling of purified lactic acid. The product is stored in appropriate containers to prevent contamination and degradation. Considerations for storage include maintaining a stable temperature and protecting the product from light and air exposure to preserve its quality.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Purified Lactic Acid"
      ],
      "output_streams": [
        "Stored Lactic Acid"
      ],
      "parameters": {},
      "additional_info": "Storage facilities must comply with safety and regulatory standards to ensure product integrity and safety."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is collected directly from agricultural fields. The stream consists of stalks, leaves, and cobs, and is composed of key components including cellulose (35-45%), hemicellulose (25-35%), lignin (15-20%), and ash (5-10%). This raw biomass requires pre-treatment to break down its lignocellulosic structure for efficient fermentation processes. The operation is designed to supply 100,000 kg/day of Raw Corn Stover to the subsequent unit operations in the process flow.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which is a critical input for the enzymatic hydrolysis process. The Enzyme Solution contains cellulase and hemicellulase enzymes, which are essential for breaking down the pre-treated biomass into fermentable sugars. The operation ensures a consistent supply of enzyme solution at the required concentration and volume, facilitating efficient enzymatic activity and maximizing sugar yield.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "bacterial culture source": {
      "unit_operation_id": "bacterial culture source",
      "name": "Bacterial Culture Source",
      "description": "This unit operation serves as a source for the Bacterial Culture stream, which contains Lactobacillus, a key microorganism used to inoculate the fermentation medium in the production of lactic acid. The Bacterial Culture is prepared under controlled conditions to ensure optimal growth and activity of the Lactobacillus strains, which are essential for efficient fermentation. This stream is supplied to the Fermentation unit operation, where it interacts with the Sugar Solution to produce fermentation broth.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Bacterial Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "solid waste sink": {
      "unit_operation_id": "solid waste sink",
      "name": "Solid Waste Sink",
      "description": "This unit operation serves as the sink for the Solid Waste stream, which consists primarily of bacterial biomass removed from the fermentation broth. The Solid Waste Sink is designed to collect and manage the solid residues generated during the fermentation process, ensuring proper disposal or potential further processing of the bacterial biomass. It plays a crucial role in maintaining the efficiency of the overall process by preventing the accumulation of waste materials in the system.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Solid Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "waste stream sink": {
      "unit_operation_id": "waste stream sink",
      "name": "Waste Stream Sink",
      "description": "This unit operation serves as the sink for the Waste Stream, which contains unreacted sugars and impurities removed during the purification of lactic acid. The Waste Stream Sink is designed to safely handle and dispose of these by-products, ensuring that they do not re-enter the production process. Proper management of this stream is crucial for maintaining the overall efficiency and sustainability of the lactic acid production process.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Waste Stream"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "stored lactic acid sink": {
      "unit_operation_id": "stored lactic acid sink",
      "name": "Stored Lactic Acid Sink",
      "description": "This unit operation serves as the final storage point for purified lactic acid, ensuring that the product is safely contained and ready for distribution or further processing. The stored lactic acid is maintained under controlled conditions to preserve its quality and prevent degradation. This sink is critical for managing inventory and facilitating the logistics of lactic acid distribution to various industrial applications.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Stored Lactic Acid"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "chemical additives source": {
      "unit_operation_id": "chemical additives source",
      "name": "Chemical Additives Source",
      "description": "This unit operation serves as a source for the Chemical Additives stream, which includes chemical additives such as dilute acids or alkalis used in the pre-treatment process of biomass. These additives are crucial for disrupting the lignin structure, thereby enhancing the digestibility of the biomass (Corn Stover) for subsequent enzymatic hydrolysis and fermentation processes. The stream is supplied at an industrial scale to ensure optimal pre-treatment efficiency.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Chemical Additives"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "wastewater sink": {
      "unit_operation_id": "wastewater sink",
      "name": "Wastewater Sink",
      "description": "This unit operation serves as a sink for the wastewater generated from the chemical treatment of corn stover. The wastewater may contain residual chemicals such as acids or alkalis, along with dissolved organic materials. The purpose of this sink is to collect and manage the wastewater stream, ensuring proper handling and treatment before disposal or further processing.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Wastewater"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Corn stover as collected from agricultural fields, consisting of stalks, leaves, and cobs.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "pre-treatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0
      }
    },
    "Pre-treated Biomass": {
      "name": "Pre-treated Biomass",
      "stream_id": "pre_treated biomass",
      "description": "Corn stover that has been mechanically and chemically treated to increase the accessibility of cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "pre-treatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulase and hemicellulase enzymes.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0,
        "Hemicellulase": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution rich in fermentable sugars, primarily glucose and xylose, ready for fermentation.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Residual Lignin": 0
      }
    },
    "Bacterial Culture": {
      "name": "Bacterial Culture",
      "stream_id": "bacterial culture",
      "description": "A culture of lactic acid bacteria used to inoculate the fermentation medium.",
      "stream_type": "core",
      "source": "bacterial culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Lactobacillus": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A complex mixture containing lactic acid, unreacted sugars, bacterial biomass, and minor by-products.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "separation",
      "flow_rate": 0.0,
      "components": {
        "Lactic Acid": 0,
        "Unreacted Sugars": 0,
        "Bacterial Biomass": 0
      }
    },
    "Clarified Lactic Acid Solution": {
      "name": "Clarified Lactic Acid Solution",
      "stream_id": "clarified lactic acid solution",
      "description": "A liquid stream containing lactic acid and residual sugars, free from solid biomass.",
      "stream_type": "core",
      "source": "separation",
      "target": "purification",
      "flow_rate": 0.0,
      "components": {
        "Lactic Acid": 0,
        "Unreacted Sugars": 0
      }
    },
    "Solid Waste": {
      "name": "Solid Waste",
      "stream_id": "solid waste",
      "description": "Solid residues removed from the fermentation broth, primarily bacterial biomass.",
      "stream_type": "core",
      "source": "separation",
      "target": "solid waste sink",
      "flow_rate": 0.0,
      "components": {
        "Bacterial Biomass": 0
      }
    },
    "Purified Lactic Acid": {
      "name": "Purified Lactic Acid",
      "stream_id": "purified lactic acid",
      "description": "High-purity lactic acid suitable for industrial applications.",
      "stream_type": "core",
      "source": "purification",
      "target": "product_storage_and_handling",
      "flow_rate": 0.0,
      "components": {
        "Lactic Acid": 0
      }
    },
    "Waste Stream": {
      "name": "Waste Stream",
      "stream_id": "waste stream",
      "description": "A stream containing impurities and residual sugars removed during purification.",
      "stream_type": "core",
      "source": "purification",
      "target": "waste stream sink",
      "flow_rate": 0.0,
      "components": {
        "Unreacted Sugars": 0,
        "Impurities": 0
      }
    },
    "Stored Lactic Acid": {
      "name": "Stored Lactic Acid",
      "stream_id": "stored lactic acid",
      "description": "Lactic acid ready for distribution or further processing.",
      "stream_type": "core",
      "source": "product_storage_and_handling",
      "target": "stored lactic acid sink",
      "flow_rate": 0.0,
      "components": {
        "Lactic Acid": 0
      }
    },
    "Chemical Additives": {
      "name": "Chemical Additives",
      "stream_id": "chemical additives",
      "description": "Chemical additives used in the pre-treatment process, such as dilute acid or alkali, to disrupt the lignin structure and enhance the digestibility of the biomass.",
      "stream_type": "aux",
      "source": "chemical additives source",
      "target": "pre-treatment",
      "flow_rate": 0.0,
      "components": {
        "Acid or alkali": 0,
        "Water": 0
      }
    },
    "Wastewater": {
      "name": "Wastewater",
      "stream_id": "wastewater",
      "description": "Wastewater generated from the chemical treatment of corn stover, potentially containing residual chemicals and dissolved organic materials.",
      "stream_type": "aux",
      "source": "pre-treatment",
      "target": "wastewater sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Residual acid or alkali": 0,
        "Dissolved organics": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Ash": {
      "name": "Ash",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Hemicellulase": {
      "name": "Hemicellulase",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Residual Lignin": {
      "name": "Residual Lignin",
      "properties": {}
    },
    "Lactobacillus": {
      "name": "Lactobacillus",
      "properties": {}
    },
    "Lactic Acid": {
      "name": "Lactic Acid",
      "properties": {}
    },
    "Unreacted Sugars": {
      "name": "Unreacted Sugars",
      "properties": {}
    },
    "Bacterial Biomass": {
      "name": "Bacterial Biomass",
      "properties": {}
    },
    "Impurities": {
      "name": "Impurities",
      "properties": {}
    },
    "Acid or alkali": {
      "name": "Acid or alkali",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Residual acid or alkali": {
      "name": "Residual acid or alkali",
      "properties": {}
    },
    "Dissolved organics": {
      "name": "Dissolved organics",
      "properties": {}
    }
  }
}