{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Primarily composed of cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%)",
      "key_specs": "Moisture content typically around 10-15%. Particle size may vary depending on preprocessing methods such as grinding or milling.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "Typically 99.5% ethanol with trace amounts of water and other impurities",
      "key_specs": "Fuel-grade ethanol with a purity of at least 99.5% to meet commercial fuel standards. Denatured with a small amount of gasoline for fuel applications.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "preprocessing": {
      "unit_operation_id": "preprocessing",
      "name": "Preprocessing",
      "description": "The preprocessing unit operation involves the mechanical treatment of corn stover to prepare it for subsequent chemical and biological processing. This step typically includes size reduction through grinding or milling to increase the surface area, which enhances the efficiency of downstream hydrolysis. The moisture content is also adjusted to optimal levels for further processing, often through drying or conditioning.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Preprocessed Corn Stover"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Extraction of moisture from Raw Corn Stover during the preprocessing operation.",
            "component": "moisture",
            "extractionRate": 0.9
          }
        ]
      },
      "additional_info": "Particle size reduction is crucial for increasing the efficiency of enzymatic hydrolysis. Moisture content is adjusted to around 10-15%."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The pretreatment unit operation is designed to break down the lignin structure and disrupt the crystalline structure of cellulose in the corn stover. This is typically achieved through chemical methods such as acid or alkaline treatment, which make the cellulose and hemicellulose more accessible to enzymes in subsequent steps. This step is critical for improving the yield of fermentable sugars.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Preprocessed Corn Stover",
        "Chemical Agent"
      ],
      "output_streams": [
        "Pretreated Biomass"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Chemical pretreatment of corn stover utilizing an acid or alkaline solution to disrupt the lignin structure, enhancing cellulose and hemicellulose accessibility for enzymatic hydrolysis.",
            "inputComponent": "lignin",
            "outputComponent": "solubilized lignin",
            "conversionRate": 0.3
          },
          {
            "description": "Enhancement of cellulose and hemicellulose availability for enzymatic treatments by breaking down lignin and disrupting crystalline structures through chemical agents.",
            "inputComponent": "cellulose and hemicellulose",
            "outputComponent": "pretreated biomass",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "Common pretreatment methods include dilute acid hydrolysis or ammonia fiber expansion. The choice of method affects the downstream processing and overall process economics."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass is subjected to enzymatic hydrolysis. Enzymes such as cellulases and hemicellulases are added to convert cellulose and hemicellulose into fermentable sugars, primarily glucose and xylose. This step is crucial for maximizing sugar yield, which directly impacts ethanol production efficiency.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Hydrolysate"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The process where cellulase enzymes hydrolyze cellulose into glucose.",
            "inputComponent": "cellulose",
            "outputComponent": "glucose",
            "conversionRate": 0.9
          },
          {
            "description": "The process where hemicellulase enzymes hydrolyze hemicellulose into xylose.",
            "inputComponent": "hemicellulose",
            "outputComponent": "xylose",
            "conversionRate": 0.8
          }
        ]
      },
      "additional_info": "The enzymatic hydrolysis is typically conducted at specific temperatures and pH levels to optimize enzyme activity and sugar yield."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The fermentation unit operation involves the conversion of fermentable sugars into ethanol by microbial action. Yeast or genetically engineered bacteria are commonly used to ferment glucose and xylose into ethanol. This step is critical for the production of ethanol and is influenced by factors such as sugar concentration, microbial strain, and fermentation conditions.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Hydrolysate",
        "Microbial Culture"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Fermentation of glucose by yeast to produce ethanol and carbon dioxide.",
            "inputComponent": "glucose",
            "outputComponent": "ethanol",
            "conversionRate": 0.9
          },
          {
            "description": "Fermentation of xylose by certain bacteria to produce ethanol and carbon dioxide.",
            "inputComponent": "xylose",
            "outputComponent": "ethanol",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "The choice of microorganism and fermentation conditions can significantly impact ethanol yield and productivity. Co-fermentation of glucose and xylose is often targeted to maximize ethanol production."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "Distillation is used to separate ethanol from the fermentation broth. This unit operation involves heating the broth to vaporize ethanol, which is then condensed and collected as a concentrated product. Distillation is a key step in achieving the desired ethanol purity for fuel applications.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of ethanol from fermentation broth using distillation based on different boiling points.",
            "component": "ethanol",
            "extractionRate": 0.95
          },
          {
            "description": "Minimal carryover of water during distillation process due to azeotropic behavior.",
            "component": "water",
            "extractionRate": 0.1
          },
          {
            "description": "Negligible amount of biomass carried over into the distillation product.",
            "component": "biomass",
            "extractionRate": 0.01
          }
        ]
      },
      "additional_info": "Distillation columns are designed to optimize energy efficiency and ethanol recovery. The azeotropic nature of ethanol-water mixtures may require additional separation techniques."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The dehydration unit operation is employed to remove residual water from crude ethanol to achieve fuel-grade purity. This is typically accomplished using molecular sieves or membrane separation technologies, which selectively remove water to produce anhydrous ethanol.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Anhydrous Ethanol"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Dehydration of crude ethanol to remove residual water and produce anhydrous ethanol suitable for fuel applications.",
            "component": "water",
            "extractionRate": 0.99
          }
        ]
      },
      "additional_info": "Achieving a purity of at least 99.5% is essential for ethanol to meet commercial fuel standards. Dehydration technologies are selected based on cost, efficiency, and scale."
    },
    "denaturing": {
      "unit_operation_id": "denaturing",
      "name": "Denaturing",
      "description": "Denaturing is the final step in the ethanol production process, where a small amount of gasoline or other denaturants is added to ethanol to make it unfit for human consumption. This is a regulatory requirement for fuel ethanol to avoid beverage alcohol taxes.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Anhydrous Ethanol",
        "Denaturant"
      ],
      "output_streams": [
        "Denatured Ethanol"
      ],
      "parameters": {
        "separations": []
      },
      "additional_info": "The amount and type of denaturant are regulated by government standards to ensure compliance with fuel ethanol specifications."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for Raw Corn Stover, which is the biomass feedstock obtained directly from agricultural sources. It consists of the stalks, leaves, husks, and cobs of corn, primarily composed of cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%). The moisture content typically ranges from 10-15%, and the particle size may vary depending on preprocessing methods such as grinding or milling. This biomass is crucial for subsequent processing steps aimed at converting it into ethanol.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which is a critical input for the enzymatic hydrolysis process in the production of ethanol from biomass. The Enzyme Solution contains cellulase and hemicellulase enzymes that catalyze the breakdown of cellulose and hemicellulose into fermentable sugars. This source is designed to provide a consistent and controlled supply of the enzyme solution, ensuring optimal conditions for the enzymatic reactions that follow.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "stillage sink": {
      "unit_operation_id": "stillage sink",
      "name": "Stillage Sink",
      "description": "This unit operation serves as a sink for the Stillage stream, which is the residual liquid containing water, unfermented sugars, and biomass after the ethanol removal process. The Stillage Sink is designed to handle the disposal or further processing of the stillage, ensuring that the components are managed appropriately, either through treatment, recycling, or safe disposal methods.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "denaturant source": {
      "unit_operation_id": "denaturant source",
      "name": "Denaturant Source",
      "description": "This unit operation serves as a source for the Denaturant stream, which consists of a small amount of gasoline or other chemicals added to ethanol to render it undrinkable. The Denaturant is essential for the denaturing process of ethanol, ensuring compliance with regulations for fuel-grade ethanol applications.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Denaturant"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "denatured ethanol sink": {
      "unit_operation_id": "denatured ethanol sink",
      "name": "Denatured Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Denatured Ethanol stream, which consists of ethanol mixed with gasoline to render it undrinkable. The denatured ethanol is intended for use as a fuel, meeting commercial fuel standards. This sink collects the denatured ethanol after it has undergone the denaturing process, ensuring it is ready for distribution and utilization in fuel applications.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Denatured Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "chemical agent source": {
      "unit_operation_id": "chemical agent source",
      "name": "Chemical Agent Source",
      "description": "This unit operation serves as a source for the Chemical Agent used in the pretreatment process of biomass. The Chemical Agent, which may include acids such as sulfuric acid or alkaline solutions like sodium hydroxide, is essential for facilitating the breakdown of lignin and disrupting the crystalline structure of cellulose. This process enhances the accessibility of cellulose for subsequent enzymatic hydrolysis, thereby improving the overall efficiency of ethanol production from biomass.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Chemical Agent"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "microbial culture source": {
      "unit_operation_id": "microbial culture source",
      "name": "Microbial Culture Source",
      "description": "This unit operation serves as a source for the Microbial Culture stream, which includes essential microorganisms such as yeast and genetically engineered bacteria. These microbes play a crucial role in the fermentation process, as they are responsible for converting fermentable sugars present in the hydrolysate into ethanol. The microbial culture is prepared and maintained under controlled conditions to ensure optimal activity and yield during fermentation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Microbial Culture"
      ],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Corn stover as received from agricultural sources, consisting of stalks, leaves, husks, and cobs.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "preprocessing",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "lignin": 0,
        "moisture": 0
      }
    },
    "Preprocessed Corn Stover": {
      "name": "Preprocessed Corn Stover",
      "stream_id": "preprocessed corn stover",
      "description": "Corn stover that has been ground to a uniform particle size and conditioned to the appropriate moisture content.",
      "stream_type": "core",
      "source": "preprocessing",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "lignin": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Corn stover that has undergone chemical treatment to enhance enzyme accessibility.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "solubilized lignin": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulase and hemicellulase enzymes.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "cellulase": 0,
        "hemicellulase": 0
      }
    },
    "Hydrolysate": {
      "name": "Hydrolysate",
      "stream_id": "hydrolysate",
      "description": "A liquid stream containing fermentable sugars derived from cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "glucose": 0,
        "xylose": 0,
        "residual lignin": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, water, unfermented sugars, and microbial biomass.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "ethanol": 0,
        "water": 0,
        "biomass": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "A concentrated ethanol stream with impurities such as water and trace organics.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "ethanol": 0,
        "water": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "The residual liquid containing water, unfermented sugars, and biomass after ethanol removal.",
      "stream_type": "core",
      "source": "distillation",
      "target": "stillage sink",
      "flow_rate": 0.0,
      "components": {
        "water": 0,
        "biomass": 0
      }
    },
    "Anhydrous Ethanol": {
      "name": "Anhydrous Ethanol",
      "stream_id": "anhydrous ethanol",
      "description": "High-purity ethanol suitable for fuel applications, with minimal water content.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "denaturing",
      "flow_rate": 0.0,
      "components": {
        "ethanol": 0
      }
    },
    "Denaturant": {
      "name": "Denaturant",
      "stream_id": "denaturant",
      "description": "A small amount of gasoline or other chemical added to ethanol.",
      "stream_type": "core",
      "source": "denaturant source",
      "target": "denaturing",
      "flow_rate": 0.0,
      "components": {
        "gasoline": 0
      }
    },
    "Denatured Ethanol": {
      "name": "Denatured Ethanol",
      "stream_id": "denatured ethanol",
      "description": "Ethanol that has been rendered undrinkable by the addition of a denaturant, suitable for use as fuel.",
      "stream_type": "core",
      "source": "denaturing",
      "target": "denatured ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "ethanol": 0,
        "gasoline": 0
      }
    },
    "Chemical Agent": {
      "name": "Chemical Agent",
      "stream_id": "chemical agent",
      "description": "A chemical agent used in the pretreatment process, likely an acid or alkaline solution, which facilitates the breakdown of lignin and disrupts the crystalline structure of cellulose.",
      "stream_type": "aux",
      "source": "chemical agent source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "acid (e.g., sulfuric acid)": 0,
        "alkaline (e.g., sodium hydroxide)": 0
      }
    },
    "Microbial Culture": {
      "name": "Microbial Culture",
      "stream_id": "microbial culture",
      "description": "The microbial culture stream includes the yeast or genetically engineered bacteria necessary for the fermentation process. These microbes are responsible for converting fermentable sugars into ethanol.",
      "stream_type": "aux",
      "source": "microbial culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "microbial cells": 0,
        "yeast": 0,
        "bacteria": 0
      }
    }
  },
  "components": {
    "cellulose": {
      "name": "cellulose",
      "properties": {}
    },
    "hemicellulose": {
      "name": "hemicellulose",
      "properties": {}
    },
    "lignin": {
      "name": "lignin",
      "properties": {}
    },
    "moisture": {
      "name": "moisture",
      "properties": {}
    },
    "solubilized lignin": {
      "name": "solubilized lignin",
      "properties": {}
    },
    "cellulase": {
      "name": "cellulase",
      "properties": {}
    },
    "hemicellulase": {
      "name": "hemicellulase",
      "properties": {}
    },
    "glucose": {
      "name": "glucose",
      "properties": {}
    },
    "xylose": {
      "name": "xylose",
      "properties": {}
    },
    "residual lignin": {
      "name": "residual lignin",
      "properties": {}
    },
    "ethanol": {
      "name": "ethanol",
      "properties": {}
    },
    "water": {
      "name": "water",
      "properties": {}
    },
    "biomass": {
      "name": "biomass",
      "properties": {}
    },
    "gasoline": {
      "name": "gasoline",
      "properties": {}
    },
    "acid (e.g., sulfuric acid)": {
      "name": "acid (e.g., sulfuric acid)",
      "properties": {}
    },
    "alkaline (e.g., sodium hydroxide)": {
      "name": "alkaline (e.g., sodium hydroxide)",
      "properties": {}
    },
    "microbial cells": {
      "name": "microbial cells",
      "properties": {}
    },
    "yeast": {
      "name": "yeast",
      "properties": {}
    },
    "bacteria": {
      "name": "bacteria",
      "properties": {}
    }
  }
}