{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Primarily composed of cellulose (35-40%), hemicellulose (25-30%), and lignin (15-20%)",
      "key_specs": "Moisture content typically around 10-15%. Requires pretreatment to break down lignocellulosic structure.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "Primarily ethanol with minor impurities such as water and trace organic compounds",
      "key_specs": "Fuel-grade ethanol with a purity of at least 99.5% by volume. Must meet ASTM D4806 specifications for denatured fuel ethanol.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover, which is primarily composed of cellulose, hemicellulose, and lignin, is initially collected and transported to the processing facility. Here, it undergoes size reduction using mechanical milling to increase the surface area, facilitating more effective subsequent pretreatment. The moisture content of the stover is adjusted to optimal levels for the pretreatment process.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Prepared Corn Stover"
      ],
      "parameters": {},
      "additional_info": "Size reduction is crucial for enhancing the efficiency of the pretreatment process."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The prepared corn stover is subjected to a pretreatment process, typically using dilute acid hydrolysis. This step is essential to break down the lignocellulosic structure, making the cellulose and hemicellulose more accessible for enzymatic hydrolysis. The pretreatment also helps in removing lignin and other inhibitors that could affect downstream processes.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Prepared Corn Stover",
        "Dilute Acid Solution"
      ],
      "output_streams": [
        "Pretreated Biomass",
        "Lignin-rich Stream"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Hemicellulose is hydrolyzed into soluble sugars such as xylose through the action of dilute acid, which significantly enhances the availability of these sugars for fermentation.",
            "inputComponent": "hemicellulose",
            "outputComponent": "soluble sugars",
            "conversionRate": 0.7
          },
          {
            "description": "A minor portion of cellulose is partially hydrolyzed into soluble sugars due to the dilute acid, although most remains intact for further processing.",
            "inputComponent": "cellulose",
            "outputComponent": "soluble sugars",
            "conversionRate": 0.1
          }
        ]
      },
      "additional_info": "The choice of acid and concentration is critical to maximize sugar yield while minimizing degradation."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass is subjected to enzymatic hydrolysis. Enzymes such as cellulases and hemicellulases are added to convert the cellulose and hemicellulose into fermentable sugars, primarily glucose and xylose. This step is crucial for maximizing sugar yield, which directly impacts ethanol production efficiency.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Hydrolyzed Slurry"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Cellulose in the pretreated biomass is broken down by cellulase enzymes into glucose.",
            "inputComponent": "cellulose",
            "outputComponent": "glucose",
            "conversionRate": 0.9
          },
          {
            "description": "Hemicellulose is broken down by hemicellulase enzymes into xylose.",
            "inputComponent": "hemicellulose",
            "outputComponent": "xylose",
            "conversionRate": 0.8
          }
        ]
      },
      "additional_info": "Enzyme loading and reaction time are optimized for cost-effectiveness and yield."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The hydrolyzed slurry is transferred to fermentation tanks where microorganisms, typically yeast, are used to convert the fermentable sugars into ethanol and carbon dioxide. This biological process is the core of ethanol production, and conditions are carefully controlled to maximize ethanol yield and minimize by-product formation.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Hydrolyzed Slurry",
        "Yeast Culture"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Conversion of glucose to ethanol and carbon dioxide by yeast during fermentation.",
            "inputComponent": "glucose",
            "outputComponent": "ethanol",
            "conversionRate": 0.9
          },
          {
            "description": "Conversion of glucose to carbon dioxide by yeast during fermentation.",
            "inputComponent": "glucose",
            "outputComponent": "carbon dioxide",
            "conversionRate": 0.9
          },
          {
            "description": "Conversion of xylose to ethanol by genetically modified yeast during fermentation.",
            "inputComponent": "xylose",
            "outputComponent": "ethanol",
            "conversionRate": 0.6
          },
          {
            "description": "Conversion of xylose to carbon dioxide by genetically modified yeast during fermentation.",
            "inputComponent": "xylose",
            "outputComponent": "carbon dioxide",
            "conversionRate": 0.6
          }
        ]
      },
      "additional_info": "Fermentation is typically carried out in anaerobic conditions to optimize ethanol production."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "The fermentation broth is subjected to distillation to separate ethanol from water and other components. This step involves heating the broth to vaporize ethanol, which is then condensed and collected as a concentrated product. The distillation process is designed to achieve fuel-grade ethanol purity.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of ethanol from fermentation broth through distillation based on boiling point differences.",
            "component": "ethanol",
            "extractionRate": 0.95
          },
          {
            "description": "Separation of water from fermentation broth during ethanol distillation.",
            "component": "water",
            "extractionRate": 0.2
          }
        ]
      },
      "additional_info": "Energy integration is crucial in distillation to reduce operational costs."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The crude ethanol is further purified through a dehydration process, often using molecular sieves or azeotropic distillation, to remove residual water and achieve the required purity of at least 99.5% ethanol by volume. This step ensures the ethanol meets fuel-grade specifications.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Fuel-Grade Ethanol"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Dehydration via Molecular Sieves or Azeotropic Distillation to remove water from crude ethanol.",
            "component": "water",
            "extractionRate": 1.0
          }
        ]
      },
      "additional_info": "The choice of dehydration technology impacts both the capital and operational costs."
    },
    "waste_management": {
      "unit_operation_id": "waste_management",
      "name": "Waste Management",
      "description": "This unit operation involves the treatment and disposal of waste streams generated throughout the process, including stillage and any solid residues. The waste management system is designed to minimize environmental impact and may include anaerobic digestion to recover energy or nutrients from the waste.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [
        "Treated Waste"
      ],
      "parameters": {},
      "additional_info": "Waste management strategies are critical for sustainability and regulatory compliance."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is collected directly from agricultural fields. The stream primarily consists of cellulose, hemicellulose, lignin, and moisture, making it a critical feedstock for subsequent processing steps in the production of ethanol. The raw corn stover typically has a moisture content of 10-15% and requires pretreatment to break down its lignocellulosic structure for efficient conversion into fermentable sugars.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "dilute acid solution source": {
      "unit_operation_id": "dilute acid solution source",
      "name": "Dilute Acid Solution Source",
      "description": "This unit operation serves as a source for the Dilute Acid Solution, which is essential for the pretreatment of biomass in the ethanol production process. The solution is primarily composed of an acid and water, and it plays a critical role in breaking down the lignocellulosic structure of the feedstock, enhancing the accessibility of cellulose and hemicellulose for subsequent enzymatic hydrolysis. The unit operation is designed to supply the required volume of dilute acid solution at an industrial scale, ensuring consistent and efficient pretreatment.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Dilute Acid Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which is a crucial input for the enzymatic hydrolysis process in the production of ethanol from biomass. The Enzyme Solution consists of cellulase and hemicellulase enzymes dissolved in water, facilitating the breakdown of complex carbohydrates into fermentable sugars. This source is designed to provide a consistent and controlled supply of the enzyme solution at the required concentration and flow rate for optimal enzymatic activity.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "yeast culture source": {
      "unit_operation_id": "yeast culture source",
      "name": "Yeast Culture Source",
      "description": "This unit operation serves as the source for the Yeast Culture stream, which is essential for the fermentation process in ethanol production. The Yeast Culture consists primarily of yeast and water, providing the necessary microorganisms to convert sugars from the hydrolyzed slurry into ethanol. This operation ensures a consistent supply of active yeast culture, maintaining optimal fermentation conditions and enhancing the efficiency of the overall process.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Yeast Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "fuel_grade ethanol sink": {
      "unit_operation_id": "fuel_grade ethanol sink",
      "name": "Fuel-Grade Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Fuel-Grade Ethanol stream, which is produced through the dehydration of crude ethanol. The sink ensures that the high-purity ethanol, meeting ASTM D4806 specifications, is collected and stored for distribution as a fuel. The operation is designed to handle a volumetric scale of 40 million gallons per year, ensuring efficient management of the output stream while maintaining the quality and purity of the ethanol.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Fuel-Grade Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "treated waste sink": {
      "unit_operation_id": "treated waste sink",
      "name": "Treated Waste Sink",
      "description": "This unit operation serves as the final sink for the treated waste stream generated from the Waste Management unit operation. The Treated Waste consists primarily of water and biomass, which are by-products of the ethanol production process. This sink is designed to handle the disposal or potential further utilization of the treated waste, ensuring compliance with environmental regulations and optimizing resource recovery.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Treated Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "lignin_rich stream sink": {
      "unit_operation_id": "lignin_rich stream sink",
      "name": "Lignin-rich Stream Sink",
      "description": "The Lignin-rich Stream Sink serves as the terminus for the lignin-rich stream generated during the pretreatment process. This stream contains lignin, soluble inhibitors, and water, which are by-products of the acid hydrolysis of biomass. The unit operation is designed to collect and manage this stream, ensuring that the lignin and soluble components are properly handled, either for further processing, disposal, or as a feed for other applications. This sink plays a critical role in waste management and resource recovery in the overall process.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Lignin-rich Stream"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Corn stover as collected from agricultural fields, containing cellulose, hemicellulose, lignin, and moisture.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "lignin": 0,
        "water": 0
      }
    },
    "Prepared Corn Stover": {
      "name": "Prepared Corn Stover",
      "stream_id": "prepared corn stover",
      "description": "Corn stover that has been milled and adjusted for moisture content, ready for pretreatment.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "lignin": 0,
        "water": 0
      }
    },
    "Dilute Acid Solution": {
      "name": "Dilute Acid Solution",
      "stream_id": "dilute acid solution",
      "description": "A solution used to facilitate the breakdown of lignocellulosic material.",
      "stream_type": "core",
      "source": "dilute acid solution source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "acid": 0,
        "water": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with disrupted lignocellulosic structure, containing soluble sugars and residual solids.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "cellulose": 0,
        "hemicellulose": 0,
        "soluble sugars": 0,
        "lignin": 0,
        "water": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulase and hemicellulase enzymes.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "cellulase": 0,
        "hemicellulase": 0,
        "water": 0
      }
    },
    "Hydrolyzed Slurry": {
      "name": "Hydrolyzed Slurry",
      "stream_id": "hydrolyzed slurry",
      "description": "A slurry containing fermentable sugars, residual solids, and lignin.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "glucose": 0,
        "xylose": 0,
        "lignin": 0,
        "water": 0
      }
    },
    "Yeast Culture": {
      "name": "Yeast Culture",
      "stream_id": "yeast culture",
      "description": "A culture of yeast used for fermenting sugars into ethanol.",
      "stream_type": "core",
      "source": "yeast culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "yeast": 0,
        "water": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, water, unfermented sugars, and biomass.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "ethanol": 0,
        "water": 0,
        "carbon dioxide": 0,
        "biomass": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "Ethanol with impurities, primarily water, requiring further purification.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "ethanol": 0,
        "water": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "Residue from distillation containing water, unfermented sugars, and biomass.",
      "stream_type": "core",
      "source": "distillation",
      "target": "waste_management",
      "flow_rate": 0.0,
      "components": {
        "water": 0,
        "biomass": 0
      }
    },
    "Fuel-Grade Ethanol": {
      "name": "Fuel-Grade Ethanol",
      "stream_id": "fuel_grade ethanol",
      "description": "High-purity ethanol suitable for use as a fuel, meeting ASTM D4806 specifications.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "fuel_grade ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "ethanol": 0
      }
    },
    "Treated Waste": {
      "name": "Treated Waste",
      "stream_id": "treated waste",
      "description": "Processed waste ready for disposal or further use.",
      "stream_type": "core",
      "source": "waste_management",
      "target": "treated waste sink",
      "flow_rate": 0.0,
      "components": {
        "water": 0,
        "biomass": 0
      }
    },
    "Lignin-rich Stream": {
      "name": "Lignin-rich Stream",
      "stream_id": "lignin_rich stream",
      "description": "During the pretreatment process, lignin is partially removed from the biomass. This stream represents the lignin and other soluble components that are extracted and separated during the acid hydrolysis process.",
      "stream_type": "aux",
      "source": "pretreatment",
      "target": "lignin_rich stream sink",
      "flow_rate": 0.0,
      "components": {
        "lignin": 0,
        "soluble inhibitors": 0,
        "water": 0
      }
    }
  },
  "components": {
    "cellulose": {
      "name": "cellulose",
      "properties": {}
    },
    "hemicellulose": {
      "name": "hemicellulose",
      "properties": {}
    },
    "lignin": {
      "name": "lignin",
      "properties": {}
    },
    "water": {
      "name": "water",
      "properties": {}
    },
    "acid": {
      "name": "acid",
      "properties": {}
    },
    "soluble sugars": {
      "name": "soluble sugars",
      "properties": {}
    },
    "cellulase": {
      "name": "cellulase",
      "properties": {}
    },
    "hemicellulase": {
      "name": "hemicellulase",
      "properties": {}
    },
    "glucose": {
      "name": "glucose",
      "properties": {}
    },
    "xylose": {
      "name": "xylose",
      "properties": {}
    },
    "yeast": {
      "name": "yeast",
      "properties": {}
    },
    "ethanol": {
      "name": "ethanol",
      "properties": {}
    },
    "carbon dioxide": {
      "name": "carbon dioxide",
      "properties": {}
    },
    "biomass": {
      "name": "biomass",
      "properties": {}
    },
    "soluble inhibitors": {
      "name": "soluble inhibitors",
      "properties": {}
    }
  }
}