{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Cellulose (35-40%), Hemicellulose (25-30%), Lignin (15-20%), Ash (5-10%), Moisture (10-15%)",
      "key_specs": "Lignocellulosic biomass, typically requires pretreatment to break down cellulose and hemicellulose into fermentable sugars.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "Ethanol (C2H5OH) with typical purity of 99.5% for fuel-grade ethanol",
      "key_specs": "Fuel-grade ethanol, must meet ASTM D4806 specifications for use as a biofuel, including water content, acidity, and purity.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover, a lignocellulosic biomass, is first collected and transported to the processing facility. Here, it undergoes size reduction through mechanical milling to increase the surface area, which is crucial for the subsequent pretreatment step. The reduced size facilitates better penetration of chemicals used in pretreatment, enhancing the breakdown of cellulose and hemicellulose.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Milled Corn Stover"
      ],
      "parameters": {},
      "additional_info": "The milling process is energy-intensive and requires optimization to balance energy use and particle size reduction."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The milled corn stover is subjected to a pretreatment process to break down the lignin structure and make cellulose and hemicellulose more accessible for enzymatic hydrolysis. This is typically achieved using dilute acid hydrolysis, where the biomass is treated with a dilute acid solution under controlled conditions. This step is critical for increasing the yield of fermentable sugars in the subsequent hydrolysis step.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Milled Corn Stover",
        "Dilute Acid Solution"
      ],
      "output_streams": [
        "Pretreated Biomass",
        "Lignin-Rich Residue"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The dilute acid hydrolysis process where hemicellulose is partially decomposed into sugars and lignin structure is disrupted.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Sugars",
            "conversionRate": 0.7
          },
          {
            "description": "The process that results in the partial breakdown of lignin into soluble lignin components during hydrolysis.",
            "inputComponent": "Lignin",
            "outputComponent": "Soluble Lignin",
            "conversionRate": 0.1
          }
        ]
      },
      "additional_info": "The choice of acid and reaction conditions are crucial to minimize sugar degradation and inhibitor formation."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass is mixed with a cocktail of cellulase and hemicellulase enzymes. These enzymes catalyze the breakdown of cellulose and hemicellulose into fermentable sugars, primarily glucose and xylose. This step is conducted in a bioreactor where conditions are optimized for enzyme activity and sugar yield.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Cocktail"
      ],
      "output_streams": [
        "Sugar-Rich Hydrolysate"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Cellulose in pretreated biomass is converted into glucose through enzymatic hydrolysis.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.8
          },
          {
            "description": "Hemicellulose present in the pretreated biomass is hydrolyzed into xylose by enzymes.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "Enzyme costs are a significant factor in the economics of the process, and enzyme recycling strategies may be employed."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The sugar-rich hydrolysate is transferred to a fermentation vessel where it is inoculated with a strain of yeast, typically Saccharomyces cerevisiae, engineered to ferment both glucose and xylose into ethanol. The fermentation process converts the sugars into ethanol and carbon dioxide under anaerobic conditions.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Sugar-Rich Hydrolysate",
        "Yeast Culture"
      ],
      "output_streams": [
        "Fermentation Broth",
        "Carbon Dioxide"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Conversion of Glucose into Ethanol and Carbon Dioxide through fermentation",
            "inputComponent": "Glucose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.85
          },
          {
            "description": "Conversion of Glucose into Carbon Dioxide through fermentation",
            "inputComponent": "Glucose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.85
          },
          {
            "description": "Conversion of Xylose into Ethanol and Carbon Dioxide through fermentation",
            "inputComponent": "Xylose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.7
          },
          {
            "description": "Conversion of Xylose into Carbon Dioxide through fermentation",
            "inputComponent": "Xylose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "The fermentation process is monitored to optimize ethanol yield and minimize by-product formation."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "The fermentation broth is subjected to distillation to separate ethanol from the mixture. The distillation process involves heating the broth to vaporize ethanol, which is then condensed and collected as a concentrated ethanol stream. This step is essential for achieving the high purity required for fuel-grade ethanol.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Ethanol is vaporized from the fermentation broth due to its lower boiling point and condensed to form crude ethanol.",
            "component": "Ethanol",
            "extractionRate": 0.9
          },
          {
            "description": "A small portion of water is co-extracted with ethanol during the distillation process, leading to a minor presence in the crude ethanol stream.",
            "component": "Water",
            "extractionRate": 0.1
          },
          {
            "description": "Yeast remains in the stillage as it does not vaporize during the distillation process.",
            "component": "Yeast",
            "extractionRate": 0.0
          },
          {
            "description": "Residual sugars are also non-volatile and remain with the stillage after distillation.",
            "component": "Residual Sugars",
            "extractionRate": 0.0
          }
        ]
      },
      "additional_info": "Energy integration strategies are often employed to reduce the energy consumption of the distillation process."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The crude ethanol is further dehydrated to remove residual water and achieve the desired purity of 99.5% for fuel-grade ethanol. This is typically done using molecular sieves or azeotropic distillation techniques. The dehydration step ensures that the ethanol meets the ASTM D4806 specifications for use as a biofuel.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Fuel-Grade Ethanol"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Dehydration of crude ethanol to remove residual water and increase ethanol purity.",
            "component": "Water",
            "extractionRate": 0.995
          }
        ]
      },
      "additional_info": "The choice of dehydration technology impacts both the capital and operating costs of the process."
    },
    "waste_management": {
      "unit_operation_id": "waste_management",
      "name": "Waste Management",
      "description": "The stillage and other waste streams generated throughout the process are treated and managed. Stillage can be processed to recover valuable by-products or used as animal feed. Wastewater treatment is also necessary to ensure compliance with environmental regulations.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [
        "Treated Wastewater",
        "Animal Feed"
      ],
      "parameters": {
        "separations": [
          {
            "description": "The separation and extraction of water from stillage, removing contaminants to produce treated wastewater.",
            "component": "Water",
            "extractionRate": 0.95
          },
          {
            "description": "The extraction of yeast from the stillage for potential use as animal feed.",
            "component": "Yeast",
            "extractionRate": 0.05
          },
          {
            "description": "The recovery of residual sugars from stillage, aiming to utilize it as animal feed.",
            "component": "Residual Sugars",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "Efficient waste management is crucial for the sustainability and economic viability of the process."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which consists of unprocessed corn stover delivered to the facility. The composition includes cellulose (35-40%), hemicellulose (25-30%), lignin (15-20%), ash (5-10%), and moisture (10-15%). This biomass is essential for subsequent processing steps, including feedstock preparation and pretreatment, to convert it into fermentable sugars for ethanol production.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "dilute acid solution source": {
      "unit_operation_id": "dilute acid solution source",
      "name": "Dilute Acid Solution Source",
      "description": "This unit operation serves as a source for the Dilute Acid Solution, which is a crucial input for the pretreatment process in the conversion of lignocellulosic biomass into fermentable sugars. The solution consists of a mixture of acid and water, designed to effectively break down the structure of the biomass, facilitating the subsequent enzymatic hydrolysis step. The unit operation is designed to produce a consistent supply of dilute acid solution at the required volumetric scale to meet the demands of the pretreatment process.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Dilute Acid Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme cocktail source": {
      "unit_operation_id": "enzyme cocktail source",
      "name": "Enzyme Cocktail Source",
      "description": "This unit operation serves as a source for the Enzyme Cocktail, which is a mixture of cellulase and hemicellulase enzymes. These enzymes are essential for the enzymatic hydrolysis process, where they break down the pretreated biomass into fermentable sugars. The Enzyme Cocktail is produced in a controlled environment to ensure optimal activity and stability of the enzymes, facilitating efficient conversion of biomass into sugars for subsequent fermentation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Cocktail"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "yeast culture source": {
      "unit_operation_id": "yeast culture source",
      "name": "Yeast Culture Source",
      "description": "This unit operation serves as a source for the Yeast Culture stream, which consists of the yeast species Saccharomyces cerevisiae. This culture is essential for the fermentation process in the production of ethanol from sugar-rich hydrolysate. The Yeast Culture is propagated under controlled conditions to ensure optimal growth and activity, providing a robust inoculum for the fermentation stage of the process.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Yeast Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "fuel_grade ethanol sink": {
      "unit_operation_id": "fuel_grade ethanol sink",
      "name": "Fuel-Grade Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Fuel-Grade Ethanol stream, which consists of ethanol with a purity of 99.5%. It is designed to receive the processed ethanol from the dehydration unit operation, ensuring that the product meets the necessary specifications for use as a biofuel. The sink facilitates the storage and distribution of the ethanol, maintaining quality control and compliance with ASTM D4806 standards.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Fuel-Grade Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "treated wastewater sink": {
      "unit_operation_id": "treated wastewater sink",
      "name": "Treated Wastewater Sink",
      "description": "This unit operation serves as the final sink for the treated wastewater stream, which consists primarily of water that has undergone treatment to remove contaminants. The treated wastewater is suitable for discharge or potential reuse in various applications, ensuring compliance with environmental regulations and sustainability goals.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Treated Wastewater"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "animal feed sink": {
      "unit_operation_id": "animal feed sink",
      "name": "Animal Feed Sink",
      "description": "This unit operation serves as the final sink for the Animal Feed stream, which consists of solid residues containing yeast and residual sugars. The Animal Feed Sink is designed to receive and store the processed solid byproducts from the waste management unit operation. This feed can be utilized as a nutritious supplement for livestock, contributing to sustainable agricultural practices by recycling waste materials from the ethanol production process.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Animal Feed"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "lignin_rich residue sink": {
      "unit_operation_id": "lignin_rich residue sink",
      "name": "Lignin-Rich Residue Sink",
      "description": "This unit operation serves as the sink for the Lignin-Rich Residue stream generated during the pretreatment process. The Lignin-Rich Residue consists primarily of lignin and water, which are separated from the pretreated biomass. This stream is crucial for waste management and potential valorization opportunities, as lignin can be utilized in various applications such as biofuels, bioplastics, or as a feedstock for other chemical processes. The sink ensures that the lignin-rich byproduct is effectively managed and accounted for in the overall process flow.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Lignin-Rich Residue"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "carbon dioxide sink": {
      "unit_operation_id": "carbon dioxide sink",
      "name": "Carbon Dioxide Sink",
      "description": "This unit operation serves as the final sink for carbon dioxide produced during the fermentation process. Carbon dioxide is generated as a byproduct when yeast converts sugars into ethanol. This sink is designed to capture and manage the carbon dioxide emissions, ensuring that they are either safely vented to the atmosphere or utilized in other processes, thereby minimizing environmental impact.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Carbon Dioxide"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Unprocessed corn stover delivered to the facility.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Milled Corn Stover": {
      "name": "Milled Corn Stover",
      "stream_id": "milled corn stover",
      "description": "Corn stover that has been mechanically milled to a smaller particle size.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Dilute Acid Solution": {
      "name": "Dilute Acid Solution",
      "stream_id": "dilute acid solution",
      "description": "A solution of dilute acid used for pretreatment.",
      "stream_type": "core",
      "source": "dilute acid solution source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Acid": 0,
        "Water": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with disrupted lignin structure, making cellulose and hemicellulose accessible.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Acid": 0,
        "Water": 0
      }
    },
    "Enzyme Cocktail": {
      "name": "Enzyme Cocktail",
      "stream_id": "enzyme cocktail",
      "description": "A mixture of cellulase and hemicellulase enzymes.",
      "stream_type": "core",
      "source": "enzyme cocktail source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0,
        "Hemicellulase": 0
      }
    },
    "Sugar-Rich Hydrolysate": {
      "name": "Sugar-Rich Hydrolysate",
      "stream_id": "sugar_rich hydrolysate",
      "description": "A liquid stream rich in fermentable sugars, primarily glucose and xylose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin": 0,
        "Acid": 0,
        "Water": 0
      }
    },
    "Yeast Culture": {
      "name": "Yeast Culture",
      "stream_id": "yeast culture",
      "description": "A culture of yeast used for fermentation.",
      "stream_type": "core",
      "source": "yeast culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Saccharomyces cerevisiae": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, unfermented sugars, yeast cells, and other by-products.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Carbon Dioxide": 0,
        "Yeast": 0,
        "Water": 0,
        "Residual Sugars": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "A concentrated ethanol stream with impurities.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Water": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "Residue from distillation containing water, yeast, and unfermented sugars.",
      "stream_type": "core",
      "source": "distillation",
      "target": "waste_management",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Yeast": 0,
        "Residual Sugars": 0
      }
    },
    "Fuel-Grade Ethanol": {
      "name": "Fuel-Grade Ethanol",
      "stream_id": "fuel_grade ethanol",
      "description": "Ethanol with a purity of 99.5%, suitable for use as a biofuel.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "fuel_grade ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Treated Wastewater": {
      "name": "Treated Wastewater",
      "stream_id": "treated wastewater",
      "description": "Water that has been treated to remove contaminants.",
      "stream_type": "core",
      "source": "waste_management",
      "target": "treated wastewater sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0
      }
    },
    "Animal Feed": {
      "name": "Animal Feed",
      "stream_id": "animal feed",
      "description": "Solid residues that can be used as animal feed.",
      "stream_type": "core",
      "source": "waste_management",
      "target": "animal feed sink",
      "flow_rate": 0.0,
      "components": {
        "Yeast": 0,
        "Residual Sugars": 0
      }
    },
    "Lignin-Rich Residue": {
      "name": "Lignin-Rich Residue",
      "stream_id": "lignin_rich residue",
      "description": "During the pretreatment process, part of the lignin structure is broken down and potentially separated from the cellulose and hemicellulose. A fraction of this lignin could be separated as a solid or liquid stream, which should be accounted for as it might not be fully incorporated into the pretreated biomass.",
      "stream_type": "aux",
      "source": "pretreatment",
      "target": "lignin_rich residue sink",
      "flow_rate": 0.0,
      "components": {
        "Lignin": 0,
        "Water": 0
      }
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "stream_id": "carbon dioxide",
      "description": "Carbon dioxide is produced as a byproduct of the fermentation process, released from the conversion of sugars (glucose and xylose) to ethanol by the yeast.",
      "stream_type": "aux",
      "source": "fermentation",
      "target": "carbon dioxide sink",
      "flow_rate": 0.0,
      "components": {
        "Carbon Dioxide": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Ash": {
      "name": "Ash",
      "properties": {}
    },
    "Moisture": {
      "name": "Moisture",
      "properties": {}
    },
    "Acid": {
      "name": "Acid",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Hemicellulase": {
      "name": "Hemicellulase",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Saccharomyces cerevisiae": {
      "name": "Saccharomyces cerevisiae",
      "properties": {}
    },
    "Ethanol": {
      "name": "Ethanol",
      "properties": {}
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "properties": {}
    },
    "Yeast": {
      "name": "Yeast",
      "properties": {}
    },
    "Residual Sugars": {
      "name": "Residual Sugars",
      "properties": {}
    }
  }
}