{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Cellulose (35-40%), Hemicellulose (25-30%), Lignin (15-20%), Ash (5-10%), Moisture (5-10%)",
      "key_specs": "Lignocellulosic biomass, typically requires pretreatment to break down cellulose and hemicellulose into fermentable sugars.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "Ethanol (C2H5OH) with trace amounts of water and other impurities",
      "key_specs": "Fuel-grade ethanol, typically 99.5% purity after distillation and dehydration, suitable for blending with gasoline.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover, which is a lignocellulosic biomass, is first collected and transported to the processing facility. In this unit operation, the corn stover is subjected to size reduction using mechanical processes such as milling or grinding. This step is crucial to increase the surface area of the biomass, making it more amenable to subsequent chemical reactions during pretreatment and hydrolysis.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Prepared Corn Stover"
      ],
      "parameters": {},
      "additional_info": "Particle size reduction is typically achieved using hammer mills or knife mills."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The prepared corn stover undergoes a pretreatment process to break down the lignin structure and make cellulose and hemicellulose more accessible for enzymatic hydrolysis. This is typically achieved using chemical methods such as dilute acid pretreatment, where the biomass is treated with a dilute acid solution under controlled conditions. The pretreatment helps in solubilizing hemicellulose and partially depolymerizing lignin, enhancing the digestibility of the biomass.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Prepared Corn Stover",
        "Dilute Acid Solution"
      ],
      "output_streams": [
        "Pretreated Biomass"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Hemicellulose in corn stover undergoes chemical transformation using a dilute acid solution to be hydrolyzed into soluble sugars such as xylose.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Solubilized Hemicellulose",
            "conversionRate": 0.6
          },
          {
            "description": "The lignin structure is partially depolymerized, although it remains primarily as an insoluble, intact component of corn stover.",
            "inputComponent": "Lignin",
            "outputComponent": "Partially Depolymerized Lignin",
            "conversionRate": 0.3
          },
          {
            "description": "The cellulose remains largely unchanged but is made more accessible for subsequent enzymatic hydrolysis processes.",
            "inputComponent": "Cellulose",
            "outputComponent": "Accessible Cellulose",
            "conversionRate": 0.8
          }
        ]
      },
      "additional_info": "Common acids used include sulfuric acid or hydrochloric acid. The process conditions such as temperature and residence time are optimized to maximize sugar yield while minimizing degradation products."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass is subjected to enzymatic hydrolysis where specific enzymes are added to convert cellulose and any remaining hemicellulose into fermentable sugars, primarily glucose and xylose. The enzymes, such as cellulases and hemicellulases, catalyze the breakdown of polysaccharides into monosaccharides, which are essential for the fermentation process.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Mixture"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Cellulose is converted into glucose by the action of enzymes that cleave glycosidic bonds.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.85
          },
          {
            "description": "Solubilized hemicellulose is converted into xylose through enzymatic hydrolysis.",
            "inputComponent": "Solubilized Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "The enzymatic hydrolysis is typically conducted at moderate temperatures and neutral pH to optimize enzyme activity and stability."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The sugar solution obtained from enzymatic hydrolysis is then subjected to fermentation. In this unit operation, microorganisms such as yeast (Saccharomyces cerevisiae) are used to convert the sugars, primarily glucose, into ethanol and carbon dioxide. The fermentation process is carried out under anaerobic conditions, and it is crucial to maintain optimal conditions to maximize ethanol yield and productivity.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Sugar Solution",
        "Yeast Culture"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Fermentation of glucose by yeast to produce ethanol and carbon dioxide.",
            "inputComponent": "Glucose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.9
          },
          {
            "description": "Fermentation of glucose by yeast to produce carbon dioxide.",
            "inputComponent": "Glucose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.9
          },
          {
            "description": "Partial fermentation of xylose by engineered yeast strains to produce ethanol.",
            "inputComponent": "Xylose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.6
          },
          {
            "description": "Partial fermentation of xylose by yeast to produce carbon dioxide.",
            "inputComponent": "Xylose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.6
          }
        ]
      },
      "additional_info": "The fermentation typically lasts for 48-72 hours, and the process is monitored to ensure high ethanol yield and minimal by-product formation."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "The fermentation broth is subjected to distillation to separate ethanol from the mixture. Distillation exploits the difference in boiling points to concentrate ethanol, producing a distillate that is rich in ethanol and a bottoms product that contains water, unfermented sugars, and other impurities. This step is critical to achieving the desired purity of ethanol for fuel applications.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of ethanol from the fermentation broth through distillation.",
            "component": "Ethanol",
            "extractionRate": 0.95
          },
          {
            "description": "Some portion of water co-distills with ethanol due to azeotropic nature, but most remains in the stillage.",
            "component": "Water",
            "extractionRate": 0.25
          },
          {
            "description": "Unfermented sugars, which are non-volatile, stay largely in the stillage due to higher boiling points.",
            "component": "Unfermented Sugars",
            "extractionRate": 0.05
          },
          {
            "description": "Yeast biomass remains as part of the stillage since it does not vaporize easily.",
            "component": "Yeast Biomass",
            "extractionRate": 0.01
          }
        ]
      },
      "additional_info": "The distillation process typically involves multiple stages or columns to achieve the desired ethanol concentration."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The crude ethanol obtained from distillation is further dehydrated to remove residual water and achieve fuel-grade ethanol purity. This is typically done using molecular sieves or membrane separation technologies, which selectively remove water from the ethanol-water mixture, resulting in anhydrous ethanol suitable for blending with gasoline.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Anhydrous Ethanol"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Selective removal of water from the crude ethanol stream using molecular sieves or membrane separation technologies to produce high-purity anhydrous ethanol.",
            "component": "Water",
            "extractionRate": 0.99
          },
          {
            "description": "Remaining ethanol after the dehydration process, which is minimally extracted compared to water.",
            "component": "Ethanol",
            "extractionRate": 0.01
          }
        ]
      },
      "additional_info": "Fuel-grade ethanol typically requires a purity of 99.5% or higher. Molecular sieves are commonly used due to their high efficiency in water removal."
    },
    "waste_treatment": {
      "unit_operation_id": "waste_treatment",
      "name": "Waste Treatment",
      "description": "The waste streams generated from the process, including stillage and any other by-products, are treated in this unit operation. The treatment may involve anaerobic digestion to produce biogas, or other methods to recover valuable components or safely dispose of waste. This step is essential to minimize environmental impact and improve the sustainability of the process.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [
        "Treated Waste"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "The anaerobic digestion of unfermented sugars present in the stillage results in the production of biogas, primarily methane and carbon dioxide.",
            "inputComponent": "Unfermented Sugars",
            "outputComponent": "Biogas",
            "conversionRate": 0.75
          },
          {
            "description": "The anaerobic degradation of yeast biomass contributes to biogas formation, with some cellular materials remaining in the form of residual solids.",
            "inputComponent": "Yeast Biomass",
            "outputComponent": "Biogas",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "Anaerobic digestion can convert organic waste into biogas, which can be used as a renewable energy source."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is collected from agricultural fields. The stream consists of a mixture of cellulose, hemicellulose, lignin, ash, and moisture, making it a lignocellulosic biomass feedstock. It is essential for the subsequent processing steps in the ethanol production pathway, providing the necessary carbohydrates that will be converted into fermentable sugars.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "dilute acid solution source": {
      "unit_operation_id": "dilute acid solution source",
      "name": "Dilute Acid Solution Source",
      "description": "This unit operation serves as a source for the Dilute Acid Solution, which is essential for the pretreatment of biomass in the ethanol production process. The solution consists primarily of water and a specific acid, which aids in breaking down the lignocellulosic structure of the biomass, facilitating the subsequent enzymatic hydrolysis step. The unit operation is designed to produce a consistent flow of dilute acid solution at the required concentration and volume to meet the demands of the pretreatment unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Dilute Acid Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme mixture source": {
      "unit_operation_id": "enzyme mixture source",
      "name": "Enzyme Mixture Source",
      "description": "This unit operation serves as a source for the Enzyme Mixture, which is a critical component in the enzymatic hydrolysis process. The Enzyme Mixture contains cellulases and hemicellulases, which are specialized enzymes that catalyze the breakdown of cellulose and hemicellulose into fermentable sugars. This operation ensures a consistent and controlled supply of the enzyme mixture necessary for efficient conversion of pretreated biomass into sugar solution, ultimately facilitating the production of ethanol.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Mixture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "yeast culture source": {
      "unit_operation_id": "yeast culture source",
      "name": "Yeast Culture Source",
      "description": "This unit operation serves as the source for the Yeast Culture stream, which contains the microorganism Saccharomyces cerevisiae. This yeast is essential for the fermentation process, converting sugars from the Sugar Solution into ethanol. The Yeast Culture is maintained under optimal conditions to ensure high viability and fermentation efficiency.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Yeast Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "anhydrous ethanol sink": {
      "unit_operation_id": "anhydrous ethanol sink",
      "name": "Anhydrous Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Anhydrous Ethanol stream, which is a high-purity ethanol suitable for fuel applications. The Anhydrous Ethanol is collected here after the dehydration process, ensuring that it meets the required specifications for fuel-grade ethanol, typically achieving a purity of 99.5% or higher. This sink is critical for the storage and distribution of the final product, facilitating its transfer to storage tanks or blending facilities.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Anhydrous Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "treated waste sink": {
      "unit_operation_id": "treated waste sink",
      "name": "Treated Waste Sink",
      "description": "This unit operation serves as the final sink for the treated waste stream, which consists of biogas and residual solids. The treated waste has undergone a waste treatment process to minimize its environmental impact, ensuring that the biogas can be captured for energy recovery while the residual solids are managed appropriately. This sink is critical for the safe disposal or further utilization of waste materials generated from the ethanol production process.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Treated Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "Collected corn stover from agricultural fields.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Prepared Corn Stover": {
      "name": "Prepared Corn Stover",
      "stream_id": "prepared corn stover",
      "description": "Corn stover that has been mechanically processed to reduce particle size.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Dilute Acid Solution": {
      "name": "Dilute Acid Solution",
      "stream_id": "dilute acid solution",
      "description": "A dilute acid solution used for pretreatment.",
      "stream_type": "core",
      "source": "dilute acid solution source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Acid": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with disrupted lignin structure and solubilized hemicellulose.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Solubilized Hemicellulose": 0,
        "Lignin": 0,
        "Acid": 0,
        "Water": 0
      }
    },
    "Enzyme Mixture": {
      "name": "Enzyme Mixture",
      "stream_id": "enzyme mixture",
      "description": "A mixture of enzymes used to hydrolyze cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzyme mixture source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulases": 0,
        "Hemicellulases": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution containing fermentable sugars derived from cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin": 0,
        "Acid": 0,
        "Water": 0
      }
    },
    "Yeast Culture": {
      "name": "Yeast Culture",
      "stream_id": "yeast culture",
      "description": "Microorganisms used for fermenting sugars into ethanol.",
      "stream_type": "core",
      "source": "yeast culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Saccharomyces cerevisiae": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, unfermented sugars, biomass, and other by-products.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Carbon Dioxide": 0,
        "Unfermented Sugars": 0,
        "Yeast Biomass": 0,
        "Water": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "A distillate containing concentrated ethanol with some impurities.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Water": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "A bottoms product containing water, unfermented sugars, and other impurities.",
      "stream_type": "core",
      "source": "distillation",
      "target": "waste_treatment",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Unfermented Sugars": 0,
        "Yeast Biomass": 0
      }
    },
    "Anhydrous Ethanol": {
      "name": "Anhydrous Ethanol",
      "stream_id": "anhydrous ethanol",
      "description": "High-purity ethanol suitable for fuel applications.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "anhydrous ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Treated Waste": {
      "name": "Treated Waste",
      "stream_id": "treated waste",
      "description": "Waste that has been processed to reduce environmental impact.",
      "stream_type": "core",
      "source": "waste_treatment",
      "target": "treated waste sink",
      "flow_rate": 0.0,
      "components": {
        "Biogas": 0,
        "Residual Solids": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Ash": {
      "name": "Ash",
      "properties": {}
    },
    "Moisture": {
      "name": "Moisture",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Acid": {
      "name": "Acid",
      "properties": {}
    },
    "Solubilized Hemicellulose": {
      "name": "Solubilized Hemicellulose",
      "properties": {}
    },
    "Cellulases": {
      "name": "Cellulases",
      "properties": {}
    },
    "Hemicellulases": {
      "name": "Hemicellulases",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Saccharomyces cerevisiae": {
      "name": "Saccharomyces cerevisiae",
      "properties": {}
    },
    "Ethanol": {
      "name": "Ethanol",
      "properties": {}
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "properties": {}
    },
    "Unfermented Sugars": {
      "name": "Unfermented Sugars",
      "properties": {}
    },
    "Yeast Biomass": {
      "name": "Yeast Biomass",
      "properties": {}
    },
    "Biogas": {
      "name": "Biogas",
      "properties": {}
    },
    "Residual Solids": {
      "name": "Residual Solids",
      "properties": {}
    }
  }
}