{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Cellulose (35-40%), Hemicellulose (25-30%), Lignin (15-20%), Ash (5-10%), Moisture (5-10%)",
      "key_specs": "Lignocellulosic biomass, typically requires pretreatment to enhance digestibility and accessibility of sugars for fermentation.",
      "volumetric_scale": "100,000 kg/day"
    }
  ],
  "products": [
    {
      "name": "Acetoin",
      "composition": "C4H8O2",
      "key_specs": "Purity > 95%, suitable for use in food flavoring, fragrance, and as a chemical intermediate. Typically requires downstream purification to achieve commercial-grade specifications.",
      "volumetric_scale": "10,000 kg/day"
    }
  ],
  "unit_operations": {
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The pretreatment unit operation is designed to break down the complex structure of corn stover, which is a lignocellulosic biomass. This step is crucial to enhance the digestibility and accessibility of cellulose and hemicellulose for subsequent enzymatic hydrolysis. The pretreatment process typically involves physical, chemical, or a combination of methods such as steam explosion, acid hydrolysis, or alkaline treatment to disrupt the lignin structure and increase the porosity of the biomass.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Pretreated Biomass"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Lignin disruption through pretreatment increases the biomass's porosity and surface area, making cellulose and hemicellulose more accessible for further processing.",
            "component": "Lignin",
            "extractionRate": 0.6
          }
        ]
      },
      "additional_info": "The choice of pretreatment method can significantly impact the efficiency of downstream processes and the overall economics of the process."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass undergoes enzymatic hydrolysis to convert cellulose and hemicellulose into fermentable sugars. Enzymes such as cellulases and hemicellulases are used to catalyze the breakdown of polysaccharides into monosaccharides like glucose and xylose. This step is critical for maximizing sugar yield, which directly influences the fermentation efficiency.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Hydrolysate"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Cellulose in the pretreated biomass is hydrolyzed by cellulases into glucose.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.9
          },
          {
            "description": "Hemicellulose is hydrolyzed by hemicellulases into xylose and other minor sugars.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "The efficiency of enzymatic hydrolysis is influenced by factors such as enzyme loading, reaction time, and the presence of inhibitors."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The fermentation unit operation involves the anaerobic conversion of sugars into acetoin by specific bacterial strains. This biological process is carried out in a bioreactor where conditions such as pH, temperature, and nutrient supply are controlled to optimize bacterial growth and product yield. The bacteria metabolize glucose and xylose to produce acetoin as the primary product.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Hydrolysate",
        "Bacterial Inoculum"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Glucose is metabolized by specific bacterial strains under anaerobic conditions to yield acetoin. The process occurs in a bioreactor where environmental conditions are controlled to promote the growth of bacteria and the conversion of sugars.",
            "inputComponent": "Glucose",
            "outputComponent": "Acetoin",
            "conversionRate": 0.5
          },
          {
            "description": "Xylose undergoes anaerobic fermentation by bacteria, where it is converted to acetoin. This transformation is part of the overall fermentation process, contributing to the production of the desired end product.",
            "inputComponent": "Xylose",
            "outputComponent": "Acetoin",
            "conversionRate": 0.2
          }
        ]
      },
      "additional_info": "The choice of bacterial strain and fermentation conditions are critical for maximizing acetoin yield and minimizing by-products."
    },
    "cell_separation": {
      "unit_operation_id": "cell_separation",
      "name": "Cell Separation",
      "description": "In this unit operation, the bacterial cells and other solid residues are separated from the fermentation broth. This is typically achieved using centrifugation or filtration techniques. The separation of biomass is essential to facilitate the downstream purification of acetoin.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Cell-Free Broth",
        "Biomass Waste"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of acetoin and other soluble components from bacterial biomass and solid residues using centrifugation or filtration.",
            "component": "Acetoin",
            "extractionRate": 0.95
          },
          {
            "description": "Separation of residual sugars from bacterial biomass and solid residues using centrifugation or filtration.",
            "component": "Residual sugars",
            "extractionRate": 0.9
          },
          {
            "description": "Collection of bacterial biomass as waste material from the fermentation broth through separation techniques.",
            "component": "Bacterial biomass",
            "extractionRate": 0.05
          },
          {
            "description": "Water separation from the fermentation broth during the centrifugation or filtration process.",
            "component": "Water",
            "extractionRate": 0.98
          }
        ]
      },
      "additional_info": "The separated biomass can be further processed for nutrient recovery or disposed of according to environmental regulations."
    },
    "acetoin_recovery": {
      "unit_operation_id": "acetoin_recovery",
      "name": "Acetoin Recovery",
      "description": "This unit operation focuses on the recovery of acetoin from the cell-free broth. Techniques such as distillation or solvent extraction are employed to concentrate and isolate acetoin from the mixture. The goal is to achieve a high-purity acetoin product suitable for commercial applications.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Cell-Free Broth"
      ],
      "output_streams": [
        "Crude Acetoin",
        "Aqueous Waste"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Extraction of Acetoin from the Cell-Free Broth into the Crude Acetoin stream, using distillation or solvent extraction techniques.",
            "component": "Acetoin",
            "extractionRate": 0.9
          },
          {
            "description": "Removal of residual sugars present in the Cell-Free Broth into the Aqueous Waste stream, aiming to minimize acetoin loss.",
            "component": "Residual sugars",
            "extractionRate": 0.05
          },
          {
            "description": "Extraction of water from the Cell-Free Broth into the Aqueous Waste stream, ensuring high purification of acetoin.",
            "component": "Water",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "The choice of recovery method impacts the purity and yield of acetoin, as well as the energy consumption of the process."
    },
    "purification": {
      "unit_operation_id": "purification",
      "name": "Purification",
      "description": "The purification unit operation is designed to refine the crude acetoin to meet commercial-grade specifications. This step may involve additional distillation, crystallization, or adsorption techniques to remove impurities and achieve the desired purity level of over 95%.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Acetoin"
      ],
      "output_streams": [
        "Purified Acetoin",
        "Impurity Waste"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of acetoin from impurities using distillation, crystallization, or adsorption techniques to enhance purity.",
            "component": "Acetoin",
            "extractionRate": 0.95
          },
          {
            "description": "Removal of unwanted materials from the crude acetoin stream, which involves targeting specific impurities through separation methods.",
            "component": "Impurities",
            "extractionRate": 0.05
          }
        ]
      },
      "additional_info": "The final purity of acetoin is crucial for its market value and application potential, making this step vital for the economic viability of the process."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is the initial feedstock in the process. It consists of lignocellulosic biomass primarily composed of cellulose, hemicellulose, lignin, ash, and moisture. The raw corn stover requires pretreatment to enhance the digestibility and accessibility of sugars for subsequent enzymatic hydrolysis and fermentation processes.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which contains cellulases and hemicellulases suspended in water. The enzyme solution is critical for the enzymatic hydrolysis process, where it catalyzes the breakdown of polysaccharides present in pretreated biomass into fermentable sugars. The operation is designed to produce the required volumetric scale of enzyme solution to support the downstream enzymatic hydrolysis unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "bacterial inoculum source": {
      "unit_operation_id": "bacterial inoculum source",
      "name": "Bacterial Inoculum Source",
      "description": "This unit operation serves as a source for the Bacterial Inoculum stream, which consists of a culture of bacteria, nutrients, and water. The Bacterial Inoculum is essential for the fermentation process, where the bacteria convert sugars derived from the hydrolysate into acetoin under anaerobic conditions. This stream is crucial for maintaining the efficiency and productivity of the fermentation unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Bacterial Inoculum"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "biomass waste sink": {
      "unit_operation_id": "biomass waste sink",
      "name": "Biomass Waste Sink",
      "description": "This unit operation serves as a sink for the Biomass Waste stream, which consists of solid waste materials including separated bacterial biomass and lignin fragments. The sink is designed to collect and manage the disposal or further processing of this waste stream, ensuring that it is handled in an environmentally responsible manner. The unit operation may include features for compaction, storage, or preparation for downstream waste treatment processes.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Biomass Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "aqueous waste sink": {
      "unit_operation_id": "aqueous waste sink",
      "name": "Aqueous Waste Sink",
      "description": "This unit operation serves as the sink for the Aqueous Waste stream, which consists of water and residual sugars generated during the acetoin production process. The Aqueous Waste stream can be treated for water recovery or further processed to extract residual sugars, minimizing environmental impact and promoting sustainability in the overall process.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Aqueous Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "purified acetoin sink": {
      "unit_operation_id": "purified acetoin sink",
      "name": "Purified Acetoin Sink",
      "description": "This unit operation serves as the final sink for the purified acetoin stream, which has achieved a purity level greater than 95%. The purified acetoin is suitable for various applications, including food flavoring, fragrance, and as a chemical intermediate. This sink ensures the safe and efficient handling of the purified product, facilitating its transfer to storage or packaging for distribution.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Purified Acetoin"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "impurity waste sink": {
      "unit_operation_id": "impurity waste sink",
      "name": "Impurity Waste Sink",
      "description": "This unit operation serves as a sink for the Impurity Waste stream generated during the purification of crude acetoin. The Impurity Waste stream contains impurities that have been separated from the purified acetoin product. Proper management of this waste stream is essential to minimize environmental impact and ensure compliance with waste disposal regulations.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Impurity Waste"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "The raw lignocellulosic biomass feedstock that needs to be pretreated to enhance sugar accessibility.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with disrupted lignin structure and increased porosity, ready for enzymatic hydrolysis.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin fragments": 0,
        "Ash": 0,
        "Moisture": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulases and hemicellulases to catalyze the hydrolysis of polysaccharides.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulases": 0,
        "Hemicellulases": 0,
        "Water": 0
      }
    },
    "Hydrolysate": {
      "name": "Hydrolysate",
      "stream_id": "hydrolysate",
      "description": "A liquid stream containing fermentable sugars derived from the enzymatic breakdown of cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin fragments": 0,
        "Ash": 0,
        "Water": 0
      }
    },
    "Bacterial Inoculum": {
      "name": "Bacterial Inoculum",
      "stream_id": "bacterial inoculum",
      "description": "A culture of bacteria capable of converting sugars to acetoin under anaerobic conditions.",
      "stream_type": "core",
      "source": "bacterial inoculum source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Bacteria": 0,
        "Nutrients": 0,
        "Water": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing acetoin, unconverted sugars, bacterial biomass, and other fermentation by-products.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "cell_separation",
      "flow_rate": 0.0,
      "components": {
        "Acetoin": 0,
        "Residual sugars": 0,
        "Bacterial biomass": 0,
        "Water": 0
      }
    },
    "Cell-Free Broth": {
      "name": "Cell-Free Broth",
      "stream_id": "cell_free broth",
      "description": "A liquid stream containing acetoin and other soluble components, free from bacterial biomass.",
      "stream_type": "core",
      "source": "cell_separation",
      "target": "acetoin_recovery",
      "flow_rate": 0.0,
      "components": {
        "Acetoin": 0,
        "Residual sugars": 0,
        "Water": 0
      }
    },
    "Biomass Waste": {
      "name": "Biomass Waste",
      "stream_id": "biomass waste",
      "description": "Solid waste stream consisting of separated bacterial cells and other insoluble residues.",
      "stream_type": "core",
      "source": "cell_separation",
      "target": "biomass waste sink",
      "flow_rate": 0.0,
      "components": {
        "Bacterial biomass": 0,
        "Lignin fragments": 0
      }
    },
    "Crude Acetoin": {
      "name": "Crude Acetoin",
      "stream_id": "crude acetoin",
      "description": "A concentrated stream of acetoin, which may still contain impurities and requires further purification.",
      "stream_type": "core",
      "source": "acetoin_recovery",
      "target": "purification",
      "flow_rate": 0.0,
      "components": {
        "Acetoin": 0,
        "Impurities": 0
      }
    },
    "Aqueous Waste": {
      "name": "Aqueous Waste",
      "stream_id": "aqueous waste",
      "description": "A waste stream containing water and residual sugars, which can be treated or recycled.",
      "stream_type": "core",
      "source": "acetoin_recovery",
      "target": "aqueous waste sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Residual sugars": 0
      }
    },
    "Purified Acetoin": {
      "name": "Purified Acetoin",
      "stream_id": "purified acetoin",
      "description": "High-purity acetoin suitable for use in food flavoring, fragrance, and as a chemical intermediate.",
      "stream_type": "core",
      "source": "purification",
      "target": "purified acetoin sink",
      "flow_rate": 0.0,
      "components": {
        "Acetoin": 0
      }
    },
    "Impurity Waste": {
      "name": "Impurity Waste",
      "stream_id": "impurity waste",
      "description": "A waste stream containing impurities removed during the purification process.",
      "stream_type": "core",
      "source": "purification",
      "target": "impurity waste sink",
      "flow_rate": 0.0,
      "components": {
        "Impurities": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Ash": {
      "name": "Ash",
      "properties": {}
    },
    "Moisture": {
      "name": "Moisture",
      "properties": {}
    },
    "Lignin fragments": {
      "name": "Lignin fragments",
      "properties": {}
    },
    "Cellulases": {
      "name": "Cellulases",
      "properties": {}
    },
    "Hemicellulases": {
      "name": "Hemicellulases",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Bacteria": {
      "name": "Bacteria",
      "properties": {}
    },
    "Nutrients": {
      "name": "Nutrients",
      "properties": {}
    },
    "Acetoin": {
      "name": "Acetoin",
      "properties": {}
    },
    "Residual sugars": {
      "name": "Residual sugars",
      "properties": {}
    },
    "Bacterial biomass": {
      "name": "Bacterial biomass",
      "properties": {}
    },
    "Impurities": {
      "name": "Impurities",
      "properties": {}
    }
  }
}