{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Cellulose (35-45%), Hemicellulose (25-35%), Lignin (15-20%), Ash (5-10%)",
      "key_specs": "Lignocellulosic biomass, typically requires pretreatment to break down cellulose and hemicellulose into fermentable sugars.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "C2H5OH (typically 95-99% purity for fuel-grade ethanol)",
      "key_specs": "Fuel-grade ethanol, requires dehydration to achieve high purity, suitable for blending with gasoline.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The pretreatment unit operation is designed to prepare the corn stover for enzymatic hydrolysis. This involves breaking down the lignocellulosic structure to increase the accessibility of cellulose and hemicellulose. Typically, this is achieved through physical, chemical, or a combination of methods such as steam explosion, acid hydrolysis, or alkaline treatment. The goal is to disrupt the lignin structure and partially hydrolyze hemicellulose, making the cellulose more amenable to enzymatic action.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover",
        "Process Water",
        "Acid or Alkali Solution"
      ],
      "output_streams": [
        "Pretreated Biomass",
        "Lignin-Rich Residue"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Hemicellulose is subjected to chemical treatment under acidic or alkaline conditions causing partial depolymerization into sugar oligomers and monomers, which are more accessible for enzymatic hydrolysis.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "hydrolyzed oligomers/monomers",
            "conversionRate": 0.3
          },
          {
            "description": "Lignin-rich residue is generated by separating lignin that is solubilized during the chemical treatment and physical alteration of the biomass, resulting in a concentrated material that can be used in other applications.",
            "inputComponent": "Raw Corn Stover",
            "outputComponent": "Lignin-Rich Residue",
            "conversionRate": 0.6
          },
          {
            "description": "This step involves the extraction of residual ash alongside lignin post pretreatment separation that aids in refining the process outputs further.",
            "inputComponent": "Raw Corn Stover",
            "outputComponent": "Ash",
            "conversionRate": 0.5
          }
        ]
      },
      "additional_info": "The choice of pretreatment method can significantly impact the efficiency of subsequent steps and the overall process economics."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "In this unit operation, the pretreated biomass is subjected to enzymatic hydrolysis to convert cellulose and hemicellulose into fermentable sugars. Enzymes such as cellulases and hemicellulases are added to the biomass slurry, catalyzing the breakdown of polysaccharides into monosaccharides like glucose and xylose. This step is crucial for maximizing sugar yield, which directly influences ethanol production.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Enzymatic hydrolysis of cellulose into glucose facilitated by cellulases.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.8
          },
          {
            "description": "Enzymatic hydrolysis of hemicellulose into xylose facilitated by hemicellulases.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.7
          }
        ]
      },
      "additional_info": "The efficiency of enzymatic hydrolysis is influenced by factors such as enzyme loading, reaction time, and temperature."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The fermentation unit operation involves converting the sugars obtained from enzymatic hydrolysis into ethanol using microorganisms such as yeast or bacteria. The sugar solution is inoculated with the selected microorganism, which metabolizes the sugars, primarily glucose, into ethanol and carbon dioxide. This biological process is key to transforming the chemical energy stored in sugars into ethanol, a valuable biofuel.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Sugar Solution",
        "Microorganism Culture"
      ],
      "output_streams": [
        "Fermentation Broth",
        "Carbon Dioxide"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Yeast converts glucose into ethanol and carbon dioxide through anaerobic fermentation.",
            "inputComponent": "Glucose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.9
          },
          {
            "description": "Yeast converts glucose into ethanol and carbon dioxide through anaerobic fermentation.",
            "inputComponent": "Glucose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.9
          },
          {
            "description": "Advanced engineered strains of microorganisms convert xylose into ethanol and carbon dioxide, though less efficiently than glucose.",
            "inputComponent": "Xylose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.5
          },
          {
            "description": "Advanced engineered strains of microorganisms convert xylose into ethanol and carbon dioxide, though less efficiently than glucose.",
            "inputComponent": "Xylose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.5
          }
        ]
      },
      "additional_info": "The choice of microorganism and fermentation conditions can affect ethanol yield and productivity."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "Distillation is employed to separate ethanol from the fermentation broth. This unit operation utilizes the differences in boiling points to concentrate ethanol, typically achieving a purity of around 95%. The distillation process involves multiple stages, including beer column distillation and rectification, to efficiently recover ethanol while minimizing energy consumption.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of ethanol from fermentation broth using differences in boiling points through distillation.",
            "component": "Ethanol",
            "extractionRate": 0.95
          },
          {
            "description": "Water extracted alongside ethanol during the distillation process.",
            "component": "Water",
            "extractionRate": 0.05
          },
          {
            "description": "Unconverted sugars that remain in the stillage after distillation, not extracted into the ethanol stream.",
            "component": "Unconverted Sugars",
            "extractionRate": 0.0
          },
          {
            "description": "Microbial biomass that does not volatilize during distillation and remains in the stillage.",
            "component": "Microbial Biomass",
            "extractionRate": 0.0
          }
        ]
      },
      "additional_info": "Energy integration and heat recovery are critical for the economic viability of the distillation process."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The dehydration unit operation is designed to remove residual water from crude ethanol to achieve fuel-grade purity levels of 99% or higher. This is typically accomplished using molecular sieves or azeotropic distillation techniques. The removal of water is essential for producing ethanol that meets the specifications for blending with gasoline.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Fuel-Grade Ethanol",
        "Water"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Removal of water from crude ethanol to achieve high-purity fuel-grade ethanol using techniques like molecular sieves or azeotropic distillation.",
            "component": "Water",
            "extractionRate": 1.0
          }
        ]
      },
      "additional_info": "The choice of dehydration technology can impact the overall energy consumption and cost of the process."
    },
    "waste_treatment": {
      "unit_operation_id": "waste_treatment",
      "name": "Waste Treatment",
      "description": "This unit operation handles the treatment and disposal of waste streams generated throughout the process, including stillage and any residual biomass. Waste treatment may involve anaerobic digestion to produce biogas, which can be used as a renewable energy source, or other methods to minimize environmental impact and comply with regulations.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [
        "Treated Effluent",
        "Biogas"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Anaerobic digestion of unconverted sugars into biogas.",
            "inputComponent": "Unconverted Sugars",
            "outputComponent": "Methane",
            "conversionRate": 0.6
          },
          {
            "description": "Anaerobic digestion of unconverted sugars into carbon dioxide.",
            "inputComponent": "Unconverted Sugars",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.3
          },
          {
            "description": "Anaerobic digestion of microbial biomass into methane.",
            "inputComponent": "Microbial Biomass",
            "outputComponent": "Methane",
            "conversionRate": 0.5
          },
          {
            "description": "Anaerobic digestion of microbial biomass into carbon dioxide.",
            "inputComponent": "Microbial Biomass",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.4
          }
        ]
      },
      "additional_info": "Effective waste management is crucial for the sustainability and regulatory compliance of the ethanol production process."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is the initial feedstock consisting of lignocellulosic biomass. The stream contains a composition of 35-45% Cellulose, 25-35% Hemicellulose, 15-20% Lignin, and 5-10% Ash. It is crucial for the subsequent pretreatment process, which breaks down the cellulose and hemicellulose into fermentable sugars for ethanol production.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as the source for the Enzyme Solution, which contains cellulases and hemicellulases essential for the enzymatic hydrolysis of pretreated biomass. The Enzyme Solution is critical in breaking down cellulose and hemicellulose into fermentable sugars during the enzymatic hydrolysis process, facilitating the conversion of biomass into biofuels.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "microorganism culture source": {
      "unit_operation_id": "microorganism culture source",
      "name": "Microorganism Culture Source",
      "description": "This unit operation serves as a source for the Microorganism Culture stream, which consists of a culture of yeast and nutrients essential for the fermentation process. The Microorganism Culture is critical for converting sugars into ethanol during fermentation, ensuring optimal growth and activity of the microorganisms involved.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Microorganism Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "fuel_grade ethanol sink": {
      "unit_operation_id": "fuel_grade ethanol sink",
      "name": "Fuel-Grade Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Fuel-Grade Ethanol stream, which is a high-purity ethanol suitable for use as a biofuel. The sink collects the processed ethanol after dehydration, ensuring it meets the required specifications for fuel-grade quality. This operation is critical for the storage and distribution of ethanol, facilitating its integration into fuel supply chains.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Fuel-Grade Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "treated effluent sink": {
      "unit_operation_id": "treated effluent sink",
      "name": "Treated Effluent Sink",
      "description": "This unit operation serves as the final sink for the treated effluent stream, which consists of water and biogas. The treated effluent is the output from the Waste Treatment unit operation, where stillage is processed to remove contaminants and meet environmental discharge standards. The treated effluent is suitable for disposal or potential reuse, ensuring compliance with regulatory requirements.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Treated Effluent"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "process water source": {
      "unit_operation_id": "process water source",
      "name": "Process Water Source",
      "description": "This unit operation serves as a source for Process Water, which is essential for the pretreatment process of Corn Stover. The Process Water is utilized in various methods such as steam explosion or chemical treatments to facilitate the breakdown of the lignocellulosic structure, thereby enhancing the efficiency of subsequent enzymatic hydrolysis and fermentation processes.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Process Water"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "acid or alkali solution source": {
      "unit_operation_id": "acid or alkali solution source",
      "name": "Acid or Alkali Solution Source",
      "description": "This unit operation serves as a source for the Acid or Alkali Solution, which is essential for the pretreatment stage of the biomass conversion process. The solution may consist of either an acid, such as sulfuric acid, or an alkali, such as sodium hydroxide, mixed with water. This solution is crucial for breaking down hemicellulose and lignin in the biomass, facilitating the subsequent enzymatic hydrolysis and fermentation processes.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Acid or Alkali Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "lignin_rich residue sink": {
      "unit_operation_id": "lignin_rich residue sink",
      "name": "Lignin-Rich Residue Sink",
      "description": "This unit operation serves as a sink for the Lignin-Rich Residue stream, which is a byproduct generated during the pretreatment of Corn Stover. The stream primarily consists of lignin and ash, which are separated from the biomass during the pretreatment process. The Lignin-Rich Residue can be further processed for energy recovery or utilized in various applications such as biofuels, bioplastics, or as a soil amendment.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Lignin-Rich Residue"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "carbon dioxide sink": {
      "unit_operation_id": "carbon dioxide sink",
      "name": "Carbon Dioxide Sink",
      "description": "This unit operation serves as a sink for carbon dioxide, a byproduct generated during the fermentation process. In this operation, carbon dioxide is collected and managed, potentially for further utilization or safe disposal. The carbon dioxide is captured from the fermentation broth, where it is produced as microorganisms convert sugars into ethanol and carbon dioxide. This sink ensures that the carbon dioxide is effectively handled, minimizing emissions and environmental impact.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Carbon Dioxide"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "water sink": {
      "unit_operation_id": "water sink",
      "name": "Water Sink",
      "description": "This unit operation serves as a sink for the water removed during the dehydration process of crude ethanol. It collects the excess water that is separated to achieve the desired purity of fuel-grade ethanol. The water may be directed to waste treatment or recovery processes for further use or disposal.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Water"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "biogas sink": {
      "unit_operation_id": "biogas sink",
      "name": "Biogas Sink",
      "description": "The Biogas Sink is the terminus for the biogas stream produced during the anaerobic digestion of stillage. This unit operation captures the biogas, which primarily consists of methane and carbon dioxide, allowing it to be utilized as a renewable energy source. The sink ensures that the biogas is safely collected and stored for further use, minimizing emissions and maximizing energy recovery.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Biogas"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "The initial feedstock consisting of lignocellulosic biomass.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "Biomass with disrupted lignin structure and increased cellulose accessibility.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Ash": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulases and hemicellulases.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0,
        "Hemicellulase": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution rich in fermentable sugars derived from cellulose and hemicellulose.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin": 0,
        "Ash": 0
      }
    },
    "Microorganism Culture": {
      "name": "Microorganism Culture",
      "stream_id": "microorganism culture",
      "description": "A culture of yeast or bacteria used for fermentation.",
      "stream_type": "core",
      "source": "microorganism culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Yeast": 0,
        "Nutrients": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, unconverted sugars, and microbial biomass.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Carbon Dioxide": 0,
        "Water": 0,
        "Unconverted Sugars": 0,
        "Microbial Biomass": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "Ethanol with approximately 95% purity, suitable for further purification.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Water": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "Residue containing water, unconverted sugars, and microbial biomass.",
      "stream_type": "core",
      "source": "distillation",
      "target": "waste_treatment",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Unconverted Sugars": 0,
        "Microbial Biomass": 0
      }
    },
    "Fuel-Grade Ethanol": {
      "name": "Fuel-Grade Ethanol",
      "stream_id": "fuel_grade ethanol",
      "description": "High-purity ethanol suitable for use as a biofuel.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "fuel_grade ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Treated Effluent": {
      "name": "Treated Effluent",
      "stream_id": "treated effluent",
      "description": "Water and other components treated to meet environmental discharge standards.",
      "stream_type": "core",
      "source": "waste_treatment",
      "target": "treated effluent sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Biogas": 0
      }
    },
    "Process Water": {
      "name": "Process Water",
      "stream_id": "process water",
      "description": "Water used in the pretreatment process, often necessary for methods such as steam explosion or chemical treatments, to facilitate the breakdown of the lignocellulosic structure.",
      "stream_type": "aux",
      "source": "process water source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Water": 0
      }
    },
    "Acid or Alkali Solution": {
      "name": "Acid or Alkali Solution",
      "stream_id": "acid or alkali solution",
      "description": "Depending on the method used (acid hydrolysis or alkaline treatment), an acid (e.g., sulfuric acid) or alkali (e.g., sodium hydroxide) is typically required to aid in the breakdown of hemicellulose and lignin.",
      "stream_type": "aux",
      "source": "acid or alkali solution source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Acid or alkali": 0,
        "Water": 0
      }
    },
    "Lignin-Rich Residue": {
      "name": "Lignin-Rich Residue",
      "stream_id": "lignin_rich residue",
      "description": "A byproduct stream that could be separated during the pretreatment, containing a high concentration of lignin and possibly other non-hydrolyzed materials.",
      "stream_type": "aux",
      "source": "pretreatment",
      "target": "lignin_rich residue sink",
      "flow_rate": 0.0,
      "components": {
        "Lignin": 0,
        "Ash": 0
      }
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "stream_id": "carbon dioxide",
      "description": "Carbon dioxide is a byproduct of the fermentation process, where microorganisms convert sugars into ethanol and carbon dioxide.",
      "stream_type": "aux",
      "source": "fermentation",
      "target": "carbon dioxide sink",
      "flow_rate": 0.0,
      "components": {
        "Carbon Dioxide": 0
      }
    },
    "Water": {
      "name": "Water",
      "stream_id": "water",
      "description": "Water removed from crude ethanol during the dehydration process to achieve fuel-grade ethanol purity.",
      "stream_type": "aux",
      "source": "dehydration",
      "target": "water sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0
      }
    },
    "Biogas": {
      "name": "Biogas",
      "stream_id": "biogas",
      "description": "Biogas is typically produced during the anaerobic digestion process of treating stillage. It can be captured and used as a renewable energy source.",
      "stream_type": "aux",
      "source": "waste_treatment",
      "target": "biogas sink",
      "flow_rate": 0.0,
      "components": {
        "Methane": 0,
        "Carbon Dioxide": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Ash": {
      "name": "Ash",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Hemicellulase": {
      "name": "Hemicellulase",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Yeast": {
      "name": "Yeast",
      "properties": {}
    },
    "Nutrients": {
      "name": "Nutrients",
      "properties": {}
    },
    "Ethanol": {
      "name": "Ethanol",
      "properties": {}
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Unconverted Sugars": {
      "name": "Unconverted Sugars",
      "properties": {}
    },
    "Microbial Biomass": {
      "name": "Microbial Biomass",
      "properties": {}
    },
    "Biogas": {
      "name": "Biogas",
      "properties": {}
    },
    "Acid or alkali": {
      "name": "Acid or alkali",
      "properties": {}
    },
    "Methane": {
      "name": "Methane",
      "properties": {}
    }
  }
}