{
  "feedstocks": [
    {
      "name": "Corn Stover",
      "composition": "Primarily composed of cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%)",
      "key_specs": "Corn stover is the non-grain part of corn plants, including leaves, stalks, and cobs. It is typically harvested post-corn grain harvest and is considered a lignocellulosic biomass.",
      "volumetric_scale": "100,000 metric tons per year"
    }
  ],
  "products": [
    {
      "name": "Ethanol",
      "composition": "Typically 99.5% ethanol with trace amounts of water and other impurities",
      "key_specs": "Fuel-grade ethanol with a purity of 99.5% is required for blending with gasoline. It must meet ASTM D4806 standards for ethanol used in automotive spark-ignition engines.",
      "volumetric_scale": "40 million gallons per year"
    }
  ],
  "unit_operations": {
    "feedstock_preparation": {
      "unit_operation_id": "feedstock_preparation",
      "name": "Feedstock Preparation",
      "description": "The corn stover feedstock is first prepared for processing. This involves mechanical operations such as shredding and grinding to reduce the size of the biomass. The goal is to increase the surface area to enhance the efficiency of subsequent chemical reactions. The prepared biomass is then conveyed to the pretreatment section.",
      "unit_operation_type": "process",
      "order": 1,
      "input_streams": [
        "Raw Corn Stover"
      ],
      "output_streams": [
        "Prepared Corn Stover"
      ],
      "parameters": {},
      "additional_info": "Particle size reduction is crucial for efficient enzymatic hydrolysis in later stages."
    },
    "pretreatment": {
      "unit_operation_id": "pretreatment",
      "name": "Pretreatment",
      "description": "The prepared corn stover undergoes a pretreatment process to break down the lignin structure and make the cellulose and hemicellulose more accessible. This is typically achieved using dilute acid hydrolysis, which involves treating the biomass with a dilute acid solution. The process helps in the partial hydrolysis of hemicellulose and disrupts the lignin matrix.",
      "unit_operation_type": "process",
      "order": 2,
      "input_streams": [
        "Prepared Corn Stover",
        "Dilute Acid Solution"
      ],
      "output_streams": [
        "Pretreated Biomass"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Partial hydrolysis of hemicellulose to smaller sugar units, making them more accessible for further processing, while disrupting the lignin matrix.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Simple Sugars (e.g., Xylose)",
            "conversionRate": 0.3
          },
          {
            "description": "Disruption of the lignin matrix in the biomass, enhancing the accessibility of cellulose for subsequent enzymatic hydrolysis efforts.",
            "inputComponent": "Lignin",
            "outputComponent": "Disrupted Lignin Matrix",
            "conversionRate": 0.0
          }
        ]
      },
      "additional_info": "The choice of acid and concentration is critical to balance between effective pretreatment and minimizing sugar degradation."
    },
    "enzymatic_hydrolysis": {
      "unit_operation_id": "enzymatic_hydrolysis",
      "name": "Enzymatic Hydrolysis",
      "description": "The pretreated biomass is subjected to enzymatic hydrolysis, where specific enzymes are added to convert cellulose and hemicellulose into fermentable sugars. Enzymes such as cellulases and hemicellulases are used to catalyze the breakdown of complex carbohydrates into simple sugars like glucose and xylose.",
      "unit_operation_type": "process",
      "order": 3,
      "input_streams": [
        "Pretreated Biomass",
        "Enzyme Solution"
      ],
      "output_streams": [
        "Sugar Solution"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Cellulose is broken down into glucose monomers via cellulase action.",
            "inputComponent": "Cellulose",
            "outputComponent": "Glucose",
            "conversionRate": 0.85
          },
          {
            "description": "Hemicellulose, composed of various sugars, is particularly rich in xylose. Hemicellulase assists in breaking it down.",
            "inputComponent": "Hemicellulose",
            "outputComponent": "Xylose",
            "conversionRate": 0.75
          }
        ]
      },
      "additional_info": "Enzyme loading and reaction time are optimized to maximize sugar yield while minimizing enzyme costs."
    },
    "fermentation": {
      "unit_operation_id": "fermentation",
      "name": "Fermentation",
      "description": "The sugar solution is transferred to fermentation tanks where microorganisms, typically yeast, are introduced to convert the sugars into ethanol. This biological process involves the anaerobic conversion of glucose and xylose into ethanol and carbon dioxide.",
      "unit_operation_type": "process",
      "order": 4,
      "input_streams": [
        "Sugar Solution",
        "Yeast Culture"
      ],
      "output_streams": [
        "Fermentation Broth"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Conversion of glucose to ethanol and carbon dioxide during fermentation by yeast.",
            "inputComponent": "Glucose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.9
          },
          {
            "description": "Conversion of glucose to carbon dioxide during fermentation by yeast.",
            "inputComponent": "Glucose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.9
          },
          {
            "description": "Conversion of xylose to ethanol during fermentation, typically at lower efficiency depending on yeast strain.",
            "inputComponent": "Xylose",
            "outputComponent": "Ethanol",
            "conversionRate": 0.6
          },
          {
            "description": "Conversion of xylose to carbon dioxide during fermentation, also at lower efficiency depending on yeast strain.",
            "inputComponent": "Xylose",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.6
          }
        ]
      },
      "additional_info": "The fermentation process is optimized for ethanol yield and productivity, with considerations for yeast strain selection and nutrient supplementation."
    },
    "distillation": {
      "unit_operation_id": "distillation",
      "name": "Distillation",
      "description": "The fermentation broth is subjected to distillation to separate ethanol from the mixture. This involves heating the broth to vaporize ethanol, which is then condensed and collected as a concentrated product. The distillation process is crucial for achieving the desired ethanol purity.",
      "unit_operation_type": "process",
      "order": 5,
      "input_streams": [
        "Fermentation Broth"
      ],
      "output_streams": [
        "Crude Ethanol",
        "Stillage"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of ethanol from the fermentation broth by distillation, utilizing differences in boiling points.",
            "component": "Ethanol",
            "extractionRate": 0.9
          },
          {
            "description": "Water is partially extracted alongside ethanol due to azeotropic properties, however, remains significantly in the stillage.",
            "component": "Water",
            "extractionRate": 0.1
          },
          {
            "description": "Volatile impurities with boiling points close to ethanol may be extracted into the crude stream.",
            "component": "Impurities",
            "extractionRate": 0.2
          },
          {
            "description": "Yeast remains in the liquid phase and does not vaporize during the distillation process.",
            "component": "Yeast",
            "extractionRate": 0.0
          },
          {
            "description": "Residual sugars also remain in the stillage as their boiling points are higher than ethanol.",
            "component": "Residual Sugars",
            "extractionRate": 0.0
          }
        ]
      },
      "additional_info": "Energy efficiency and heat integration are key considerations in the distillation design to reduce operational costs."
    },
    "dehydration": {
      "unit_operation_id": "dehydration",
      "name": "Dehydration",
      "description": "The crude ethanol is further purified through a dehydration process to remove residual water and achieve fuel-grade ethanol purity. This is typically done using molecular sieves or azeotropic distillation to achieve the required 99.5% ethanol purity.",
      "unit_operation_type": "process",
      "order": 6,
      "input_streams": [
        "Crude Ethanol"
      ],
      "output_streams": [
        "Fuel-Grade Ethanol",
        "Water Stream"
      ],
      "parameters": {
        "separations": [
          {
            "description": "Separation of ethanol from water using molecular sieves, allowing ethanol to pass while retaining water.",
            "component": "Ethanol",
            "extractionRate": 0.995
          },
          {
            "description": "Separation of ethanol and water through azeotropic distillation, utilizing boiling point variations between the components.",
            "component": "Water",
            "extractionRate": 0.99
          }
        ]
      },
      "additional_info": "The dehydration process is designed to meet ASTM D4806 standards for ethanol purity."
    },
    "waste_treatment": {
      "unit_operation_id": "waste_treatment",
      "name": "Waste Treatment",
      "description": "The stillage and other waste streams generated throughout the process are treated to minimize environmental impact. This may involve anaerobic digestion to produce biogas, which can be used as an energy source, and further treatment to recover nutrients or produce animal feed.",
      "unit_operation_type": "process",
      "order": 7,
      "input_streams": [
        "Stillage"
      ],
      "output_streams": [
        "Treated Effluent",
        "Biogas"
      ],
      "parameters": {
        "conversions": [
          {
            "description": "Residual sugars are consumed by microorganisms in the absence of oxygen, producing methane and carbon dioxide as byproducts.",
            "inputComponent": "Residual Sugars",
            "outputComponent": "Methane",
            "conversionRate": 0.6
          },
          {
            "description": "During anaerobic digestion, residual sugars are partially converted to carbon dioxide by the microorganisms.",
            "inputComponent": "Residual Sugars",
            "outputComponent": "Carbon Dioxide",
            "conversionRate": 0.3
          },
          {
            "description": "Some yeast is consumed by the microorganisms, leading to the production of methane as the end product.",
            "inputComponent": "Yeast",
            "outputComponent": "Methane",
            "conversionRate": 0.1
          }
        ]
      },
      "additional_info": "Waste treatment is integrated with energy recovery systems to enhance process sustainability and reduce waste disposal costs."
    },
    "raw corn stover source": {
      "unit_operation_id": "raw corn stover source",
      "name": "Raw Corn Stover Source",
      "description": "This unit operation serves as the source for the Raw Corn Stover stream, which is the non-grain part of corn plants, including leaves, stalks, and cobs. It is primarily composed of cellulose (40-50%), hemicellulose (25-30%), and lignin (15-20%). The harvested corn stover is collected post-corn grain harvest and is prepared for further processing in the feedstock preparation unit.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Raw Corn Stover"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "dilute acid solution source": {
      "unit_operation_id": "dilute acid solution source",
      "name": "Dilute Acid Solution Source",
      "description": "This unit operation serves as a source for the Dilute Acid Solution, which is essential in the pretreatment stage of the biomass conversion process. The solution is designed to facilitate the breakdown of the lignocellulosic structure of the prepared corn stover, enhancing the accessibility of cellulose and hemicellulose for subsequent enzymatic hydrolysis. The Dilute Acid Solution typically consists of a mixture of acid and water, and is produced in sufficient quantities to meet the demands of the pretreatment unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Dilute Acid Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "enzyme solution source": {
      "unit_operation_id": "enzyme solution source",
      "name": "Enzyme Solution Source",
      "description": "This unit operation serves as a source for the Enzyme Solution, which contains cellulase and hemicellulase enzymes. These enzymes are critical for the enzymatic hydrolysis process, where they facilitate the breakdown of pretreated biomass into fermentable sugars. The Enzyme Solution is produced in a controlled environment to ensure optimal enzyme activity and stability, and it is supplied at the required volumetric scale to meet the demands of the enzymatic hydrolysis unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Enzyme Solution"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "yeast culture source": {
      "unit_operation_id": "yeast culture source",
      "name": "Yeast Culture Source",
      "description": "This unit operation serves as a source for the Yeast Culture stream, which consists of yeast cells specifically cultivated to ferment sugars into ethanol. The Yeast Culture is essential for the fermentation process, where yeast converts the sugar solution derived from pretreated biomass into ethanol and carbon dioxide. This stream is produced at an industrial scale to ensure a continuous supply for the fermentation unit operation.",
      "unit_operation_type": "source",
      "order": 0,
      "input_streams": [],
      "output_streams": [
        "Yeast Culture"
      ],
      "parameters": {},
      "additional_info": ""
    },
    "fuel_grade ethanol sink": {
      "unit_operation_id": "fuel_grade ethanol sink",
      "name": "Fuel-Grade Ethanol Sink",
      "description": "This unit operation serves as the final sink for the Fuel-Grade Ethanol stream, which is a high-purity ethanol product suitable for blending with gasoline. The sink ensures that the ethanol meets the required specifications for fuel-grade quality, maintaining a purity of 99.5% ethanol with minimal impurities. It acts as the terminus for the ethanol production process, facilitating the storage and distribution of the final product to end-users in the automotive fuel market.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Fuel-Grade Ethanol"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "water stream sink": {
      "unit_operation_id": "water stream sink",
      "name": "Water Stream Sink",
      "description": "This unit operation serves as the final sink for the separated water from the dehydration process. It is designed to collect and manage the water stream generated during the dehydration of crude ethanol into fuel-grade ethanol. The water stream, primarily composed of water, may be directed for further treatment, recycling, or disposal, depending on the overall process design and environmental regulations.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Water Stream"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "treated effluent sink": {
      "unit_operation_id": "treated effluent sink",
      "name": "Treated Effluent Sink",
      "description": "This unit operation serves as the final sink for the treated effluent stream, which consists of water and nutrients that have been processed to meet environmental discharge standards. The treated effluent is typically released into water bodies or used for irrigation, ensuring compliance with regulatory requirements while minimizing environmental impact.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Treated Effluent"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    },
    "biogas sink": {
      "unit_operation_id": "biogas sink",
      "name": "Biogas Sink",
      "description": "The Biogas Sink is the final unit operation in the process flow where biogas, primarily composed of methane and carbon dioxide, is collected and stored. This unit operation serves as a terminus for the biogas stream generated during the waste treatment phase of the process. The biogas can be utilized for energy production or further processing, ensuring efficient resource recovery from the organic waste.",
      "unit_operation_type": "sink",
      "order": 0,
      "input_streams": [
        "Biogas"
      ],
      "output_streams": [],
      "parameters": {},
      "additional_info": ""
    }
  },
  "streams": {
    "Raw Corn Stover": {
      "name": "Raw Corn Stover",
      "stream_id": "raw corn stover",
      "description": "The harvested corn stover, consisting of leaves, stalks, and cobs, is fed into the preparation unit.",
      "stream_type": "core",
      "source": "raw corn stover source",
      "target": "feedstock_preparation",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Prepared Corn Stover": {
      "name": "Prepared Corn Stover",
      "stream_id": "prepared corn stover",
      "description": "The corn stover is now in a smaller, more uniform particle size, ready for pretreatment.",
      "stream_type": "core",
      "source": "feedstock_preparation",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0
      }
    },
    "Dilute Acid Solution": {
      "name": "Dilute Acid Solution",
      "stream_id": "dilute acid solution",
      "description": "An acid solution used to facilitate the breakdown of lignocellulosic structure.",
      "stream_type": "core",
      "source": "dilute acid solution source",
      "target": "pretreatment",
      "flow_rate": 0.0,
      "components": {
        "Acid": 0,
        "Water": 0
      }
    },
    "Pretreated Biomass": {
      "name": "Pretreated Biomass",
      "stream_id": "pretreated biomass",
      "description": "The biomass with disrupted lignin structure, making cellulose and hemicellulose more accessible.",
      "stream_type": "core",
      "source": "pretreatment",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulose": 0,
        "Hemicellulose": 0,
        "Lignin": 0,
        "Acid": 0
      }
    },
    "Enzyme Solution": {
      "name": "Enzyme Solution",
      "stream_id": "enzyme solution",
      "description": "A solution containing cellulase and hemicellulase enzymes.",
      "stream_type": "core",
      "source": "enzyme solution source",
      "target": "enzymatic_hydrolysis",
      "flow_rate": 0.0,
      "components": {
        "Cellulase": 0,
        "Hemicellulase": 0
      }
    },
    "Sugar Solution": {
      "name": "Sugar Solution",
      "stream_id": "sugar solution",
      "description": "A solution rich in fermentable sugars, primarily glucose and xylose, along with residual lignin and acid.",
      "stream_type": "core",
      "source": "enzymatic_hydrolysis",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Glucose": 0,
        "Xylose": 0,
        "Lignin": 0,
        "Acid": 0
      }
    },
    "Yeast Culture": {
      "name": "Yeast Culture",
      "stream_id": "yeast culture",
      "description": "Yeast cells used to ferment sugars into ethanol.",
      "stream_type": "core",
      "source": "yeast culture source",
      "target": "fermentation",
      "flow_rate": 0.0,
      "components": {
        "Yeast": 0
      }
    },
    "Fermentation Broth": {
      "name": "Fermentation Broth",
      "stream_id": "fermentation broth",
      "description": "A mixture containing ethanol, unconverted sugars, yeast biomass, and other byproducts.",
      "stream_type": "core",
      "source": "fermentation",
      "target": "distillation",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Yeast": 0,
        "Residual Sugars": 0,
        "Carbon Dioxide": 0
      }
    },
    "Crude Ethanol": {
      "name": "Crude Ethanol",
      "stream_id": "crude ethanol",
      "description": "Ethanol with impurities, requiring further purification to meet fuel-grade standards.",
      "stream_type": "core",
      "source": "distillation",
      "target": "dehydration",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0,
        "Water": 0,
        "Impurities": 0
      }
    },
    "Stillage": {
      "name": "Stillage",
      "stream_id": "stillage",
      "description": "The residual liquid after ethanol removal, containing water, yeast, and unconverted sugars.",
      "stream_type": "core",
      "source": "distillation",
      "target": "waste_treatment",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Yeast": 0,
        "Residual Sugars": 0
      }
    },
    "Fuel-Grade Ethanol": {
      "name": "Fuel-Grade Ethanol",
      "stream_id": "fuel_grade ethanol",
      "description": "High-purity ethanol suitable for blending with gasoline.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "fuel_grade ethanol sink",
      "flow_rate": 0.0,
      "components": {
        "Ethanol": 0
      }
    },
    "Water Stream": {
      "name": "Water Stream",
      "stream_id": "water stream",
      "description": "Separated water from the dehydration process.",
      "stream_type": "core",
      "source": "dehydration",
      "target": "water stream sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0
      }
    },
    "Treated Effluent": {
      "name": "Treated Effluent",
      "stream_id": "treated effluent",
      "description": "Water and other components treated to meet environmental discharge standards.",
      "stream_type": "core",
      "source": "waste_treatment",
      "target": "treated effluent sink",
      "flow_rate": 0.0,
      "components": {
        "Water": 0,
        "Nutrients": 0
      }
    },
    "Biogas": {
      "name": "Biogas",
      "stream_id": "biogas",
      "description": "Methane-rich gas produced from anaerobic digestion of organic waste.",
      "stream_type": "core",
      "source": "waste_treatment",
      "target": "biogas sink",
      "flow_rate": 0.0,
      "components": {
        "Methane": 0,
        "Carbon Dioxide": 0
      }
    }
  },
  "components": {
    "Cellulose": {
      "name": "Cellulose",
      "properties": {}
    },
    "Hemicellulose": {
      "name": "Hemicellulose",
      "properties": {}
    },
    "Lignin": {
      "name": "Lignin",
      "properties": {}
    },
    "Acid": {
      "name": "Acid",
      "properties": {}
    },
    "Water": {
      "name": "Water",
      "properties": {}
    },
    "Cellulase": {
      "name": "Cellulase",
      "properties": {}
    },
    "Hemicellulase": {
      "name": "Hemicellulase",
      "properties": {}
    },
    "Glucose": {
      "name": "Glucose",
      "properties": {}
    },
    "Xylose": {
      "name": "Xylose",
      "properties": {}
    },
    "Yeast": {
      "name": "Yeast",
      "properties": {}
    },
    "Ethanol": {
      "name": "Ethanol",
      "properties": {}
    },
    "Residual Sugars": {
      "name": "Residual Sugars",
      "properties": {}
    },
    "Carbon Dioxide": {
      "name": "Carbon Dioxide",
      "properties": {}
    },
    "Impurities": {
      "name": "Impurities",
      "properties": {}
    },
    "Nutrients": {
      "name": "Nutrients",
      "properties": {}
    },
    "Methane": {
      "name": "Methane",
      "properties": {}
    }
  }
}